

<!DOCTYPE html>
<html lang="">
<head prefix="og: http://ogp.me/ns#">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="">
    <title>interview4 | YMR</title>

    <!-- Open Graph -->
    <meta name="description" content="###1.GC&amp;#x7B97;&amp;#x6CD5;1.1 &amp;#x6700;&amp;#x57FA;&amp;#x7840;&amp;#x7684;&amp;#x6536;&amp;#x96C6;&amp;#x7B97;&amp;#x6CD5; &amp;#x2014;&amp;#x2014; &amp;#x6807;&amp;#x8BB0;/&amp;#x6E05;&amp;#x9664;&amp;#x7B97;&amp;#x6CD5;&amp;#x5206;&amp;#x4E3A;&amp;#x201C;&amp;#x6807;&amp;#x8BB0;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="interview4">
<meta property="og:url" content="http://yoursite.com/2018/04/01/interview4/index.html">
<meta property="og:site_name" content="YMR">
<meta property="og:description" content="###1.GC&amp;#x7B97;&amp;#x6CD5;1.1 &amp;#x6700;&amp;#x57FA;&amp;#x7840;&amp;#x7684;&amp;#x6536;&amp;#x96C6;&amp;#x7B97;&amp;#x6CD5; &amp;#x2014;&amp;#x2014; &amp;#x6807;&amp;#x8BB0;/&amp;#x6E05;&amp;#x9664;&amp;#x7B97;&amp;#x6CD5;&amp;#x5206;&amp;#x4E3A;&amp;#x201C;&amp;#x6807;&amp;#x8BB0;&amp;#">
<meta property="og:updated_time" content="2018-04-01T16:55:00.291Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="interview4">
<meta name="twitter:description" content="###1.GC&amp;#x7B97;&amp;#x6CD5;1.1 &amp;#x6700;&amp;#x57FA;&amp;#x7840;&amp;#x7684;&amp;#x6536;&amp;#x96C6;&amp;#x7B97;&amp;#x6CD5; &amp;#x2014;&amp;#x2014; &amp;#x6807;&amp;#x8BB0;/&amp;#x6E05;&amp;#x9664;&amp;#x7B97;&amp;#x6CD5;&amp;#x5206;&amp;#x4E3A;&amp;#x201C;&amp;#x6807;&amp;#x8BB0;&amp;#">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "LEO CHEN",
  "url": "http://yoursite.com"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>YMR</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">LEO CHEN</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-interview4" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    interview4
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>###1.GC&#x7B97;&#x6CD5;<br>1.1 &#x6700;&#x57FA;&#x7840;&#x7684;&#x6536;&#x96C6;&#x7B97;&#x6CD5; &#x2014;&#x2014; &#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5;<br>&#x5206;&#x4E3A;&#x201C;&#x6807;&#x8BB0;&#x201D;&#x548C;&#x201C;&#x6E05;&#x9664;&#x201D;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;&#x9996;&#x5148;&#x6807;&#x8BB0;&#x51FA;&#x6240;&#x6709;&#x9700;&#x8981;&#x56DE;&#x6536;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;&#x6807;&#x8BB0;&#x5B8C;&#x6210;&#x540E;&#x7EDF;&#x4E00;&#x56DE;&#x6536;&#x6240;&#x6709;&#x88AB;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code>&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#xFF1A;&#x6807;&#x8BB0;&#x7684;&#x8FC7;&#x7A0B;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x53EF;&#x8FBE;&#x6027;&#x5206;&#x6790;&#x7B97;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x904D;&#x5386;&#x6240;&#x6709;&#x7684;GC Roots&#x5BF9;&#x8C61;&#xFF0C;&#x5BF9;&#x4ECE;GC Roots&#x5BF9;&#x8C61;&#x53EF;&#x8FBE;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x6253;&#x4E0A;&#x4E00;&#x4E2A;&#x6807;&#x8BC6;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x5728;&#x5BF9;&#x8C61;&#x7684;header&#x4E2D;&#xFF0C;&#x5C06;&#x5176;&#x8BB0;&#x5F55;&#x4E3A;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#xFF1B;

&#x6E05;&#x9664;&#x9636;&#x6BB5;&#xFF1A;&#x6E05;&#x9664;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x5BF9;&#x5806;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x904D;&#x5386;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x6CA1;&#x6709;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#xFF08;&#x901A;&#x8FC7;&#x8BFB;&#x53D6;&#x5BF9;&#x8C61;header&#x4FE1;&#x606F;&#xFF09;&#xFF0C;&#x5219;&#x5C06;&#x5176;&#x56DE;&#x6536;&#x3002;
</code></pre><p>&#x7F3A;&#x70B9;</p>
<pre><code>1&#x3001;&#x6548;&#x7387;&#x95EE;&#x9898;&#x3002;&#x6807;&#x8BB0;&#x548C;&#x6E05;&#x9664;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x6548;&#x7387;&#x90FD;&#x4E0D;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x9700;&#x8981;&#x904D;&#x5386;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x6570;&#x91CF;&#x662F;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#x7684;&#xFF0C;&#x8FD9;&#x65E0;&#x7591;&#x5F88;&#x8017;&#x8D39;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14;GC&#x65F6;&#x9700;&#x8981;&#x505C;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x975E;&#x5E38;&#x5DEE;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;

2&#x3001;&#x7A7A;&#x95F4;&#x95EE;&#x9898;&#x3002;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x4E4B;&#x540E;&#x4F1A;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x4E0D;&#x8FDE;&#x7EED;&#x7684;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF08;&#x4ECE;&#x4E0A;&#x56FE;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF09;&#xFF0C;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x788E;&#x7247;&#x592A;&#x591A;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4EE5;&#x540E;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x5206;&#x914D;&#x8F83;&#x5927;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#x800C;&#x4E0D;&#x5F97;&#x4E0D;&#x63D0;&#x524D;&#x89E6;&#x53D1;&#x53E6;&#x4E00;&#x6B21;&#x5783;&#x573E;&#x56DE;&#x6536;&#x52A8;&#x4F5C;&#x3002;
</code></pre><p>1.2&#x590D;&#x5236;&#x7B97;&#x6CD5;<br>&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x7684;&#x539F;&#x7406;&#x662F;&#xFF1A;&#x5C06;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x6309;&#x5BB9;&#x91CF;&#x5212;&#x5206;&#x4E3A;&#x5927;&#x5C0F;&#x76F8;&#x7B49;&#x7684;&#x4E24;&#x5757;&#xFF0C;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5757;&#x3002;&#x5F53;&#x8FD9;&#x4E00;&#x5757;&#x7684;&#x5185;&#x5B58;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x5C31;&#x5C06;&#x8FD8;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x4E00;&#x6B21;&#x6027;&#x6E05;&#x7406;&#x6389;&#x3002;<br>&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x6BCF;&#x6B21;&#x90FD;&#x662F;&#x5BF9;&#x6574;&#x4E2A;&#x534A;&#x533A;&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x51CF;&#x5C11;&#x4E86;&#x6807;&#x8BB0;&#x5BF9;&#x8C61;&#x904D;&#x5386;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5728;&#x6E05;&#x9664;&#x4F7F;&#x7528;&#x533A;&#x57DF;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x4E0D;&#x7528;&#x8FDB;&#x884C;&#x904D;&#x5386;&#xFF0C;&#x76F4;&#x63A5;&#x6E05;&#x7A7A;&#x6574;&#x4E2A;&#x533A;&#x57DF;&#x5185;&#x5B58;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x5C06;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;&#x4FDD;&#x7559;&#x533A;&#x57DF;&#x65F6;&#x4E5F;&#x662F;&#x6309;&#x5730;&#x5740;&#x987A;&#x5E8F;&#x5B58;&#x50A8;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x5185;&#x5B58;&#x788E;&#x7247;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x5185;&#x5B58;&#x65F6;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x5185;&#x5B58;&#x788E;&#x7247;&#x7B49;&#x590D;&#x6742;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x6309;&#x987A;&#x5E8F;&#x5206;&#x914D;&#x5185;&#x5B58;&#x5373;&#x53EF;&#x3002;</p>
<pre><code>&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x7B80;&#x5355;&#x9AD8;&#x6548;&#xFF0C;&#x4F18;&#x5316;&#x4E86;&#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x4F4E;&#x3001;&#x5185;&#x5B58;&#x788E;&#x7247;&#x591A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x7F3A;&#x70B9;&#x4E5F;&#x5F88;&#x660E;&#x663E;&#xFF1A;

1&#x3001;&#x5C06;&#x5185;&#x5B58;&#x7F29;&#x5C0F;&#x4E3A;&#x539F;&#x6765;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x6D6A;&#x8D39;&#x4E86;&#x4E00;&#x534A;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE3;&#x4EF7;&#x592A;&#x9AD8;&#xFF1B;

2&#x3001;&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x7684;&#x5B58;&#x6D3B;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x6781;&#x7AEF;&#x4E00;&#x70B9;&#x7684;&#x60C5;&#x51B5;&#x5047;&#x8BBE;&#x5BF9;&#x8C61;&#x5B58;&#x6D3B;&#x7387;&#x4E3A;100%&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x6240;&#x6709;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x4E00;&#x904D;&#xFF0C;&#x8017;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x4EE3;&#x4EF7;&#x4E5F;&#x662F;&#x4E0D;&#x53EF;&#x5FFD;&#x89C6;&#x7684;&#x3002;
</code></pre><p>&#x73B0;&#x5728;&#x7684;&#x5546;&#x4E1A;&#x865A;&#x62DF;&#x673A;&#x90FD;&#x91C7;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x6765;&#x56DE;&#x6536;&#x65B0;&#x751F;&#x4EE3;&#x3002;&#x7531;&#x4E8E;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x5B58;&#x6D3B;&#x7387;&#x4F4E;&#xFF0C;&#x6240;&#x4EE5;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x6309;&#x7167;1&#xFF1A;1&#x7684;&#x6BD4;&#x4F8B;&#x6765;&#x5212;&#x5206;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5185;&#x5B58;&#x5206;&#x4E3A;&#x4E00;&#x5757;&#x8F83;&#x5927;&#x7684;Eden&#x7A7A;&#x95F4;&#x548C;&#x4E24;&#x5757;&#x8F83;&#x5C0F;&#x7684;From Survivor&#x7A7A;&#x95F4;&#x3001;To Survivor&#x7A7A;&#x95F4;&#xFF0C;&#x4E09;&#x8005;&#x7684;&#x6BD4;&#x4F8B;&#x4E3A;8&#xFF1A;1&#xFF1A;1&#x3002;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;Eden&#x548C;From Survivor&#x533A;&#x57DF;&#xFF0C;To Survivor&#x4F5C;&#x4E3A;&#x4FDD;&#x7559;&#x7A7A;&#x95F4;&#x3002;GC&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x5BF9;&#x8C61;&#x53EA;&#x4F1A;&#x5B58;&#x5728;&#x4E8E;Eden&#x533A;&#x548C;From Survivor&#x533A;&#xFF0C;To Survivor&#x533A;&#x662F;&#x7A7A;&#x7684;&#x3002;GC&#x8FDB;&#x884C;&#x65F6;&#xFF0C;Eden&#x533A;&#x4E2D;&#x6240;&#x6709;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x4F1A;&#x88AB;&#x590D;&#x5236;&#x5230;To Survivor&#x533A;&#xFF0C;&#x800C;&#x5728;From Survivor&#x533A;&#x4E2D;&#xFF0C;&#x4ECD;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x6839;&#x636E;&#x5B83;&#x4EEC;&#x7684;&#x5E74;&#x9F84;&#x503C;&#x51B3;&#x5B9A;&#x53BB;&#x5411;&#xFF0C;&#x5E74;&#x9F84;&#x503C;&#x8FBE;&#x5230;&#x5E74;&#x9F84;&#x9600;&#x503C;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;15&#xFF0C;&#x65B0;&#x751F;&#x4EE3;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x6BCF;&#x71AC;&#x8FC7;&#x4E00;&#x8F6E;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x5E74;&#x9F84;&#x503C;&#x5C31;&#x52A0;1&#xFF09;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x88AB;&#x79FB;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x9600;&#x503C;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x88AB;&#x590D;&#x5236;&#x5230;To Survivor&#x533A;&#x3002;&#x63A5;&#x7740;&#x6E05;&#x7A7A;Eden&#x533A;&#x548C;From Survivor&#x533A;&#xFF0C;&#x65B0;&#x751F;&#x4EE3;&#x4E2D;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x5728;To Survivor&#x533A;&#x3002;&#x63A5;&#x7740;&#xFF0C; From Survivor&#x533A;&#x548C;To Survivor&#x533A;&#x4F1A;&#x4EA4;&#x6362;&#x5B83;&#x4EEC;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x65B0;&#x7684;To Survivor&#x533A;&#x5C31;&#x662F;&#x4E0A;&#x6B21;GC&#x6E05;&#x7A7A;&#x7684;From Survivor&#x533A;&#xFF0C;&#x65B0;&#x7684;From Survivor&#x533A;&#x5C31;&#x662F;&#x4E0A;&#x6B21;GC&#x7684;To Survivor&#x533A;&#xFF0C;&#x603B;&#x4E4B;&#xFF0C;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#x90FD;&#x4F1A;&#x4FDD;&#x8BC1;To Survivor&#x533A;&#x5728;&#x4E00;&#x8F6E;GC&#x540E;&#x662F;&#x7A7A;&#x7684;&#x3002;GC&#x65F6;&#x5F53;To Survivor&#x533A;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x5B58;&#x653E;&#x4E0A;&#x4E00;&#x6B21;&#x65B0;&#x751F;&#x4EE3;&#x6536;&#x96C6;&#x4E0B;&#x6765;&#x7684;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x8001;&#x5E74;&#x4EE3;&#x8FDB;&#x884C;&#x5206;&#x914D;&#x62C5;&#x4FDD;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5B58;&#x653E;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#x3002;</p>
<p>1.3&#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5;<br> &#x590D;&#x5236;&#x7B97;&#x6CD5;&#x5728;&#x5BF9;&#x8C61;&#x5B58;&#x6D3B;&#x7387;&#x8F83;&#x9AD8;&#x65F6;&#x8981;&#x8FDB;&#x884C;&#x8F83;&#x591A;&#x7684;&#x590D;&#x5236;&#x64CD;&#x4F5C;&#xFF0C;&#x6548;&#x7387;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x4F4E;&#xFF0C;&#x66F4;&#x5173;&#x952E;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x60F3;&#x6D6A;&#x8D39;50%&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6709;&#x989D;&#x5916;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x5206;&#x914D;&#x62C5;&#x4FDD;&#xFF0C;&#x4EE5;&#x5E94;&#x5BF9;&#x5185;&#x5B58;&#x4E2D;&#x5BF9;&#x8C61;100%&#x5B58;&#x6D3B;&#x7684;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#x7531;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x5B58;&#x6D3B;&#x7387;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x5C31;&#x4E0D;&#x5408;&#x9002;&#x4E86;&#x3002;&#x6839;&#x636E;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x9AD8;&#x4EBA;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#xFF1A;&#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x3002;&#x4ECE;&#x540D;&#x5B57;&#x4E0A;&#x770B;&#xFF0C;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x4E0E;&#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x5F88;&#x50CF;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x7684;&#x6807;&#x8BB0;&#x8FC7;&#x7A0B;&#x4EFB;&#x7136;&#x4E0E;&#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x540E;&#x7EED;&#x6B65;&#x9AA4;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5BF9;&#x53EF;&#x56DE;&#x6536;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#xFF0C;&#x800C;&#x662F;&#x8BA9;&#x6240;&#x6709;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x5411;&#x4E00;&#x7AEF;&#x79FB;&#x52A8;&#xFF0C;&#x7136;&#x540E;&#x76F4;&#x63A5;&#x6E05;&#x7406;&#x6389;&#x7AEF;&#x8FB9;&#x7EBF;&#x4EE5;&#x5916;&#x7684;&#x5185;&#x5B58;&#x3002;<br> &#x56DE;&#x6536;&#x540E;&#x53EF;&#x56DE;&#x6536;&#x5BF9;&#x8C61;&#x88AB;&#x6E05;&#x7406;&#x6389;&#x4E86;&#xFF0C;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x6309;&#x89C4;&#x5219;&#x6392;&#x5217;&#x5B58;&#x653E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x7ED9;&#x65B0;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x5185;&#x5B58;&#x65F6;&#xFF0C;jvm&#x53EA;&#x9700;&#x8981;&#x6301;&#x6709;&#x5185;&#x5B58;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;&#x5373;&#x53EF;&#x3002;&#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x4E0D;&#x4EC5;&#x5F25;&#x8865;&#x4E86;&#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x788E;&#x7247;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x6D88;&#x9664;&#x4E86;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x5185;&#x5B58;&#x51CF;&#x534A;&#x7684;&#x9AD8;&#x989D;&#x4EE3;&#x4EF7;&#xFF0C;&#x53EF;&#x8C13;&#x4E00;&#x4E3E;&#x4E24;&#x5F97;&#x3002;&#x4F46;&#x4EFB;&#x4F55;&#x7B97;&#x6CD5;&#x90FD;&#x6709;&#x7F3A;&#x70B9;&#xFF0C;&#x5C31;&#x50CF;&#x4EBA;&#x65E0;&#x5B8C;&#x4EBA;&#xFF0C;&#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x6548;&#x7387;&#x4E5F;&#x4E0D;&#x9AD8;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x6807;&#x8BB0;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD8;&#x8981;&#x6574;&#x7406;&#x6240;&#x6709;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x5730;&#x5740;&#xFF0C;&#x5728;&#x6548;&#x7387;&#x4E0A;&#x4E0D;&#x5982;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x5BF9;&#x6BD4;</p>
<pre><code>&#x6548;&#x7387;&#xFF1A;&#x590D;&#x5236;&#x7B97;&#x6CD5; &gt; &#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5; &gt; &#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#xFF08;&#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x6709;&#x5185;&#x5B58;&#x788E;&#x7247;&#x95EE;&#x9898;&#xFF0C;&#x7ED9;&#x5927;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x5185;&#x5B58;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x89E6;&#x53D1;&#x65B0;&#x4E00;&#x8F6E;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF09;

&#x5185;&#x5B58;&#x6574;&#x9F50;&#x7387;&#xFF1A;&#x590D;&#x5236;&#x7B97;&#x6CD5; = &#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5; &gt; &#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5;

&#x5185;&#x5B58;&#x5229;&#x7528;&#x7387;&#xFF1A;&#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5; = &#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x7B97;&#x6CD5; &gt; &#x590D;&#x5236;&#x7B97;&#x6CD5;
</code></pre><p>1.4&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x7B97;&#x6CD5;<br>&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x6309;&#x5BF9;&#x8C61;&#x7684;&#x5B58;&#x6D3B;&#x5468;&#x671F;&#x4E0D;&#x540C;&#x5C06;&#x5185;&#x5B58;&#x5212;&#x5206;&#x4E3A;&#x51E0;&#x5757;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x628A;Java&#x5806;&#x5206;&#x4E3A;&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#xFF08;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6C38;&#x4E45;&#x4EE3;&#xFF0C;&#x662F;HotSpot&#x7279;&#x6709;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x865A;&#x62DF;&#x673A;&#x5B9E;&#x73B0;&#x6CA1;&#x6709;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#xFF0C;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x6536;&#x96C6;&#x6548;&#x679C;&#x5F88;&#x5DEE;&#xFF0C;&#x4E00;&#x822C;&#x5F88;&#x5C11;&#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5404;&#x4E2A;&#x5E74;&#x4EE3;&#x7684;&#x7279;&#x70B9;&#x91C7;&#x7528;&#x6700;&#x5408;&#x9002;&#x7684;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x3002;</p>
<pre><code>&#x65B0;&#x751F;&#x4EE3;&#xFF1A;&#x671D;&#x751F;&#x5915;&#x706D;&#xFF0C;&#x5B58;&#x6D3B;&#x65F6;&#x95F4;&#x5F88;&#x77ED;&#x3002;

&#x8001;&#x5E74;&#x4EE3;&#xFF1A;&#x7ECF;&#x8FC7;&#x591A;&#x6B21;Minor GC&#x800C;&#x5B58;&#x6D3B;&#x4E0B;&#x6765;&#xFF0C;&#x5B58;&#x6D3B;&#x5468;&#x671F;&#x957F;&#x3002;

&#x5728;&#x65B0;&#x751F;&#x4EE3;&#x4E2D;&#x6BCF;&#x6B21;&#x5783;&#x573E;&#x56DE;&#x6536;&#x90FD;&#x53D1;&#x73B0;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5BF9;&#x8C61;&#x6B7B;&#x53BB;&#xFF0C;&#x53EA;&#x6709;&#x5C11;&#x91CF;&#x5B58;&#x6D3B;&#xFF0C;&#x56E0;&#x6B64;&#x91C7;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x56DE;&#x6536;&#x65B0;&#x751F;&#x4EE3;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x5C11;&#x91CF;&#x5BF9;&#x8C61;&#x7684;&#x590D;&#x5236;&#x6210;&#x672C;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x6536;&#x96C6;&#xFF1B;&#x800C;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x5B58;&#x6D3B;&#x7387;&#x9AD8;&#xFF0C;&#x4E0D;&#x9002;&#x5408;&#x91C7;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x5982;&#x679C;&#x8001;&#x5E74;&#x4EE3;&#x91C7;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x662F;&#x6CA1;&#x6709;&#x989D;&#x5916;&#x7684;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x5206;&#x914D;&#x62C5;&#x4FDD;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x6807;&#x8BB0;/&#x6E05;&#x7406;&#x7B97;&#x6CD5;&#x6216;&#x8005;&#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x6765;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x3002;

&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x5C31;&#x662F;&#xFF0C;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x7684;&#x539F;&#x7406;&#x662F;&#x91C7;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x6765;&#x6536;&#x96C6;&#x65B0;&#x751F;&#x4EE3;&#xFF0C;&#x91C7;&#x7528;&#x6807;&#x8BB0;/&#x6E05;&#x7406;&#x7B97;&#x6CD5;&#x6216;&#x8005;&#x6807;&#x8BB0;/&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x6536;&#x96C6;&#x8001;&#x5E74;&#x4EE3;&#x3002;
</code></pre><p>1.5&#x5171;&#x540C;&#x70B9;<br>&#x5F53;GC&#x7EBF;&#x7A0B;&#x542F;&#x52A8;&#x65F6;&#xFF08;&#x5373;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF09;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x8981;&#x6682;&#x505C;&#xFF08;Stop The World&#xFF09;</p>
<p>###2.GC&#x6536;&#x96C6;&#x5668;<br>1.1 Serial&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;<br>&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x70B9;&#xFF1A;&#x7B2C;&#x4E00;&#xFF0C;&#x5B83;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x5355;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF0C;&#x5B83;&#x72EC;&#x5360;&#x5F0F;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;</p>
<p>&#x5728;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#xFF0C;Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x9700;&#x8981;&#x6682;&#x505C;&#xFF08;&#x201C;StopThe World&#x201D;)&#xFF0C;&#x7B49;&#x5F85;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x6837;&#x7ED9;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x9020;&#x6210;&#x8F83;&#x5DEE;&#x6548;&#x679C;&#x3002;&#x867D;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x5374;&#x662F;&#x4E00;&#x4E2A;&#x6210;&#x719F;&#x3001;&#x7ECF;&#x8FC7;&#x957F;&#x65F6;&#x95F4;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x8003;&#x9A8C;&#x7684;&#x6781;&#x4E3A;&#x9AD8;&#x6548;&#x7684;&#x6536;&#x96C6;&#x5668;&#x3002;&#x65B0;&#x751F;&#x4EE3;&#x4E32;&#x884C;&#x5904;&#x7406;&#x5668;&#x4F7F;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#xFF0C;&#x5B9E;&#x73B0;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x903B;&#x8F91;&#x5904;&#x7406;&#x7279;&#x522B;&#x9AD8;&#x6548;&#xFF0C;&#x4E14;&#x6CA1;&#x6709;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x7684;&#x5F00;&#x9500;&#x3002;&#x5728;&#x8BF8;&#x5982;&#x5355; CPU &#x5904;&#x7406;&#x5668;&#x6216;&#x8005;&#x8F83;&#x5C0F;&#x7684;&#x5E94;&#x7528;&#x5185;&#x5B58;&#x7B49;&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x4F18;&#x8D8A;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x5B83;&#x7684;&#x6027;&#x80FD;&#x8868;&#x73B0;&#x53EF;&#x4EE5;&#x8D85;&#x8FC7;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x548C;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x5668;&#x3002;&#x5728; HotSpot &#x865A;&#x62DF;&#x673A;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;-XX&#xFF1A;+UseSerialGC &#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4F7F;&#x7528;&#x65B0;&#x751F;&#x4EE3;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<ul class="ui list">
<li><p>&#x65B0;&#x751F;&#x4EE3;&#x3001;&#x8001;&#x5E74;&#x4EE3;&#x4F7F;&#x7528;&#x4E32;&#x884C;&#x56DE;&#x6536;&#x3002;</p>
</li>
<li><p>&#x65B0;&#x751F;&#x4EE3;&#x4F7F;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x8001;&#x5E74;&#x4EE3;&#x4F7F;&#x7528;&#x6807;&#x8BB0;-&#x538B;&#x7F29;&#x7B97;&#x6CD5;</p>
</li>
</ul>
<p>1.2 ParNew&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;<br>&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x662F;&#x5DE5;&#x4F5C;&#x5728;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5B83;&#x53EA;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;&#x591A;&#x7EBF;&#x7A0B;&#x5316;&#x3002;&#x5B83;&#x7684;&#x56DE;&#x6536;&#x7B56;&#x7565;&#x3001;&#x7B97;&#x6CD5;&#x4EE5;&#x53CA;&#x53C2;&#x6570;&#x548C;&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;&#x4E00;&#x6837;&#x3002;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x4E5F;&#x662F;&#x72EC;&#x5360;&#x5F0F;&#x7684;&#x56DE;&#x6536;&#x5668;&#xFF0C;&#x5728;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x5168;&#x90E8;&#x6682;&#x505C;&#x3002;</p>
<p>&#x4F46;&#x7531;&#x4E8E;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5E76;&#x53D1;&#x80FD;&#x529B;&#x6BD4;&#x8F83;&#x5F3A;&#x7684; CPU&#x4E0A;&#xFF0C;&#x5B83;&#x4EA7;&#x751F;&#x7684;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x8981;&#x77ED;&#x4E8E;&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;&#xFF0C;&#x800C;&#x5728;&#x5355; CPU &#x6216;&#x8005;&#x5E76;&#x53D1;&#x80FD;&#x529B;&#x8F83;&#x5F31;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x7684;&#x6548;&#x679C;&#x4E0D;&#x4F1A;&#x6BD4;&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;&#x597D;&#xFF0C;&#x7531;&#x4E8E;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x5B83;&#x7684;&#x5B9E;&#x9645;&#x8868;&#x73B0;&#x5F88;&#x53EF;&#x80FD;&#x6BD4;&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;&#x5DEE;&#x3002;&#x5F00;&#x542F;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53C2;&#x6570;-XX:+UseParNewGC&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x65B0;&#x751F;&#x4EE3;&#x4F7F;&#x7528;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x4F7F;&#x7528;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x3002;&#x4F7F;&#x7528;-XX:ParallelGCThreads &#x9650;&#x5236;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x3002;</p>
<p>1.3 Parallel&#x6536;&#x96C6;&#x5668;<br>Parallel&#x6536;&#x96C6;&#x5668;&#x7C7B;&#x5047;&#x4E8E;ParNew&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x7684;&#x6536;&#x96C6;&#x5668;&#x3002;&#x4ECE;&#x8868;&#x9762;&#x4E0A;&#x770B;&#xFF0C;&#x5B83;&#x548C;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x4E00;&#x6837;&#x90FD;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x3001;&#x72EC;&#x5360;&#x5F0F;&#x7684;&#x6536;&#x96C6;&#x5668;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x6536;&#x96C6;&#x5668;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x5B83;&#x975E;&#x5E38;&#x5173;&#x6CE8;&#x7CFB;&#x7EDF;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>Parallel&#x6536;&#x96C6;&#x5668;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x53C2;&#x6570;&#x542F;&#x7528;&#xFF1A;</p>
<p>-XX:+UseParallelGC:&#x65B0;&#x751F;&#x4EE3;&#x4F7F;&#x7528;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x4F7F;&#x7528;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<p>-XX:+UseParallelOldGC:&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x90FD;&#x662F;&#x7528;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x77DB;&#x76FE;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x548C;&#x541E;&#x5410;&#x91CF;&#x4E0D;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>-XX:MaxGCPauseMills&#xFF1A;&#x6700;&#x5927;&#x505C;&#x987F;&#x65F6;&#x95F4;&#xFF0C;&#x5355;&#x4F4D;&#x6BEB;&#x79D2;&#x3002;GC&#x5C3D;&#x529B;&#x4FDD;&#x8BC1;&#x56DE;&#x6536;&#x65F6;&#x95F4;&#x4E0D;&#x8D85;&#x8FC7;&#x8BBE;&#x5B9A;&#x503C;&#x3002;</p>
<p>-XX:GCTimeRatio&#xFF1A;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65F6;&#x95F4;&#x5360;&#x603B;&#x65F6;&#x95F4;&#x7684;&#x6BD4;&#xFF0C;0-100&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x9ED8;&#x8BA4;99&#xFF0C;&#x5373;&#x6700;&#x5927;&#x5141;&#x8BB8;1%&#x65F6;&#x95F4;&#x505A;GC&#x3002;</p>
<p>1.4 CMS &#x6536;&#x96C6;&#x5668;<br>CMS &#x662F; Concurrent Mark Sweep &#x7684;&#x7F29;&#x5199;&#xFF0C;&#x610F;&#x4E3A;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#xFF0C;&#x4ECE;&#x540D;&#x79F0;&#x4E0A;&#x53EF;&#x4EE5;&#x5F97;&#x77E5;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x6807;&#x8BB0;-&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x3002;&#x4E0E;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x6536;&#x96C6;&#x5668;&#x4E0D;&#x540C;&#xFF0C;CMS &#x6536;&#x96C6;&#x5668;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x4E8E;&#x7CFB;&#x7EDF;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002;</p>
<p>CMS &#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x4E3B;&#x8981;&#x6B65;&#x9AA4;&#x6709;&#xFF1A;</p>
<p>&#x521D;&#x59CB;&#x6807;&#x8BB0;(CMS initial mark): &#x6839;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5173;&#x8054;&#x5230;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x901F;&#x5EA6;&#x6BD4;&#x8F83;&#x5FEB;&#x3002;</p>
<p>&#x5E76;&#x53D1;&#x6807;&#x8BB0;(CMS concurrent mark):&#x4E3B;&#x8981;&#x6807;&#x8BB0;&#x8FC7;&#x7A0B;&#xFF0C;&#x6807;&#x8BB0;&#x5168;&#x90E8;&#x5BF9;&#x8C61;&#x3002;&#x6CE8;&#xFF1A;&#x548C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4E00;&#x8D77;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x91CD;&#x65B0;&#x6807;&#x8BB0;(CMS remark): &#x7531;&#x4E8E;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4F9D;&#x7136;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6B63;&#x5F0F;&#x6E05;&#x7406;&#x524D;&#xFF0C;&#x518D;&#x505A;&#x4FEE;&#x6B63;&#x3002;</p>
<p>&#x5E76;&#x53D1;&#x6E05;&#x9664;&#x548C;&#x5E76;&#x53D1;&#x91CD;&#x7F6E;(CMS concurrent sweep): &#x57FA;&#x4E8E;&#x6807;&#x8BB0;&#x7ED3;&#x679C;&#xFF0C;&#x76F4;&#x63A5;&#x6E05;&#x7406;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x548C;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x662F;&#x72EC;&#x5360;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#xFF0C;&#x800C;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x3001;&#x5E76;&#x53D1;&#x6E05;&#x9664;&#x548C;&#x5E76;&#x53D1;&#x91CD;&#x7F6E;&#x662F;&#x53EF;&#x4EE5;&#x548C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4E00;&#x8D77;&#x6267;&#x884C;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ECE;&#x6574;&#x4F53;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;CMS &#x6536;&#x96C6;&#x4E0D;&#x662F;&#x72EC;&#x5360;&#x5F0F;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;</p>
<p>CMS &#x6536;&#x96C6;&#x5668;&#x5728;&#x5176;&#x4E3B;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x9636;&#x6BB5;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x66B4;&#x529B;&#x5730;&#x5F7B;&#x5E95;&#x6682;&#x505C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5B83;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x76F8;&#x4E92;&#x62A2;&#x5360; CPU&#xFF0C;&#x6240;&#x4EE5;&#x5728; CMS &#x6267;&#x884C;&#x671F;&#x5185;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x541E;&#x5410;&#x91CF;&#x9020;&#x6210;&#x4E00;&#x5B9A;&#x5F71;&#x54CD;&#x3002;CMS &#x9ED8;&#x8BA4;&#x542F;&#x52A8;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x662F;(ParallelGCThreads+3)/4),ParallelGCThreads &#x662F;&#x65B0;&#x751F;&#x4EE3;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;-XX:ParallelCMSThreads &#x53C2;&#x6570;&#x624B;&#x5DE5;&#x8BBE;&#x5B9A; CMS&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x3002;&#x5F53; CPU &#x8D44;&#x6E90;&#x6BD4;&#x8F83;&#x7D27;&#x5F20;&#x65F6;&#xFF0C;&#x53D7;&#x5230; CMS&#x6536;&#x96C6;&#x5668;&#x7EBF;&#x7A0B;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x7CDF;&#x7CD5;&#x3002;</p>
<p>&#x6807;&#x8BB0;-&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x5C06;&#x4F1A;&#x9020;&#x6210;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x79BB;&#x6563;&#x7684;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x65E0;&#x6CD5;&#x5206;&#x914D;&#x8F83;&#x5927;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5373;&#x4F7F;&#x5806;&#x5185;&#x5B58;&#x4ECD;&#x7136;&#x6709;&#x8F83;&#x5927;&#x7684;&#x5269;&#x4F59;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x8FEB;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x4EE5;&#x6362;&#x53D6;&#x4E00;&#x5757;&#x53EF;&#x7528;&#x7684;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x5BF9;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x662F;&#x76F8;&#x5F53;&#x4E0D;&#x5229;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;CMS &#x6536;&#x96C6;&#x5668;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x51E0;&#x4E2A;&#x7528;&#x4E8E;&#x5185;&#x5B58;&#x538B;&#x7F29;&#x6574;&#x7406;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>-XX:+UseCMSCompactAtFullCollection&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x4F7F; CMS &#x5728;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5185;&#x5B58;&#x788E;&#x7247;&#x6574;&#x7406;&#x3002;&#x5185;&#x5B58;&#x788E;&#x7247;&#x7684;&#x6574;&#x7406;&#x5E76;&#x4E0D;&#x662F;&#x5E76;&#x53D1;&#x8FDB;&#x884C;&#x7684;&#x3002;</p>
<p>-XX:CMSFullGCsBeforeCompaction&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BBE;&#x5B9A;&#x8FDB;&#x884C;&#x591A;&#x5C11;&#x6B21; CMS &#x56DE;&#x6536;&#x540E;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5185;&#x5B58;&#x538B;&#x7F29;&#x3002;</p>
<p>-XX:ParallelCMSThreads&#x8BBE;&#x5B9A;CMS&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x3002;</p>
<p>CMS&#x7279;&#x70B9;&#xFF1A;</p>
<ul class="ui list">
<li><p>&#x5C3D;&#x53EF;&#x80FD;&#x964D;&#x4F4E;&#x505C;&#x987F;</p>
</li>
<li><p>&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x541E;&#x5410;&#x91CF;&#x548C;&#x6027;&#x80FD;</p>
</li>
</ul>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5206;&#x4E00;&#x534A;CPU&#x53BB;&#x505A;GC&#xFF0C;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x5728;GC&#x9636;&#x6BB5;&#xFF0C;&#x53CD;&#x5E94;&#x901F;&#x5EA6;&#x5C31;&#x4E0B;&#x964D;&#x4E00;&#x534A;</p>
<ul class="ui list">
<li><p>&#x6E05;&#x7406;&#x4E0D;&#x5F7B;&#x5E95;</p>
<p>&#x56E0;&#x4E3A;&#x5728;&#x6E05;&#x7406;&#x9636;&#x6BB5;&#xFF0C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x8FD8;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x5783;&#x573E;&#xFF0C;&#x65E0;&#x6CD5;&#x6E05;&#x7406;&#x3002;  </p>
<p>&#x56E0;&#x4E3A;&#x548C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4E00;&#x8D77;&#x8FD0;&#x884C;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x7A7A;&#x95F4;&#x5FEB;&#x6EE1;&#x65F6;&#x518D;&#x6E05;&#x7406;&#x3002;</p>
<p>-XX:CMSInitiatingOccupancyFraction&#x8BBE;&#x7F6E;&#x89E6;&#x53D1;GC&#x7684;&#x9608;&#x503C;</p>
<p>&#x5982;&#x679C;&#x4E0D;&#x5E78;&#x5185;&#x5B58;&#x9884;&#x7559;&#x7A7A;&#x95F4;&#x4E0D;&#x591F;&#xFF0C;&#x5C31;&#x4F1A;&#x5F15;&#x8D77;concurrent mode failure&#xFF0C;&#x4EA7;&#x751F;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x4F7F;&#x7528;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x518D;&#x6B21;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5185;&#x5B58;&#x57FA;&#x672C;&#x88AB;&#x5360;&#x7528;&#x6EE1;&#x4E86;&#xFF0C;&#x901A;&#x5E38;GC&#x505C;&#x987F;&#x7684;&#x65F6;&#x95F4;&#x8F83;&#x957F;&#x3002;</p>
</li>
</ul>
<p>1.5 G1&#x6536;&#x96C6;&#x5668;(Garbage First)<br>G1&#x6536;&#x96C6;&#x5668;&#x4E0E;&#x524D;&#x9762;&#x7684;CMS&#x6536;&#x96C6;&#x5668;&#x76F8;&#x6BD4;&#x6709;&#x4E24;&#x4E2A;&#x663E;&#x8457;&#x7684;&#x6539;&#x8FDB;&#xFF1A;&#x4E00;&#x662F;G1&#x6536;&#x96C6;&#x5668;&#x662F;&#x57FA;&#x4E8E;&#x201C;&#x6807;&#x8BB0;-&#x6574;&#x7406;&#x201D;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x7A7A;&#x95F4;&#x788E;&#x7247;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x4E8C;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x7CBE;&#x786E;&#x5730;&#x63A7;&#x5236;&#x505C;&#x987F;&#xFF0C;&#x65E2;&#x80FD;&#x8BA9;&#x4F7F;&#x7528;&#x8005;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x5728;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;M&#x6BEB;&#x79D2;&#x7684;&#x65F6;&#x95F4;&#x7247;&#x6BB5;&#x5185;&#xFF0C;&#x6D88;&#x8017;&#x5728;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7;N&#x6BEB;&#x79D2;&#xFF0C;&#x8FD9;&#x51E0;&#x4E4E;&#x5DF2;&#x7ECF;&#x662F;&#x5B9E;&#x65F6;Java&#xFF08;RTSJ&#xFF09;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x7279;&#x5F81;&#x4E86;&#x3002;G1&#x6536;&#x96C6;&#x5668;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5728;&#x57FA;&#x672C;&#x4E0D;&#x727A;&#x7272;&#x541E;&#x5410;&#x91CF;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5B8C;&#x6210;&#x4F4E;&#x505C;&#x987F;&#x7684;&#x5185;&#x5B58;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x5B83;&#x80FD;&#x591F;&#x6781;&#x529B;&#x5730;&#x907F;&#x514D;&#x5168;&#x533A;&#x57DF;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x4E4B;&#x524D;&#x7684;&#x6536;&#x96C6;&#x5668;&#x8FDB;&#x884C;&#x6536;&#x96C6;&#x7684;&#x8303;&#x56F4;&#x90FD;&#x662F;&#x6574;&#x4E2A;&#x65B0;&#x751F;&#x4EE3;&#x6216;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x800C;G1&#x5C06;&#x6574;&#x4E2A;Java&#x5806;&#xFF08;&#x5305;&#x62EC;&#x65B0;&#x751F;&#x4EE3;&#x3001;&#x8001;&#x5E74;&#x4EE3;&#xFF09;&#x5212;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x5927;&#x5C0F;&#x56FA;&#x5B9A;&#x7684;&#x72EC;&#x7ACB;&#x533A;&#x57DF;&#xFF08;Region&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x8DDF;&#x8E2A;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x91CC;&#x9762;&#x7684;&#x5783;&#x573E;&#x5806;&#x79EF;&#x7A0B;&#x5EA6;&#xFF0C;&#x5728;&#x540E;&#x53F0;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x4F18;&#x5148;&#x5217;&#x8868;&#xFF0C;&#x6BCF;&#x6B21;&#x6839;&#x636E;&#x5141;&#x8BB8;&#x7684;&#x6536;&#x96C6;&#x65F6;&#x95F4;&#xFF0C;&#x4F18;&#x5148;&#x56DE;&#x6536;&#x5783;&#x573E;&#x6700;&#x591A;&#x7684;&#x533A;&#x57DF;&#xFF08;&#x8FD9;&#x5C31;&#x662F;Garbage First&#x540D;&#x79F0;&#x7684;&#x6765;&#x7531;&#xFF09;&#x3002;&#x533A;&#x57DF;&#x5212;&#x5206;&#x53CA;&#x6709;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x533A;&#x57DF;&#x56DE;&#x6536;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;G1&#x6536;&#x96C6;&#x5668;&#x5728;&#x6709;&#x9650;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6700;&#x9AD8;&#x7684;&#x6536;&#x96C6;&#x6548;&#x7387;&#x3002;</p>
<p>2.1 &#x6536;&#x96C6;&#x5668;&#x53C2;&#x6570;&#x603B;&#x7ED3;<br>1&#x3001; Serial&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x76F8;&#x5173;&#x7684;&#x53C2;&#x6570;</p>
<p>-XX:+UseSerialGC</p>
<p>&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x4F7F;&#x7528;&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;&#x3002;</p>
<p>-XX:SurvivorRatio</p>
<p>&#x8BBE;&#x7F6E;eden&#x533A;&#x5927;&#x5C0F;&#x548C;survivior&#x533A;&#x5927;&#x5C0F;&#x7684;&#x6BD4;&#x4F8B;&#x3002;</p>
<p>-XX:PretenureSizeThreshold</p>
<p>&#x8BBE;&#x7F6E;&#x5927;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x9608;&#x503C;&#x3002;&#x5F53;&#x5BF9;&#x8C61;&#x7684;&#x5927;&#x5C0F;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x503C;&#x65F6;&#xFF0C;&#x5C06;&#x76F4;&#x63A5;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x5206;&#x914D;&#x3002;</p>
<p>-XX:MaxTenureSizeThreshold</p>
<p>&#x8BBE;&#x7F6E;&#x5BF9;&#x8C61;&#x8FDB;&#x5165;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x5E74;&#x9F84;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x6BCF;&#x4E00;&#x6B21;Minor</p>
<p>2&#x3001; ParNew&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x76F8;&#x5173;&#x7684;&#x53C2;&#x6570;</p>
<p>-XX:+UseParNewGC</p>
<p>&#x5728;&#x65B0;&#x751F;&#x4EE3;&#x4F7F;&#x7528;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<p>-XX:+UseParallelGC</p>
<p>&#x65B0;&#x751F;&#x4EE3;&#x4F7F;&#x7528;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x6536;&#x96C6;&#x5668;</p>
<p>-XX:+UseParallelOldGC</p>
<p>&#x8001;&#x5E74;&#x4EE3;&#x4F7F;&#x7528;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x3002;</p>
<p>-XX:ParallelGCThreads</p>
<p>&#x8BBE;&#x7F6E;&#x7528;&#x4E8E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x548C;CPU&#x6570;&#x91CF;&#x76F8;&#x7B49;&#xFF0C;&#x4F46;&#x5728;CPU&#x6570;&#x91CF;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BBE;&#x7F6E;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x503C;&#x4E5F;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>-XX:MaxGCPauseMills</p>
<p>&#x8BBE;&#x7F6E;&#x6700;&#x5927;&#x5783;&#x573E;&#x6536;&#x96C6;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002;&#x5B83;&#x7684;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x4E8E;0&#x7684;&#x6B63;&#x6570;&#x3002;&#x6536;&#x96C6;&#x5668;&#x5728;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x4F1A;&#x8C03;&#x6574;java&#x5806;&#x5927;&#x5C0F;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x628A;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x63A7;&#x5236;&#x5728;MaxGCPauseMills&#x4EE5;&#x5185;&#x3002;</p>
<p>-XX:GCTimeRatio</p>
<p>&#x8BBE;&#x7F6E;&#x541E;&#x5410;&#x91CF;&#x5927;&#x5C0F;&#x3002;&#x5B83;&#x7684;&#x503C;&#x65F6;&#x4E00;&#x4E2A;0&#x5230;100&#x4E4B;&#x95F4;&#x7684;&#x6574;&#x6570;&#x3002;&#x5047;&#x8BBE;GCTimeRatio&#x7684;&#x503C;&#x4E3A;n&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x5C06;&#x82B1;&#x8D39;&#x4E0D;&#x8D85;&#x8FC7;1/(1+n)&#x7684;&#x65F6;&#x95F4;&#x7528;&#x4E8E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x3002;</p>
<p>-XX:+UseAdaptiveSizePolicy</p>
<p>&#x6253;&#x5F00;&#x81EA;&#x9002;&#x5E94;GC&#x7B56;&#x7565;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#x3001;eden&#x548C;survivior&#x7684;&#x6BD4;&#x4F8B;&#x3001;&#x664B;&#x5347;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x5E74;&#x9F84;&#x7B49;&#x53C2;&#x6570;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x8C03;&#x6574;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x5728;&#x5806;&#x5927;&#x5C0F;&#x3001;&#x541E;&#x5410;&#x91CF;&#x548C;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x4E4B;&#x95F4;&#x7684;&#x5E73;&#x8861;&#x70B9;&#x3002;</p>
<p>3&#x3001; CMS &#x6536;&#x96C6;&#x5668;&#x76F8;&#x5173;&#x7684;&#x53C2;&#x6570;</p>
<p>-XX:+UseConcMarkSweepGC</p>
<p>&#x65B0;&#x751F;&#x4EE3;&#x4F7F;&#x7528;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x4F7F;&#x7528;CMS+&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<p>-XX:ParallelCMSThreads</p>
<p>&#x8BBE;&#x5B9A;CMS&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x3002;</p>
<p>-XX:CMSInitiatingOccupancyFraction</p>
<p>&#x8BBE;&#x7F6E;CMS&#x6536;&#x96C6;&#x5668;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x88AB;&#x4F7F;&#x7528;&#x591A;&#x5C11;&#x540E;&#x89E6;&#x53D1;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;68%&#x3002;</p>
<p>-XX:+UseCMSCompactAtFullCollection</p>
<p>&#x8BBE;&#x7F6E;CMS&#x6536;&#x96C6;&#x5668;&#x5728;&#x5B8C;&#x6210;&#x5783;&#x573E;&#x6536;&#x96C6;&#x540E;&#x662F;&#x5426;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5185;&#x5B58;&#x788E;&#x7247;&#x6574;&#x7406;&#x3002;</p>
<p>-XX:CMSFullGCsBeforeCompaction</p>
<p>&#x8BBE;&#x5B9A;&#x8FDB;&#x884C;&#x591A;&#x5C11;&#x6B21;CMS&#x5783;&#x573E;&#x56DE;&#x6536;&#x540E;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5185;&#x5B58;&#x538B;&#x7F29;&#x3002;</p>
<p>-XX:+CMSClassUnloadingEnabled</p>
<p>&#x5141;&#x8BB8;&#x5BF9;&#x7C7B;&#x5143;&#x6570;&#x636E;&#x533A;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x3002;</p>
<p>-XX:CMSInitiatingPermOccupancyFraction</p>
<p>&#x5F53;&#x6C38;&#x4E45;&#x533A;&#x5360;&#x7528;&#x7387;&#x8FBE;&#x5230;&#x8FD9;&#x4E00;&#x767E;&#x5206;&#x6BD4;&#x65F6;&#xFF0C;&#x542F;&#x52A8;CMS&#x56DE;&#x6536;(&#x524D;&#x63D0;&#x662F;-XX:+CMSClassUnloadingEnabled&#x6FC0;&#x6D3B;&#x4E86;)&#x3002;</p>
<p>-XX:CMSInitiatingPermOccupancyOnly</p>
<p>&#x8868;&#x793A;&#x53EA;&#x5728;&#x5230;&#x8FBE;&#x9608;&#x503C;&#x7684;&#x65F6;&#x5019;&#x624D;&#x8FDB;&#x884C;CMS&#x56DE;&#x6536;&#x3002;</p>
<p>-XX:+CMSIncrementalMode</p>
<p>&#x4F7F;&#x7528;&#x589E;&#x91CF;&#x6A21;&#x5F0F;&#xFF0C;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x5355;CPU&#x3002;&#x589E;&#x91CF;&#x6A21;&#x5F0F;&#x5728;JDK8&#x4E2D;&#x6807;&#x8BB0;&#x4E3A;&#x5E9F;&#x5F03;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x5728;JDK9&#x4E2D;&#x5F7B;&#x5E95;&#x79FB;&#x9664;&#x3002;</p>
<p>4&#x3001; G1&#x6536;&#x96C6;&#x5668;&#x76F8;&#x5173;&#x7684;&#x53C2;&#x6570;</p>
<p>-XX:+UseG1GC</p>
<p>&#x4F7F;&#x7528;G1&#x56DE;&#x6536;&#x5668;&#x3002;</p>
<p>-XX:MaxGCPauseMillis</p>
<p>&#x8BBE;&#x7F6E;&#x6700;&#x5927;&#x5783;&#x573E;&#x6536;&#x96C6;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002;</p>
<p>-XX:GCPauseIntervalMillis</p>
<p>&#x8BBE;&#x7F6E;&#x505C;&#x987F;&#x95F4;&#x9694;&#x65F6;&#x95F4;&#x3002;</p>
<p>###3.&#x5806;&#x5185;&#x5B58;&#x6EA2;&#x51FA;<br>&#x3010;&#x60C5;&#x51B5;&#x4E00;&#x3011;&#xFF1A;<br>&#x3000;&#x3000;java.lang.OutOfMemoryError: Java heap space&#xFF1A;&#x8FD9;&#x79CD;&#x662F;java&#x5806;&#x5185;&#x5B58;&#x4E0D;&#x591F;&#xFF0C;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x771F;&#x4E0D;&#x591F;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;&#x6B7B;&#x5FAA;&#x73AF;&#xFF1B;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x662F;java&#x5806;&#x5185;&#x5B58;&#x4E0D;&#x591F;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x6574;JVM&#x4E0B;&#x9762;&#x7684;&#x914D;&#x7F6E;&#x6765;&#x89E3;&#x51B3;&#xFF1A;<br>&#x3000;&#x3000;&lt; jvm-arg&gt;-Xms3062m &lt; / jvm-arg&gt;<br>&#x3000;&#x3000;&lt; jvm-arg&gt;-Xmx3062m &lt; / jvm-arg&gt;<br>&#x3000;&#x3000;<br>&#x3010;&#x60C5;&#x51B5;&#x4E8C;&#x3011;<br>&#x3000;&#x3000;java.lang.OutOfMemoryError: GC overhead limit exceeded<br>&#x3000;&#x3000;&#x3010;&#x89E3;&#x91CA;&#x3011;&#xFF1A;JDK6&#x65B0;&#x589E;&#x9519;&#x8BEF;&#x7C7B;&#x578B;&#xFF0C;&#x5F53;GC&#x4E3A;&#x91CA;&#x653E;&#x5F88;&#x5C0F;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x65F6;&#x629B;&#x51FA;&#xFF1B;&#x4E00;&#x822C;&#x662F;&#x56E0;&#x4E3A;&#x5806;&#x592A;&#x5C0F;&#xFF0C;&#x5BFC;&#x81F4;&#x5F02;&#x5E38;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5185;&#x5B58;&#x3002;<br>&#x3000;&#x3000;&#x3010;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3011;&#xFF1A;<br>&#x3000;&#x3000;1&#x3001;&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x6709;&#x4F7F;&#x7528;&#x5927;&#x5185;&#x5B58;&#x7684;&#x4EE3;&#x7801;&#x6216;&#x6B7B;&#x5FAA;&#x73AF;&#xFF1B;<br>&#x3000;&#x3000;2&#x3001;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;JVM&#x914D;&#x7F6E;&#xFF0C;&#x6765;&#x9650;&#x5236;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#xFF1A;<br>&#x3000;&#x3000;&lt; jvm-arg&gt;-XX:-UseGCOverheadLimit&lt; /jvm-arg&gt;<br>&#x3000;&#x3000;<br>&#x3010;&#x60C5;&#x51B5;&#x4E09;&#x3011;&#xFF1A;<br>&#x3000;&#x3000;java.lang.OutOfMemoryError: PermGen space&#xFF1A;&#x8FD9;&#x79CD;&#x662F;P&#x533A;&#x5185;&#x5B58;&#x4E0D;&#x591F;&#xFF0C;&#x53EF;&#x901A;&#x8FC7;&#x8C03;&#x6574;JVM&#x7684;&#x914D;&#x7F6E;&#xFF1A;<br>&#x3000;&#x3000;&lt; jvm-arg&gt;-XX:MaxPermSize=128m&lt; /jvm-arg&gt;<br>&#x3000;&#x3000;&lt; jvm-arg&gt;-XXermSize=128m&lt; /jvm-arg&gt;<br>&#x3000;&#x3000;&#x3010;&#x6CE8;&#x3011;&#xFF1A;<br>&#x3000;&#x3000;JVM&#x7684;Perm&#x533A;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5B58;&#x653E;Class&#x548C;Meta&#x4FE1;&#x606F;&#x7684;,Class&#x5728;&#x88AB;Loader&#x65F6;&#x5C31;&#x4F1A;&#x88AB;&#x653E;&#x5230;PermGen space&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x6210;&#x4E3A;&#x5E74;&#x8001;&#x4EE3;&#xFF0C;GC&#x5728;&#x4E3B;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x4E0D;&#x4F1A;&#x5BF9;&#x5E74;&#x8001;&#x533A;&#x8FDB;&#x884C;&#x6E05;&#x7406;&#xFF0C;&#x9ED8;&#x8BA4;&#x662F;64M&#x5927;&#x5C0F;&#xFF0C;&#x5F53;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x52A0;&#x8F7D;&#x7684;&#x5BF9;&#x8C61;&#x6BD4;&#x8F83;&#x591A;&#x65F6;&#xFF0C;&#x8D85;&#x8FC7;64M&#x5C31;&#x4F1A;&#x62A5;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x52A0;&#x5927;&#x5185;&#x5B58;&#x5206;&#x914D;&#xFF0C;&#x4E00;&#x822C;128m&#x8DB3;&#x591F;&#x3002;<br>&#x3000;&#x3000;<br>&#x3010;&#x60C5;&#x51B5;&#x56DB;&#x3011;&#xFF1A;<br>&#x3000;&#x3000;java.lang.OutOfMemoryError: Direct buffer memory<br>&#x3000;&#x3000;&#x8C03;&#x6574;-XX:MaxDirectMemorySize= &#x53C2;&#x6570;&#xFF0C;&#x5982;&#x6DFB;&#x52A0;JVM&#x914D;&#x7F6E;&#xFF1A;<br>&#x3000;&#x3000;&lt; jvm-arg&gt;-XX:MaxDirectMemorySize=128m&lt; /jvm-arg&gt;<br>&#x3000;&#x3000;<br>&#x3010;&#x60C5;&#x51B5;&#x4E94;&#x3011;&#xFF1A;<br>&#x3000;&#x3000;java.lang.OutOfMemoryError: unable to create new native thread<br>&#x3000;&#x3000;&#x3010;&#x539F;&#x56E0;&#x3011;&#xFF1A;Stack&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#x4EE5;&#x521B;&#x5EFA;&#x989D;&#x5916;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x521B;&#x5EFA;&#x7684;&#x7EBF;&#x7A0B;&#x8FC7;&#x591A;&#xFF0C;&#x8981;&#x4E48;&#x662F;Stack&#x7A7A;&#x95F4;&#x786E;&#x5B9E;&#x5C0F;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x3010;&#x89E3;&#x51B3;&#x3011;&#xFF1A;&#x7531;&#x4E8E;JVM&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x603B;&#x7684;stack&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x6808;&#x7684;&#x5927;&#x5C0F;&#xFF1B;&#x800C;&#x7CFB;&#x7EDF;&#x7684;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x4E00;&#x5171;&#x662F;3G&#xFF0C;&#x9664;&#x4E86;Text/Data/BSS /MemoryMapping&#x51E0;&#x4E2A;&#x6BB5;&#x4E4B;&#x5916;&#xFF0C;Heap&#x548C;Stack&#x7A7A;&#x95F4;&#x7684;&#x603B;&#x91CF;&#x6709;&#x9650;&#xFF0C;&#x662F;&#x6B64;&#x6D88;&#x5F7C;&#x957F;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x9047;&#x5230;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E24;&#x4E2A;&#x9014;&#x5F84;&#x89E3;&#x51B3;&#xFF1A;<br>&#x3000;&#x3000;1.&#x901A;&#x8FC7; -Xss&#x542F;&#x52A8;&#x53C2;&#x6570;&#x51CF;&#x5C11;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x6808;&#x5927;&#x5C0F;&#xFF0C;&#x8FD9;&#x6837;&#x4FBF;&#x80FD;&#x5F00;&#x66F4;&#x591A;&#x7EBF;&#x7A0B;&#xFF08;&#x5F53;&#x7136;&#x4E0D;&#x80FD;&#x592A;&#x5C0F;&#xFF0C;&#x592A;&#x5C0F;&#x4F1A;&#x51FA;&#x73B0;StackOverflowError&#xFF09;&#xFF1B;<br>&#x3000;&#x3000;2.&#x901A;&#x8FC7;-Xms -Xmx &#x4E24;&#x53C2;&#x6570;&#x51CF;&#x5C11;Heap&#x5927;&#x5C0F;&#xFF0C;&#x5C06;&#x5185;&#x5B58;&#x8BA9;&#x7ED9;Stack&#xFF08;&#x524D;&#x63D0;&#x662F;&#x4FDD;&#x8BC1;Heap&#x7A7A;&#x95F4;&#x591F;&#x7528;&#xFF09;&#x3002;<br>&#x3000;&#x3000;<br>&#x3010;&#x60C5;&#x51B5;&#x516D;&#x3011;&#xFF1A;<br>&#x3000;&#x3000;java.lang.StackOverflowError<br>&#x3000;&#x3000;&#x3010;&#x539F;&#x56E0;&#x3011;&#xFF1A;&#x8FD9;&#x4E5F;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x9519;&#x8BEF;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x5373;&#x7EBF;&#x7A0B;&#x6808;&#x7684;&#x6EA2;&#x51FA;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x5C42;&#x6B21;&#x8FC7;&#x591A;&#xFF08;&#x6BD4;&#x5982;&#x5B58;&#x5728;&#x65E0;&#x9650;&#x9012;&#x5F52;&#x8C03;&#x7528;&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x6808;&#x592A;&#x5C0F;&#x3002;<br>&#x3000;&#x3000;&#x3010;&#x89E3;&#x51B3;&#x3011;&#xFF1A;&#x4F18;&#x5316;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#xFF0C;&#x51CF;&#x5C11;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x5C42;&#x6B21;&#xFF1B;&#x8C03;&#x6574;-Xss&#x53C2;&#x6570;&#x589E;&#x52A0;&#x7EBF;&#x7A0B;&#x6808;&#x5927;&#x5C0F;&#x3002;</p>
<p>###4.Java&#x4E2D;&#x7684;&#x51E0;&#x79CD;&#x5F15;&#x7528;&#x65B9;&#x5F0F;</p>
<p>Java&#x4E2D;&#x6709;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5F15;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x662F;&#xFF1A;&#x5F3A;&#x5F15;&#x7528;&#x3001;&#x8F6F;&#x5F15;&#x7528;&#x3001;&#x5F31;&#x5F15;&#x7528;&#x548C;&#x865A;&#x5F15;&#x7528;&#x3002;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8BE6;&#x7EC6;&#x5730;&#x4E86;&#x89E3;&#x4E0B;&#x8FD9;&#x51E0;&#x79CD;&#x5F15;&#x7528;&#x65B9;&#x5F0F;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x5F3A;&#x5F15;&#x7528;</p>
<p>&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x7684;&#x5185;&#x5BB9;&#x4E2D;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5F15;&#x7528; &#x90FD;&#x662F;&#x5F3A;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x662F;&#x4F7F;&#x7528;&#x6700;&#x666E;&#x904D;&#x7684;&#x5F15;&#x7528;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5177;&#x6709;&#x5F3A;&#x5F15;&#x7528;&#xFF0C;&#x90A3;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x751F;&#x6D3B;&#x7528;&#x54C1;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x7EDD;&#x4E0D;&#x4F1A;&#x56DE;&#x6536;&#x5B83;&#x3002;&#x5F53;&#x5185;&#x5B58;&#x7A7A; &#x95F4;&#x4E0D;&#x8DB3;&#xFF0C;Java &#x865A;&#x62DF;&#x673A;&#x5B81;&#x613F;&#x629B;&#x51FA; OutOfMemoryError &#x9519;&#x8BEF;&#xFF0C;&#x4F7F;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x9760;&#x968F;&#x610F;&#x56DE;&#x6536;&#x5177;&#x6709;&#x5F3A;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x89E3;&#x51B3;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8F6F;&#x5F15;&#x7528;&#xFF08;SoftReference &#xFF09;</p>
<p>SoftReference &#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7528;&#x9014;&#x5C31;&#x662F;&#x7528;&#x4E8E;&#x5185;&#x5B58;&#x654F;&#x611F;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x3002; SoftReference  &#x7684;&#x539F;&#x7406;&#x662F;&#xFF1A;&#x5728;&#x4FDD;&#x6301;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x65F6;&#x4FDD;&#x8BC1;&#x5728;  JVM  &#x62A5;&#x544A;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x60C5;&#x51B5;&#x4E4B;&#x524D;&#x5C06;&#x6E05;&#x9664;&#x6240;&#x6709;&#x7684;&#x8F6F;&#x5F15;&#x7528;&#x3002;&#x5173;&#x952E;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#xFF08;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#xFF09;&#x91CA;&#x653E;&#x8F6F;&#x53EF;&#x53CA;&#x5BF9;&#x8C61;&#x3002;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x88AB;&#x91CA;&#x653E;&#x53D6;&#x51B3;&#x4E8E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x7B97;&#x6CD5; &#x4EE5;&#x53CA;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x7528;&#x7684;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x5F31;&#x5F15;&#x7528;&#xFF08;WeakReference &#xFF09;</p>
<p>WeakReference &#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7528;&#x9014;&#x5C31;&#x662F;&#x89C4;&#x8303;&#x5316;&#x6620;&#x5C04;&#xFF08; canonicalized mapping &#xFF09;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x751F;&#x5B58;&#x671F;&#x76F8;&#x5BF9;&#x8F83;&#x957F;&#x800C;&#x4E14;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5F00;&#x9500;&#x4E5F;&#x4E0D;&#x9AD8;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x8BF4;&#xFF0C;&#x5F31;&#x5F15;&#x7528;&#x4E5F;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#x3002;&#x5173;&#x952E;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8FD0;&#x884C;&#x65F6;&#x5982;&#x679C;&#x78B0;&#x5230;&#x4E86;&#x5F31;&#x53EF;&#x53CA;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x91CA;&#x653E;  WeakReference  &#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x53EF;&#x80FD;&#x8981;&#x8FD0;&#x884C;&#x591A;&#x6B21;&#x624D;&#x80FD;&#x627E;&#x5230;&#x5E76;&#x91CA;&#x653E;&#x5F31;&#x53EF;&#x53CA;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x865A;&#x5F15;&#x7528;&#xFF08;PhantomReference &#xFF09;</p>
<p>PhantomReference &#x7C7B;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x8DDF;&#x8E2A;&#x5BF9;&#x88AB;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x5373;&#x5C06;&#x8FDB;&#x884C;&#x7684;&#x6536;&#x96C6;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5B83;&#x8FD8;&#x80FD;&#x7528;&#x4E8E;&#x6267;&#x884C;  pre-mortem  &#x6E05;&#x9664;&#x64CD;&#x4F5C;&#x3002; PhantomReference  &#x5FC5;&#x987B;&#x4E0E;  ReferenceQueue  &#x7C7B;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;&#x9700;&#x8981;  ReferenceQueue  &#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x80FD;&#x591F;&#x5145;&#x5F53;&#x901A;&#x77E5;&#x673A;&#x5236;&#x3002;&#x5F53;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x786E;&#x5B9A;&#x4E86;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x865A;&#x53EF;&#x53CA;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C; PhantomReference  &#x5BF9;&#x8C61;&#x5C31;&#x88AB;&#x653E;&#x5728;&#x5B83;&#x7684;  ReferenceQueue  &#x4E0A;&#x3002;&#x5C06;  PhantomReference  &#x5BF9;&#x8C61;&#x653E;&#x5728;  ReferenceQueue  &#x4E0A;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x901A;&#x77E5;&#xFF0C;&#x8868;&#x660E;  PhantomReference  &#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;&#xFF0C;&#x53EF;&#x4F9B;&#x6536;&#x96C6;&#x4E86;&#x3002;&#x8FD9;&#x4F7F;&#x60A8;&#x80FD;&#x591F;&#x521A;&#x597D;&#x5728;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x88AB;&#x56DE;&#x6536;&#x4E4B;&#x524D;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x3002; Reference&#x4E0E; ReferenceQueue &#x7684;&#x914D;&#x5408;&#x4F7F;&#x7528;&#x3002;</p>
<p>###5.IO<br> Java&#x4E2D;&#x7684;&#x6D41;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x5EA6;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;</p>
<pre><code>&#x6309;&#x6D41;&#x7684;&#x65B9;&#x5411;&#x5206;&#xFF1A;&#x8F93;&#x5165;&#x6D41;&#x548C;&#x8F93;&#x51FA;&#x6D41;&#x3002;

&#x6309;&#x5904;&#x7406;&#x6570;&#x636E;&#x5355;&#x4F4D;&#x5206;&#xFF1A;&#x5B57;&#x8282;&#x6D41;&#x548C;&#x5B57;&#x7B26;&#x6D41;&#x3002;

&#x6309;&#x5B9E;&#x73B0;&#x529F;&#x80FD;&#x5206;&#xFF1A;&#x8282;&#x70B9;&#x6D41;&#x548C;&#x5904;&#x7406;&#x6D41;&#x3002;
</code></pre><p> &#x5B57;&#x8282;&#x6D41;&#xFF1A;&#x4E00;&#x6B21;&#x8BFB;&#x5165;&#x6216;&#x8BFB;&#x51FA;&#x662F;8&#x4F4D;&#x4E8C;&#x8FDB;&#x5236;&#x3002;</p>
<p>   &#x5B57;&#x7B26;&#x6D41;&#xFF1A;&#x4E00;&#x6B21;&#x8BFB;&#x5165;&#x6216;&#x8BFB;&#x51FA;&#x662F;16&#x4F4D;&#x4E8C;&#x8FDB;&#x5236;&#x3002;</p>
<p>   &#x5B57;&#x8282;&#x6D41;&#x548C;&#x5B57;&#x7B26;&#x6D41;&#x7684;&#x539F;&#x7406;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x5904;&#x7406;&#x7684;&#x5355;&#x4F4D;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#x3002;&#x540E;&#x7F00;&#x662F;Stream&#x662F;&#x5B57;&#x8282;&#x6D41;&#xFF0C;&#x800C;&#x540E;&#x7F00;&#x662F;Reader&#xFF0C;Writer&#x662F;&#x5B57;&#x7B26;&#x6D41;&#x3002;</p>
<p>   &#x5B57;&#x8282;&#x6D41;&#xFF1A;&#x5904;&#x7406;&#x5B57;&#x8282;&#x6570;&#x636E;&#x7684;&#x6D41;&#x5BF9;&#x8C61;&#x3002;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x65E0;&#x8BBA;&#x662F;&#x56FE;&#x7247;&#x6216;&#x8005;dvd&#xFF0C;&#x6587;&#x5B57;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x5B58;&#x50A8;&#x7684;&#x3002;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x6700;&#x7EC8;&#x90FD;&#x662F;&#x4EE5;&#x4E00;&#x4E2A;8&#x4F4D;&#x4E3A;&#x6570;&#x636E;&#x5355;&#x5143;&#x8FDB;&#x884C;&#x4F53;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x6700;&#x5C0F;&#x6570;&#x636E;&#x5355;&#x5143;&#x5C31;&#x662F;&#x5B57;&#x8282;&#x3002;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5B57;&#x8282;&#x6D41;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x5B57;&#x8282;&#x6D41;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5B57;&#x7B26;&#x6570;&#x636E;&#x3002;</p>
<p>###6.&#x514B;&#x9686;<br>1.&#x6D45;&#x514B;&#x9686;&#xFF1A;&#x53EA;&#x590D;&#x5236;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x53EA;&#x590D;&#x5236;&#x4E86;&#x5F15;&#x7528;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x5E76;&#x6CA1;&#x6709;&#x590D;&#x5236;&#xFF0C;&#x5728;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#x4FEE;&#x6539;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x5F71;&#x54CD;&#x539F;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x3002;<br>2.&#x6DF1;&#x514B;&#x9686;&#xFF1A;&#x662F;&#x5728;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x4E2D;&#x4E5F;&#x5B9E;&#x73B0;&#x4E86;clone&#xFF0C;&#x662F;clone&#x7684;&#x5D4C;&#x5957;&#xFF0C;&#x590D;&#x5236;&#x540E;&#x7684;&#x5BF9;&#x8C61;&#x4E0E;&#x539F;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x5B8C;&#x5168;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x3002;<br>3.&#x4F7F;&#x7528;&#x5E8F;&#x5217;&#x5316;&#x4E5F;&#x80FD;&#x5B8C;&#x6210;&#x6DF1;&#x590D;&#x5236;&#x7684;&#x529F;&#x80FD;&#xFF1A;&#x5BF9;&#x8C61;&#x5E8F;&#x5217;&#x5316;&#x540E;&#x5199;&#x5165;&#x6D41;&#x4E2D;&#xFF0C;&#x6B64;&#x65F6;&#x4E5F;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x5F15;&#x7528;&#x4EC0;&#x4E48;&#x7684;&#x6982;&#x5FF5;&#x4E86;&#xFF0C;&#x518D;&#x4ECE;&#x6D41;&#x4E2D;&#x8BFB;&#x53D6;&#xFF0C;&#x751F;&#x6210;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x65B0;&#x5BF9;&#x8C61;&#x548C;&#x539F;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x4E5F;&#x662F;&#x5B8C;&#x5168;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#x7684;&#x3002;<br>4.&#x4F7F;&#x7528;clone&#x5B9E;&#x73B0;&#x7684;&#x6DF1;&#x514B;&#x9686;&#x5176;&#x5B9E;&#x662F;&#x6D45;&#x514B;&#x9686;&#x4E2D;&#x5D4C;&#x5957;&#x4E86;&#x6D45;&#x514B;&#x9686;&#xFF0C;&#x4E0E;toString&#x65B9;&#x6CD5;&#x7C7B;&#x4F3C;</p>
<p>###7.&#x5E76;&#x53D1;</p>
<p>####7.1ConcurrentHashMap&#x539F;&#x7406;&#x5206;&#x6790;<br><a href="http://" target="_blank" rel="external">http://www.importnew.com/22007.html</a></p>
<p>####7.2sychronized&#x548C;lock&#x7684;&#x533A;&#x522B;</p>
<ol class="ui list">
<li><p>lock&#x662F;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x800C;synchronized&#x662F;java&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;synchronized&#x662F;&#x5185;&#x7F6E;&#x7684;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#xFF1B;&#xFF08;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E0A;&#x7684;&#x533A;&#x522B;&#x5728;&#x300A;Java&#x865A;&#x62DF;&#x673A;&#x300B;&#x4E2D;&#x6709;&#x8BB2;&#x89E3;&#x5E95;&#x5C42;&#x7684;CAS&#x4E0D;&#x540C;&#xFF0C;&#x4EE5;&#x524D;&#x6709;&#x8BFB;&#x8FC7;&#x73B0;&#x5728;&#x53C8;&#x9057;&#x5FD8;&#x4E86;&#x3002;&#xFF09;</p>
</li>
<li><p>synchronized&#x5728;&#x53D1;&#x751F;&#x5F02;&#x5E38;&#x65F6;&#x5019;&#x4F1A;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x5360;&#x6709;&#x7684;&#x9501;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x6B7B;&#x9501;&#xFF1B;&#x800C;lock&#x53D1;&#x751F;&#x5F02;&#x5E38;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x4F1A;&#x4E3B;&#x52A8;&#x91CA;&#x653E;&#x5360;&#x6709;&#x7684;&#x9501;&#xFF0C;&#x5FC5;&#x987B;&#x624B;&#x52A8;unlock&#x6765;&#x91CA;&#x653E;&#x9501;&#xFF0C;&#x53EF;&#x80FD;&#x5F15;&#x8D77;&#x6B7B;&#x9501;&#x7684;&#x53D1;&#x751F;&#x3002;&#xFF08;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x5C06;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;&#x7528;try catch&#x5305;&#x8D77;&#x6765;&#xFF0C;finally&#x4E2D;&#x5199;&#x5165;unlock&#xFF0C;&#x907F;&#x514D;&#x6B7B;&#x9501;&#x7684;&#x53D1;&#x751F;&#x3002;&#xFF09;</p>
</li>
<li><p>lock&#x7B49;&#x5F85;&#x9501;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x7528;interrupt&#x6765;&#x7EC8;&#x7AEF;&#x7B49;&#x5F85;&#xFF0C;&#x800C;synchronized&#x53EA;&#x80FD;&#x7B49;&#x5F85;&#x9501;&#x7684;&#x91CA;&#x653E;&#xFF0C;&#x4E0D;&#x80FD;&#x54CD;&#x5E94;&#x4E2D;&#x65AD;&#xFF1B;</p>
</li>
<li><p>lock&#x53EF;&#x4EE5;&#x901A;&#x8FC7;trylock&#x6765;&#x77E5;&#x9053;&#x6709;&#x6CA1;&#x6709;&#x83B7;&#x53D6;&#x9501;&#xFF0C;&#x800C;synchronized&#x4E0D;&#x80FD;&#xFF1B;</p>
</li>
<li><p>Lock&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x8BFB;&#x64CD;&#x4F5C;&#x7684;&#x6548;&#x7387;&#x3002;&#xFF08;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;readwritelock&#x5B9E;&#x73B0;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#xFF09;</p>
</li>
</ol>
<p>####7.3&#x4E50;&#x89C2;&#x9501;&#x548C;&#x60B2;&#x89C2;&#x9501;</p>
<p>####7.4&#x6DF1;&#x5165;&#x5206;&#x6790;synchronized&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;<br><a href="http://" target="_blank" rel="external">https://blog.csdn.net/shandian000/article/details/54927876</a></p>
<p>###8.sql&#x4F18;&#x5316;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;<br>&#x5728;sql&#x67E5;&#x8BE2;&#x4E2D;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x4F1A;&#x91C7;&#x53D6;&#x4E00;&#x4E9B;&#x63AA;&#x65BD;&#x5BF9;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x8FDB;&#x884C;sql&#x4F18;&#x5316;&#xFF0C;&#x4E0B;&#x9762;&#x603B;&#x7ED3;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x6709;&#x9700;&#x8981;&#x7684;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x53C2;&#x8003;&#x3002;</p>
<p>1.&#x5BF9;&#x67E5;&#x8BE2;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x9996;&#x5148;&#x5E94;&#x8003;&#x8651;&#x5728; where &#x53CA; order by &#x6D89;&#x53CA;&#x7684;&#x5217;&#x4E0A;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x3002;    </p>
<p>2.&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C; null &#x503C;&#x5224;&#x65AD;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x5982;&#xFF1A;<br>select id from t where num is null<br>&#x53EF;&#x4EE5;&#x5728;num&#x4E0A;&#x8BBE;&#x7F6E;&#x9ED8;&#x8BA4;&#x503C;0&#xFF0C;&#x786E;&#x4FDD;&#x8868;&#x4E2D;num&#x5217;&#x6CA1;&#x6709;null&#x503C;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x6837;&#x67E5;&#x8BE2;&#xFF1A;<br>select id from t where num=0    </p>
<p>3.&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x4F7F;&#x7528;!=&#x6216;&lt;&gt;&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#x3002;    </p>
<p>4.&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x4F7F;&#x7528; or &#x6765;&#x8FDE;&#x63A5;&#x6761;&#x4EF6;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x5982;&#xFF1A;<br>select id from t where num=10 or num=20<br>&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x67E5;&#x8BE2;&#xFF1A;<br>select id from t where num=10<br>union all<br>select id from t where num=20    </p>
<p>5.in &#x548C; not in &#x4E5F;&#x8981;&#x614E;&#x7528;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x5BFC;&#x81F4;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF0C;&#x5982;&#xFF1A;<br>select id from t where num in(1,2,3)<br>&#x5BF9;&#x4E8E;&#x8FDE;&#x7EED;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x80FD;&#x7528; between &#x5C31;&#x4E0D;&#x8981;&#x7528; in &#x4E86;&#xFF1A;<br>select id from t where num between 1 and 3    </p>
<p>6.&#x4E0B;&#x9762;&#x7684;&#x67E5;&#x8BE2;&#x4E5F;&#x5C06;&#x5BFC;&#x81F4;&#x5168;&#x8868;&#x626B;&#x63CF;&#xFF1A;<br>select id from t where name like &#x2018;%abc%&#x2019;    </p>
<p>7.&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x8868;&#x8FBE;&#x5F0F;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#x3002;&#x5982;&#xFF1A;<br>select id from t where num/2=100<br>&#x5E94;&#x6539;&#x4E3A;:<br>select id from t where num=100*2    </p>
<p>8.&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5728;where&#x5B50;&#x53E5;&#x4E2D;&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x51FD;&#x6570;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x64CE;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x800C;&#x8FDB;&#x884C;&#x5168;&#x8868;&#x626B;&#x63CF;&#x3002;&#x5982;&#xFF1A;<br>select id from t where substring(name,1,3)=&#x2019;abc&#x2019;&#x2013;name&#x4EE5;abc&#x5F00;&#x5934;&#x7684;id<br>&#x5E94;&#x6539;&#x4E3A;:<br>select id from t where name like &#x2018;abc%&#x2019;    </p>
<p>9.&#x4E0D;&#x8981;&#x5728; where &#x5B50;&#x53E5;&#x4E2D;&#x7684;&#x201C;=&#x201D;&#x5DE6;&#x8FB9;&#x8FDB;&#x884C;&#x51FD;&#x6570;&#x3001;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x6216;&#x5176;&#x4ED6;&#x8868;&#x8FBE;&#x5F0F;&#x8FD0;&#x7B97;&#xFF0C;&#x5426;&#x5219;&#x7CFB;&#x7EDF;&#x5C06;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x3002;    </p>
<p>10.&#x5728;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x5B57;&#x6BB5;&#x4F5C;&#x4E3A;&#x6761;&#x4EF6;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x7D22;&#x5F15;&#x662F;&#x590D;&#x5408;&#x7D22;&#x5F15;&#xFF0C;&#x90A3;&#x4E48;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x5230;&#x8BE5;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x4F5C;&#x4E3A;&#x6761;&#x4EF6;&#x65F6;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x8BE5;&#x7D22;&#x5F15;&#xFF0C;<br>&#x5426;&#x5219;&#x8BE5;&#x7D22;&#x5F15;&#x5C06;&#x4E0D;&#x4F1A;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8BA9;&#x5B57;&#x6BB5;&#x987A;&#x5E8F;&#x4E0E;&#x7D22;&#x5F15;&#x987A;&#x5E8F;&#x76F8;&#x4E00;&#x81F4;&#x3002;    </p>
<p>11.&#x4E0D;&#x8981;&#x5199;&#x4E00;&#x4E9B;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x5982;&#x9700;&#x8981;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7A7A;&#x8868;&#x7ED3;&#x6784;&#xFF1A;<br>select col1,col2 into #t from t where 1=0<br>&#x8FD9;&#x7C7B;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x7ED3;&#x679C;&#x96C6;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x6D88;&#x8017;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#xFF0C;&#x5E94;&#x6539;&#x6210;&#x8FD9;&#x6837;&#xFF1A;<br>create table #t(&#x2026;)    </p>
<p>12.&#x5F88;&#x591A;&#x65F6;&#x5019;&#x7528; exists &#x4EE3;&#x66FF; in &#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF1A;<br>select num from a where num in(select num from b)<br>&#x7528;&#x4E0B;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x66FF;&#x6362;&#xFF1A;<br>select num from a where exists(select 1 from b where num=a.num)    </p>
<p>13.&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7D22;&#x5F15;&#x5BF9;&#x67E5;&#x8BE2;&#x90FD;&#x6709;&#x6548;&#xFF0C;SQL&#x662F;&#x6839;&#x636E;&#x8868;&#x4E2D;&#x6570;&#x636E;&#x6765;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x7684;&#xFF0C;&#x5F53;&#x7D22;&#x5F15;&#x5217;&#x6709;&#x5927;&#x91CF;&#x6570;&#x636E;&#x91CD;&#x590D;&#x65F6;&#xFF0C;SQL&#x67E5;&#x8BE2;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x53BB;&#x5229;&#x7528;&#x7D22;&#x5F15;&#xFF0C;<br>&#x5982;&#x4E00;&#x8868;&#x4E2D;&#x6709;&#x5B57;&#x6BB5;sex&#xFF0C;male&#x3001;female&#x51E0;&#x4E4E;&#x5404;&#x4E00;&#x534A;&#xFF0C;&#x90A3;&#x4E48;&#x5373;&#x4F7F;&#x5728;sex&#x4E0A;&#x5EFA;&#x4E86;&#x7D22;&#x5F15;&#x4E5F;&#x5BF9;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x8D77;&#x4E0D;&#x4E86;&#x4F5C;&#x7528;&#x3002;    </p>
<p>14.&#x7D22;&#x5F15;&#x5E76;&#x4E0D;&#x662F;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#xFF0C;&#x7D22;&#x5F15;&#x56FA;&#x7136;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x76F8;&#x5E94;&#x7684; select &#x7684;&#x6548;&#x7387;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x964D;&#x4F4E;&#x4E86; insert &#x53CA; update &#x7684;&#x6548;&#x7387;&#xFF0C;<br>&#x56E0;&#x4E3A; insert &#x6216; update &#x65F6;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x5EFA;&#x7D22;&#x5F15;&#xFF0C;&#x6240;&#x4EE5;&#x600E;&#x6837;&#x5EFA;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x614E;&#x91CD;&#x8003;&#x8651;&#xFF0C;&#x89C6;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x800C;&#x5B9A;&#x3002;<br>&#x4E00;&#x4E2A;&#x8868;&#x7684;&#x7D22;&#x5F15;&#x6570;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x8D85;&#x8FC7;6&#x4E2A;&#xFF0C;&#x82E5;&#x592A;&#x591A;&#x5219;&#x5E94;&#x8003;&#x8651;&#x4E00;&#x4E9B;&#x4E0D;&#x5E38;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x5217;&#x4E0A;&#x5EFA;&#x7684;&#x7D22;&#x5F15;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#x3002;    </p>
<p>15.&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#x578B;&#x5B57;&#x6BB5;&#xFF0C;&#x82E5;&#x53EA;&#x542B;&#x6570;&#x503C;&#x4FE1;&#x606F;&#x7684;&#x5B57;&#x6BB5;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x8BBE;&#x8BA1;&#x4E3A;&#x5B57;&#x7B26;&#x578B;&#xFF0C;&#x8FD9;&#x4F1A;&#x964D;&#x4F4E;&#x67E5;&#x8BE2;&#x548C;&#x8FDE;&#x63A5;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x5E76;&#x4F1A;&#x589E;&#x52A0;&#x5B58;&#x50A8;&#x5F00;&#x9500;&#x3002;<br>&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5F15;&#x64CE;&#x5728;&#x5904;&#x7406;&#x67E5;&#x8BE2;&#x548C;&#x8FDE;&#x63A5;&#x65F6;&#x4F1A;&#x9010;&#x4E2A;&#x6BD4;&#x8F83;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x6570;&#x5B57;&#x578B;&#x800C;&#x8A00;&#x53EA;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x4E00;&#x6B21;&#x5C31;&#x591F;&#x4E86;&#x3002;    </p>
<p>16.&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x4F7F;&#x7528; varchar &#x4EE3;&#x66FF; char &#xFF0C;&#x56E0;&#x4E3A;&#x9996;&#x5148;&#x53D8;&#x957F;&#x5B57;&#x6BB5;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;<br>&#x5176;&#x6B21;&#x5BF9;&#x4E8E;&#x67E5;&#x8BE2;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x7684;&#x5B57;&#x6BB5;&#x5185;&#x641C;&#x7D22;&#x6548;&#x7387;&#x663E;&#x7136;&#x8981;&#x9AD8;&#x4E9B;&#x3002;    </p>
<p>17.&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x90FD;&#x4E0D;&#x8981;&#x4F7F;&#x7528; select <em> from t &#xFF0C;&#x7528;&#x5177;&#x4F53;&#x7684;&#x5B57;&#x6BB5;&#x5217;&#x8868;&#x4EE3;&#x66FF;&#x201C;</em>&#x201D;&#xFF0C;&#x4E0D;&#x8981;&#x8FD4;&#x56DE;&#x7528;&#x4E0D;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x5B57;&#x6BB5;&#x3002;    </p>
<p>18.&#x907F;&#x514D;&#x9891;&#x7E41;&#x521B;&#x5EFA;&#x548C;&#x5220;&#x9664;&#x4E34;&#x65F6;&#x8868;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x7CFB;&#x7EDF;&#x8868;&#x8D44;&#x6E90;&#x7684;&#x6D88;&#x8017;&#x3002;</p>
<p>19.&#x4E34;&#x65F6;&#x8868;&#x5E76;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x4F7F;&#x7528;&#xFF0C;&#x9002;&#x5F53;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x67D0;&#x4E9B;&#x4F8B;&#x7A0B;&#x66F4;&#x6709;&#x6548;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x91CD;&#x590D;&#x5F15;&#x7528;&#x5927;&#x578B;&#x8868;&#x6216;&#x5E38;&#x7528;&#x8868;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x65F6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x6B21;&#x6027;&#x4E8B;&#x4EF6;&#xFF0C;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x5BFC;&#x51FA;&#x8868;&#x3002;    </p>
<p>20.&#x5728;&#x65B0;&#x5EFA;&#x4E34;&#x65F6;&#x8868;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x6B21;&#x6027;&#x63D2;&#x5165;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; select into &#x4EE3;&#x66FF; create table&#xFF0C;&#x907F;&#x514D;&#x9020;&#x6210;&#x5927;&#x91CF; log &#xFF0C;<br>&#x4EE5;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;&#xFF1B;&#x5982;&#x679C;&#x6570;&#x636E;&#x91CF;&#x4E0D;&#x5927;&#xFF0C;&#x4E3A;&#x4E86;&#x7F13;&#x548C;&#x7CFB;&#x7EDF;&#x8868;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5E94;&#x5148;create table&#xFF0C;&#x7136;&#x540E;insert&#x3002;</p>
<p>21.&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5230;&#x4E86;&#x4E34;&#x65F6;&#x8868;&#xFF0C;&#x5728;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x6700;&#x540E;&#x52A1;&#x5FC5;&#x5C06;&#x6240;&#x6709;&#x7684;&#x4E34;&#x65F6;&#x8868;&#x663E;&#x5F0F;&#x5220;&#x9664;&#xFF0C;&#x5148; truncate table &#xFF0C;&#x7136;&#x540E; drop table &#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7CFB;&#x7EDF;&#x8868;&#x7684;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x3002;    </p>
<p>22.&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x6E38;&#x6807;&#xFF0C;&#x56E0;&#x4E3A;&#x6E38;&#x6807;&#x7684;&#x6548;&#x7387;&#x8F83;&#x5DEE;&#xFF0C;&#x5982;&#x679C;&#x6E38;&#x6807;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x8D85;&#x8FC7;1&#x4E07;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x6539;&#x5199;&#x3002;    </p>
<p>23.&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x6E38;&#x6807;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x4E34;&#x65F6;&#x8868;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#xFF0C;&#x5E94;&#x5148;&#x5BFB;&#x627E;&#x57FA;&#x4E8E;&#x96C6;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x57FA;&#x4E8E;&#x96C6;&#x7684;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x66F4;&#x6709;&#x6548;&#x3002;</p>
<p>24.&#x4E0E;&#x4E34;&#x65F6;&#x8868;&#x4E00;&#x6837;&#xFF0C;&#x6E38;&#x6807;&#x5E76;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x4F7F;&#x7528;&#x3002;&#x5BF9;&#x5C0F;&#x578B;&#x6570;&#x636E;&#x96C6;&#x4F7F;&#x7528; FAST_FORWARD &#x6E38;&#x6807;&#x901A;&#x5E38;&#x8981;&#x4F18;&#x4E8E;&#x5176;&#x4ED6;&#x9010;&#x884C;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5FC5;&#x987B;&#x5F15;&#x7528;&#x51E0;&#x4E2A;&#x8868;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x65F6;&#x3002;<br>&#x5728;&#x7ED3;&#x679C;&#x96C6;&#x4E2D;&#x5305;&#x62EC;&#x201C;&#x5408;&#x8BA1;&#x201D;&#x7684;&#x4F8B;&#x7A0B;&#x901A;&#x5E38;&#x8981;&#x6BD4;&#x4F7F;&#x7528;&#x6E38;&#x6807;&#x6267;&#x884C;&#x7684;&#x901F;&#x5EA6;&#x5FEB;&#x3002;&#x5982;&#x679C;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x5141;&#x8BB8;&#xFF0C;&#x57FA;&#x4E8E;&#x6E38;&#x6807;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x57FA;&#x4E8E;&#x96C6;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x770B;&#x54EA;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x6548;&#x679C;&#x66F4;&#x597D;&#x3002;<br>25.&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5927;&#x4E8B;&#x52A1;&#x64CD;&#x4F5C;&#xFF0C;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x5E76;&#x53D1;&#x80FD;&#x529B;&#x3002;26.&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x8FD4;&#x56DE;&#x5927;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x82E5;&#x6570;&#x636E;&#x91CF;&#x8FC7;&#x5927;&#xFF0C;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x76F8;&#x5E94;&#x9700;&#x6C42;&#x662F;&#x5426;&#x5408;&#x7406;&#x3002; </p>
<p>###9.MySQL&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x2014;&#x2014;&#x7D22;&#x5F15;&#x8BE6;&#x89E3;&#x4E0E;&#x7D22;&#x5F15;&#x7684;&#x4F18;&#x5316;<br><a href="http://" target="_blank" rel="external">https://blog.csdn.net/zhangliangzi/article/details/51366345</a><br><a href="http://" target="_blank" rel="external">https://blog.csdn.net/why_2012_gogo/article/details/50989260</a></p>
<p>###10.Spring&#x5DE5;&#x4F5C;&#x539F;&#x7406;<br><a href="http://" target="_blank" rel="external">https://www.cnblogs.com/zhoudi/p/5820513.html</a></p>
<p>###11.Spring IOC&#x539F;&#x7406;<br><a href="http://" target="_blank" rel="external">https://www.cnblogs.com/ITtangtang/p/3978349.html</a></p>
<p>###12.springMVC &#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x548C;&#x673A;&#x5236;<br><a href="http://" target="_blank" rel="external">https://www.cnblogs.com/zbf1214/p/5265117.html</a></p>
<p>###13.Spring AOP&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;<br><a href="http://" target="_blank" rel="external">http://www.importnew.com/24305.html</a><br><a href="http://" target="_blank" rel="external">https://www.cnblogs.com/cyhzzu/p/6644981.html</a></p>
<p>###14.Mybatis&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x6DF1;&#x5165;&#x89E3;&#x6790;<br><a href="http://" target="_blank" rel="external">https://blog.csdn.net/xudan1010/article/details/53435018</a></p>
<p>###15.&#x5E38;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x603B;&#x7ED3;<br><a href="http://" target="_blank" rel="external">https://blog.csdn.net/wu_ming0821/article/details/51838078</a></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2018-04-01T01:45:25.000Z" itemprop="datePublished">2018-04-01</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a class="ui tiny button disabled"><i class="angle left icon"></i>Previous</a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2018/03/27/interview3/" class="ui tiny button">
                    
                    interview3
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2018 <a href="/">LEO CHEN</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a
                href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
