

<!DOCTYPE html>
<html lang="">
<head prefix="og: http://ogp.me/ns#">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="">
    <title>interview | YMR</title>

    <!-- Open Graph -->
    <meta name="description" content="###1.&amp;#x64CD;&amp;#x4F5C;&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E2D; heap &amp;#x548C; stack &amp;#x7684;&amp;#x533A;&amp;#x522B;&amp;#x5806;&amp;#x6808;&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#xFF1A;&amp;#x3000;&amp;#x3000;&amp;#x5806;&amp;#x6808;&amp;#x662F;&amp;#x4E24;&amp;#x79CD;&amp;#x657">
<meta property="og:type" content="article">
<meta property="og:title" content="interview">
<meta property="og:url" content="http://yoursite.com/2018/03/24/interview/index.html">
<meta property="og:site_name" content="YMR">
<meta property="og:description" content="###1.&amp;#x64CD;&amp;#x4F5C;&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E2D; heap &amp;#x548C; stack &amp;#x7684;&amp;#x533A;&amp;#x522B;&amp;#x5806;&amp;#x6808;&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#xFF1A;&amp;#x3000;&amp;#x3000;&amp;#x5806;&amp;#x6808;&amp;#x662F;&amp;#x4E24;&amp;#x79CD;&amp;#x657">
<meta property="og:updated_time" content="2018-03-26T10:27:24.420Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="interview">
<meta name="twitter:description" content="###1.&amp;#x64CD;&amp;#x4F5C;&amp;#x7CFB;&amp;#x7EDF;&amp;#x4E2D; heap &amp;#x548C; stack &amp;#x7684;&amp;#x533A;&amp;#x522B;&amp;#x5806;&amp;#x6808;&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#xFF1A;&amp;#x3000;&amp;#x3000;&amp;#x5806;&amp;#x6808;&amp;#x662F;&amp;#x4E24;&amp;#x79CD;&amp;#x657">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "LEO CHEN",
  "url": "http://yoursite.com"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>YMR</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">LEO CHEN</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-interview" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    interview
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>###1.&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D; heap &#x548C; stack &#x7684;&#x533A;&#x522B;<br>&#x5806;&#x6808;&#x7684;&#x6982;&#x5FF5;&#xFF1A;<br>&#x3000;&#x3000;&#x5806;&#x6808;&#x662F;&#x4E24;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5806;&#x6808;&#x90FD;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x9879;&#x6309;&#x5E8F;&#x6392;&#x5217;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x53EA;&#x80FD;&#x5728;&#x4E00;&#x7AEF;(&#x79F0;&#x4E3A;&#x6808;&#x9876;(top))&#x5BF9;&#x6570;&#x636E;&#x9879;&#x8FDB;&#x884C;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x3002;&#x5728;&#x5355;&#x7247;&#x673A;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x5806;&#x6808;&#x662F;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x5B58;&#x50A8;&#x533A;&#xFF0C;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x662F;&#x6682;&#x65F6;&#x5B58;&#x653E;&#x6570;&#x636E;&#x548C;&#x5730;&#x5740;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x6765;&#x4FDD;&#x62A4;&#x65AD;&#x70B9;&#x548C;&#x73B0;&#x573A;&#x3002;&#x8981;&#x70B9;&#xFF1A;&#x5806;&#xFF0C;&#x961F;&#x5217;&#x4F18;&#x5148;,&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF08;FIFO&#x2014;first in first out&#xFF09;&#x3002;&#x6808;&#xFF0C;&#x5148;&#x8FDB;&#x540E;&#x51FA;(FILO&#x2014;First-In/Last-Out)&#x3002;</p>
<p>&#x5806;&#x548C;&#x6808;&#x7684;&#x533A;&#x522B;&#xFF1A;<br>&#x4E00;&#x3001;&#x5806;&#x6808;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#x533A;&#x522B;&#xFF1A;<br>&#x3000;&#x3000;1&#x3001;&#x6808;&#xFF08;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF09;&#xFF1A;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x5206;&#x914D;&#x91CA;&#x653E; &#xFF0C;&#x5B58;&#x653E;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x503C;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x7B49;&#x3002;&#x5176;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#x7C7B;&#x4F3C;&#x4E8E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6808;&#xFF1B;<br>&#x3000;&#x3000;2&#x3001;&#x5806;&#xFF08;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF09;&#xFF1A; &#x4E00;&#x822C;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x5206;&#x914D;&#x91CA;&#x653E;&#xFF0C; &#x82E5;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x91CA;&#x653E;&#xFF0C;&#x7A0B;&#x5E8F;&#x7ED3;&#x675F;&#x65F6;&#x53EF;&#x80FD;&#x7531;OS&#x56DE;&#x6536;&#xFF0C;&#x5206;&#x914D;&#x65B9;&#x5F0F;&#x5012;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;&#x94FE;&#x8868;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x5806;&#x6808;&#x7F13;&#x5B58;&#x65B9;&#x5F0F;&#x533A;&#x522B;&#xFF1A;<br>&#x3000;&#x3000;1&#x3001;&#x6808;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x7EA7;&#x7F13;&#x5B58;&#xFF0C; &#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#x5904;&#x4E8E;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x8C03;&#x7528;&#x5B8C;&#x6BD5;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#xFF1B;<br>&#x3000;&#x3000;2&#x3001;&#x5806;&#x662F;&#x5B58;&#x653E;&#x5728;&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x751F;&#x547D;&#x5468;&#x671F;&#x7531;&#x865A;&#x62DF;&#x673A;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x6765;&#x51B3;&#x5B9A;&#xFF08;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x65E6;&#x6210;&#x4E3A;&#x5B64;&#x513F;&#x5BF9;&#x8C61;&#x5C31;&#x80FD;&#x88AB;&#x56DE;&#x6536;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x8C03;&#x7528;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x901F;&#x5EA6;&#x8981;&#x76F8;&#x5BF9;&#x6765;&#x5F97;&#x4F4E;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x4E09;&#x3001;&#x5806;&#x6808;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x533A;&#x522B;&#xFF1A;<br>&#x3000;&#x3000;&#x5806;&#xFF08;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF09;&#xFF1A;&#x5806;&#x53EF;&#x4EE5;&#x88AB;&#x770B;&#x6210;&#x662F;&#x4E00;&#x68F5;&#x6811;&#xFF0C;&#x5982;&#xFF1A;&#x5806;&#x6392;&#x5E8F;&#xFF1B;<br>&#x3000;&#x3000;&#x6808;&#xFF08;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF09;&#xFF1A;&#x4E00;&#x79CD;&#x5148;&#x8FDB;&#x540E;&#x51FA;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>Java&#x4E2D;&#x6808;&#x548C;&#x5806;&#x7684;&#x533A;&#x522B;&#xFF1A;<br>&#x3000;&#x3000;&#x6808;(stack)&#x4E0E;&#x5806;(heap)&#x90FD;&#x662F;Java&#x7528;&#x6765;&#x5728;Ram&#x4E2D;&#x5B58;&#x653E;&#x6570;&#x636E;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4E0E;C++&#x4E0D;&#x540C;&#xFF0C;Java&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#x6808;&#x548C;&#x5806;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5730;&#x8BBE;&#x7F6E;&#x6808;&#x6216;&#x5806;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x90FD;&#x5728;&#x51FD;&#x6570;&#x7684;&#x6808;&#x5185;&#x5B58;&#x4E2D;&#x5206;&#x914D;&#x3002;&#x5F53;&#x5728;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5757;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;Java&#x5C31;&#x5728;&#x6808;&#x4E2D;&#x4E3A;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5F53;&#x8D85;&#x8FC7;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x540E;&#xFF0C;Java&#x4F1A;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6389;&#x4E3A;&#x8BE5;&#x53D8;&#x91CF;&#x6240;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x8BE5;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x88AB;&#x53E6;&#x4F5C;&#x4ED6;&#x7528;&#x3002;<br>&#x3000;&#x3000;&#x5806;&#x5185;&#x5B58;&#x7528;&#x6765;&#x5B58;&#x653E;&#x7531;new&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;&#xFF0C;&#x5728;&#x5806;&#x4E2D;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x7531;Java&#x865A;&#x62DF;&#x673A;&#x7684;&#x81EA;&#x52A8;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6765;&#x7BA1;&#x7406;&#x3002;&#x5728;&#x5806;&#x4E2D;&#x4EA7;&#x751F;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x6216;&#x5BF9;&#x8C61;&#x540E;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x6808;&#x4E2D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x8BA9;&#x6808;&#x4E2D;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x53D6;&#x503C;&#x7B49;&#x4E8E;&#x6570;&#x7EC4;&#x6216;&#x5BF9;&#x8C61;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x9996;&#x5730;&#x5740;&#xFF0C;&#x6808;&#x4E2D;&#x7684;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x5C31;&#x6210;&#x4E86;&#x6570;&#x7EC4;&#x6216;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x3002;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x4E3A;&#x6570;&#x7EC4;&#x6216;&#x5BF9;&#x8C61;&#x8D77;&#x7684;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#xFF0C;&#x4EE5;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x6808;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x6765;&#x8BBF;&#x95EE;&#x5806;&#x4E2D;&#x7684;&#x6570;&#x7EC4;&#x6216;&#x5BF9;&#x8C61;&#x3002;<br>Java&#x4E2D;&#x53D8;&#x91CF;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5206;&#x914D;&#xFF1A;<br>&#x3000;&#x3000;1&#x3001;&#x7C7B;&#x53D8;&#x91CF;&#xFF08;static&#x4FEE;&#x9970;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#xFF1A;&#x5728;&#x7A0B;&#x5E8F;&#x52A0;&#x8F7D;&#x65F6;&#x7CFB;&#x7EDF;&#x5C31;&#x4E3A;&#x5B83;&#x5728;&#x5806;&#x4E2D;&#x5F00;&#x8F9F;&#x4E86;&#x5185;&#x5B58;&#xFF0C;&#x5806;&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x5B58;&#x653E;&#x4E8E;&#x6808;&#x4EE5;&#x4FBF;&#x4E8E;&#x9AD8;&#x901F;&#x8BBF;&#x95EE;&#x3002;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x2013;&#x4E00;&#x76F4;&#x6301;&#x7EED;&#x5230;&#x6574;&#x4E2A;&#x201D;&#x7CFB;&#x7EDF;&#x201D;&#x5173;&#x95ED;&#x3002;<br>&#x3000;&#x3000;2&#x3001;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF1A;&#x5F53;&#x4F60;&#x4F7F;&#x7528;java&#x5173;&#x952E;&#x5B57;new&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7CFB;&#x7EDF;&#x5728;&#x5806;&#x4E2D;&#x5F00;&#x8F9F;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#x7ED9;&#x53D8;&#x91CF;&#xFF08;&#x6BD4;&#x5982;&#x8BF4;&#x7C7B;&#x5B9E;&#x4F8B;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x96F6;&#x6563;&#x7684;&#x5806;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x6362;&#x7B97;&#x4E3A;&#x4E00;&#x957F;&#x4E32;&#x6570;&#x5B57;&#x4EE5;&#x8868;&#x5F81;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x5806;&#x4E2D;&#x7684;&#x201D;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#x201D;&#x3002; &#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x2013;&#x5F53;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x7684;&#x5F15;&#x7528;&#x4E22;&#x5931;&#x540E;&#xFF0C;&#x5C06;&#x88AB;GC&#xFF08;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#xFF09;&#x5217;&#x5165;&#x53EF;&#x56DE;&#x6536;&#x201C;&#x540D;&#x5355;&#x201D;&#x4E2D;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x9A6C;&#x4E0A;&#x5C31;&#x91CA;&#x653E;&#x5806;&#x4E2D;&#x5185;&#x5B58;&#x3002;<br>&#x3000;&#x3000;3&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF1A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x7531;&#x58F0;&#x660E;&#x5728;&#x67D0;&#x65B9;&#x6CD5;&#xFF0C;&#x6216;&#x67D0;&#x4EE3;&#x7801;&#x6BB5;&#x91CC;&#xFF08;&#x6BD4;&#x5982;for&#x5FAA;&#x73AF;&#xFF09;&#xFF0C;&#x6267;&#x884C;&#x5230;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x5728;&#x6808;&#x4E2D;&#x5F00;&#x8F9F;&#x5185;&#x5B58;&#xFF0C;&#x5F53;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E00;&#x4F46;&#x8131;&#x79BB;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5185;&#x5B58;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#x3002;</p>
<p>###2.&#x9762;&#x5411;&#x5207;&#x9762;&#x7F16;&#x7A0B;&#x7684;&#x4E24;&#x79CD;&#x5B9E;&#x73B0;<br>&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4E00;&#xFF0C;&#x5728;XML&#x4E2D;&#x58F0;&#x660E;&#x5207;&#x9762;<br>&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4E8C;&#xFF0C;&#x6CE8;&#x89E3;&#x5207;&#x9762;</p>
<p>###3.&#x4EC0;&#x4E48;&#x662F;&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#x6620;&#x5C04;ORM?</p>
<blockquote>
<ul class="ui list">
<li>&#x5173;&#x7CFB;&#x6620;&#x5C04;&#xFF08;Object Relational Mapping&#xFF0C;&#x7B80;&#x79F0;ORM&#xFF09;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E0E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x5728;&#x7684;&#x4E92;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x73B0;&#x8C61;&#x7684;&#x6280;&#x672F;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x8F6C;&#x6362;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x3002; &#x8FD9;&#x4E5F;&#x540C;&#x65F6;&#x6697;&#x793A;&#x7740;&#x989D;&#x5916;&#x7684;&#x6267;&#x884C;&#x5F00;&#x9500;&#xFF1B;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;ORM&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x4E2D;&#x95F4;&#x4EF6;&#x5B9E;&#x73B0;&#xFF0C;&#x5219;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x673A;&#x4F1A;&#x505A;&#x4F18;&#x5316;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x5728;&#x624B;&#x5199;&#x7684;&#x6301;&#x4E45;&#x5C42;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x3002; &#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x8F6C;&#x6362;&#x7684;&#x5143;&#x6570;&#x636E;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x548C;&#x7BA1;&#x7406;&#x3002;</li>
<li>&#x7528;&#x4E2D;&#x5373;&#x5728;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x548C;&#x4E1A;&#x52A1;&#x5B9E;&#x4F53;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x4F5C;&#x4E00;&#x4E2A;&#x6620;&#x5C04;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5177;&#x4F53;&#x7684;&#x64CD;&#x4F5C;&#x4E1A;&#x52A1;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x53BB;&#x548C;&#x590D;&#x6742;&#x7684;SQL&#x8BED;&#x53E5;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x53EA;&#x8981;&#x50CF;&#x5E73;&#x65F6;&#x64CD;&#x4F5C;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#x64CD;&#x4F5C;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</li>
<li>ORM&#x6846;&#x67B6;&#x5C31;&#x662F;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;ORM&#x6280;&#x672F;&#x7684;&#x7A0B;&#x5E8F;&#x3002;<br>&#x3000;&#x3000; &#x5E38;&#x89C1;&#x7684;ORM&#x6846;&#x67B6;&#x6709;&#xFF1A;Hibernate&#x3001;iBATIS&#x3001;TopLink&#x3001;Castor JDO&#x3001;Apache OJB&#x7B49;&#x3002;<br>&#x3000;&#x3000; Java&#x4E2D;ORM&#x7684;&#x539F;&#x7406;&#xFF1A; &#x5148;&#x8BF4;ORM&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x8981;&#x5B9E;&#x73B0;JavaBean&#x7684;&#x5C5E;&#x6027;&#x5230;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x5B57;&#x6BB5;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x4EFB;&#x4F55;ORM&#x6846;&#x67B6;&#x4E0D;&#x5916;&#x4E4E;&#x662F;&#x8BFB;&#x67D0;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x628A;JavaBean&#x7684;&#x5C5E; &#x6027;&#x548C;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x5B57;&#x6BB5;&#x81EA;&#x52A8;&#x5173;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x5F53;&#x4ECE;&#x6570;&#x636E;&#x5E93;Query&#x65F6;&#xFF0C;&#x81EA;&#x52A8;&#x628A;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x585E;&#x8FDB;JavaBean&#x7684;&#x5BF9;&#x5E94;&#x5C5E;&#x6027;&#x91CC;&#xFF0C;&#x5F53;&#x505A;INSERT&#x6216;UPDATE&#x65F6;&#xFF0C;&#x81EA;&#x52A8;&#x628A; JavaBean&#x7684;&#x5C5E;&#x6027;&#x503C;&#x7ED1;&#x5B9A;&#x5230;SQL&#x8BED;&#x53E5;&#x4E2D;&#x3002;</li>
</ul>
</blockquote>
<p>###4.Java&#x53CD;&#x5C04;&#x673A;&#x5236;&#x8BE6;&#x89E3;<br>Java&#x53CD;&#x5C04;&#x673A;&#x5236;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x90FD;&#x80FD;&#x591F;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x6240;&#x6709;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF1B;&#x5BF9;&#x4E8E;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90FD;&#x80FD;&#x591F;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x548C;&#x5C5E;&#x6027;&#xFF1B;&#x8FD9;&#x79CD;&#x52A8;&#x6001;&#x83B7;&#x53D6;&#x7684;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x52A8;&#x6001;&#x8C03;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x529F;&#x80FD;&#x79F0;&#x4E3A;Java&#x8BED;&#x8A00;&#x7684;&#x53CD;&#x5C04;&#x673A;&#x5236;&#x3002;</p>
<p>1&#x3001;&#x5173;&#x4E8E;Class</p>
<blockquote>
<ul class="ui list">
<li>Class&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x7C7B;&#x7684;&#x7C7B;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x63CF;&#x8FF0;&#x7C7B;&#x672C;&#x8EAB;&#xFF09;&#xFF0C;&#x5C01;&#x88C5;&#x4E86;&#x63CF;&#x8FF0;&#x65B9;&#x6CD5;&#x7684;Method&#xFF0C;&#x63CF;&#x8FF0;&#x5B57;&#x6BB5;&#x7684;Filed&#xFF0C;&#x63CF;&#x8FF0;&#x6784;&#x9020;&#x5668;&#x7684;Constructor&#x7B49;&#x5C5E;&#x6027;</li>
<li>&#x5BF9;&#x8C61;&#x7167;&#x955C;&#x5B50;&#x540E;&#xFF08;&#x53CD;&#x5C04;&#xFF09;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7684;&#x4FE1;&#x606F;&#xFF1A;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x6570;&#x636E;&#x6210;&#x5458;&#x540D;&#x3001;&#x65B9;&#x6CD5;&#x548C;&#x6784;&#x9020;&#x5668;&#x3001;&#x67D0;&#x4E2A;&#x7C7B;&#x5230;&#x5E95;&#x5B9E;&#x73B0;&#x4E86;&#x54EA;&#x4E9B;&#x63A5;&#x53E3;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x7C7B;&#x800C;&#x8A00;&#xFF0C;JRE &#x90FD;&#x4E3A;&#x5176;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x4E0D;&#x53D8;&#x7684; Class &#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x3002;<br>&#x4E00;&#x4E2A; Class &#x5BF9;&#x8C61;&#x5305;&#x542B;&#x4E86;&#x7279;&#x5B9A;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x6709;&#x5173;&#x4FE1;&#x606F;&#x3002;</li>
<li>Class &#x5BF9;&#x8C61;&#x53EA;&#x80FD;&#x7531;&#x7CFB;&#x7EDF;&#x5EFA;&#x7ACB;&#x5BF9;&#x8C61;</li>
<li>&#x4E00;&#x4E2A;&#x7C7B;&#x5728; JVM &#x4E2D;&#x53EA;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;Class&#x5B9E;&#x4F8B;</li>
</ul>
</blockquote>
<p>2&#x3001;&#x53CD;&#x5C04;&#x673A;&#x5236;&#x83B7;&#x53D6;&#x7C7B;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;</p>
<figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/** </span></span><br><span class="line"><span class="comment"> * &#x53CD;&#x5C04;&#x673A;&#x5236;&#x83B7;&#x53D6;&#x7C7B;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x6CD5; </span></span><br><span class="line"><span class="comment"> */</span>  </span><br><span class="line"><span class="meta">@Test</span>  </span><br><span class="line"><span class="function"><span class="keyword">public</span> <span class="keyword">void</span> <span class="title">testGetClass</span><span class="params">()</span> <span class="keyword">throws</span> ClassNotFoundException </span>{  </span><br><span class="line">    Class clazz = <span class="keyword">null</span>;  </span><br><span class="line">  </span><br><span class="line">    <span class="comment">//1 &#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x7C7B;&#x540D;.Class&#x7684;&#x65B9;&#x5F0F;&#x5F97;&#x5230;  </span></span><br><span class="line">    clazz = Person.class;  </span><br><span class="line">    System.out.println(<span class="string">&quot;&#x901A;&#x8FC7;&#x7C7B;&#x540D;: &quot;</span> + clazz);  </span><br><span class="line">  </span><br><span class="line">    <span class="comment">//2 &#x901A;&#x8FC7;&#x5BF9;&#x8C61;&#x7684;getClass()&#x65B9;&#x6CD5;&#x83B7;&#x53D6;,&#x8FD9;&#x4E2A;&#x4F7F;&#x7528;&#x7684;&#x5C11;&#xFF08;&#x4E00;&#x822C;&#x662F;&#x4F20;&#x7684;&#x662F;Object&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x65F6;&#x5019;&#x624D;&#x7528;&#xFF09;  </span></span><br><span class="line">    Object obj = <span class="keyword">new</span> Person();  </span><br><span class="line">    clazz = obj.getClass();  </span><br><span class="line">    System.out.println(<span class="string">&quot;&#x901A;&#x8FC7;getClass(): &quot;</span> + clazz);  </span><br><span class="line">  </span><br><span class="line">    <span class="comment">//3 &#x901A;&#x8FC7;&#x5168;&#x7C7B;&#x540D;&#x83B7;&#x53D6;&#xFF0C;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x629B;&#x51FA;ClassNotFoundException&#x5F02;&#x5E38;  </span></span><br><span class="line">    clazz = Class.forName(<span class="string">&quot;com.java.reflection.Person&quot;</span>);  </span><br><span class="line">    System.out.println(<span class="string">&quot;&#x901A;&#x8FC7;&#x5168;&#x7C7B;&#x540D;&#x83B7;&#x53D6;: &quot;</span> + clazz);  </span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>3&#x3001;&#x5229;&#x7528;newInstance&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF1A;&#x8C03;&#x7528;&#x7684;&#x7C7B;&#x5FC5;&#x987B;&#x6709;&#x65E0;&#x53C2;&#x7684;&#x6784;&#x9020;&#x5668;<br><figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/** </span></span><br><span class="line"><span class="comment"> * Class&#x7C7B;&#x7684;newInstance()&#x65B9;&#x6CD5;&#xFF0C;&#x521B;&#x5EFA;&#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002; </span></span><br><span class="line"><span class="comment"> */</span>  </span><br><span class="line"><span class="meta">@Test</span>  </span><br><span class="line"><span class="function"><span class="keyword">public</span> <span class="keyword">void</span> <span class="title">testNewInstance</span><span class="params">()</span>  </span></span><br><span class="line"><span class="function">        <span class="keyword">throws</span> ClassNotFoundException, IllegalAccessException, InstantiationException </span>{  </span><br><span class="line">  </span><br><span class="line">    Class clazz = Class.forName(<span class="string">&quot;com.java.reflection.Person&quot;</span>);  </span><br><span class="line">  </span><br><span class="line">    <span class="comment">//&#x4F7F;&#x7528;Class&#x7C7B;&#x7684;newInstance()&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;  </span></span><br><span class="line">    <span class="comment">//&#x5B9E;&#x9645;&#x8C03;&#x7528;&#x7684;&#x7C7B;&#x7684;&#x90A3;&#x4E2A; &#x65E0;&#x53C2;&#x6570;&#x7684;&#x6784;&#x9020;&#x5668;&#xFF08;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5199;&#x7684;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x5199;&#x4E00;&#x4E2A;&#x65E0;&#x53C2;&#x6570;&#x7684;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x5C31;&#x662F;&#x7ED9;&#x53CD;&#x5C04;&#x7528;&#x7684;&#xFF09;  </span></span><br><span class="line">    <span class="comment">//&#x4E00;&#x822C;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x82E5;&#x58F0;&#x660E;&#x4E86;&#x5E26;&#x53C2;&#x6570;&#x7684;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x4E5F;&#x8981;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x65E0;&#x53C2;&#x6570;&#x7684;&#x6784;&#x9020;&#x5668;  </span></span><br><span class="line">    Object obj = clazz.newInstance();  </span><br><span class="line">    System.out.println(obj);  </span><br><span class="line">}</span><br></pre></td></tr></table></figure></p>
<p>4&#x3001;ClassLoader&#x7C7B;&#x52A0;&#x8F7D;&#x5668;<br>&#x5728;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#xFF0C;java&#x865A;&#x62DF;&#x673A;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x4EE5;&#x4E0B;3&#x4EF6;&#x4E8B;&#xFF1A;<br>a.&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5168;&#x9650;&#x5B9A;&#x540D;&#x6765;&#x83B7;&#x53D6;&#x5B9A;&#x4E49;&#x6B64;&#x7C7B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x8282;&#x6D41;&#x3002;<br>b.&#x5C06;&#x5B9A;&#x4E49;&#x7C7B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x8282;&#x6D41;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x9759;&#x6001;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x8F6C;&#x6362;&#x4E3A;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;<br>c.&#x5728;java&#x5806;&#x4E2D;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x8BE5;&#x7C7B;&#x7684;java.lang.Class&#x5BF9;&#x8C61;&#xFF0C;&#x4F5C;&#x4E3A;&#x65B9;&#x6CD5;&#x533A;&#x6570;&#x636E;&#x7684;&#x8BBF;&#x95EE;&#x5165;&#x53E3;&#x3002;</p>
<p>&#x865A;&#x62DF;&#x673A;&#x8BBE;&#x8BA1;&#x56E2;&#x961F;&#x628A;&#x7C7B;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#x4E2D;&#x7684;&#x201C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5168;&#x9650;&#x5B9A;&#x540D;&#x6765;&#x83B7;&#x53D6;&#x63CF;&#x8FF0;&#x6B64;&#x7C7B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x8282;&#x6D41;&#x201D;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x653E;&#x5230;Java&#x865A;&#x62DF;&#x673A;&#x5916;&#x90E8;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#x5982;&#x4F55;&#x53BB;&#x83B7;&#x53D6;&#x6240;&#x9700;&#x8981;&#x7684;&#x7C7B;&#xFF0C;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x201D;</p>
<p>4.1&#x3001;&#x7C7B;&#x4E0E;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;<br>&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x4F5C;&#x7528;&#xFF1A;&#x9996;&#x5148;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6700;&#x672C;&#x8D28;&#x7684;&#x529F;&#x80FD;&#x5373;&#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x52A8;&#x4F5C;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5B83;&#x8FD8;&#x80FD;&#x591F;&#x7ED3;&#x5408;java&#x7C7B;&#x672C;&#x8EAB;&#x6765;&#x786E;&#x5B9A;&#x8BE5;&#x7C7B;&#x5728;Java&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x7684;&#x552F;&#x4E00;&#x6027;&#x3002;&#x7528;&#x901A;&#x4FD7;&#x7684;&#x8BDD;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#xFF1A;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A;&#x7C7B;&#x662F;&#x5426;&#x76F8;&#x7B49;&#xFF0C;&#x53EA;&#x6709;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x662F;&#x7531;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x662F;&#x6765;&#x6E90;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;Class&#x6587;&#x4EF6;&#xFF0C;&#x53EA;&#x8981;&#x52A0;&#x8F7D;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x5FC5;&#x5B9A;&#x4E0D;&#x76F8;&#x7B49;&#x3002;</p>
<p>4.2&#x3001;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;<br>&#x865A;&#x62DF;&#x673A;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x5B58;&#x5728;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF1A;<br>&#x2460;.&#x4E00;&#x79CD;&#x662F;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08;Bootstrap ClassLoader&#xFF09;&#xFF0C;&#x8BE5;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4F7F;&#x7528;C++&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#xFF0C;&#x5C5E;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x81EA;&#x8EAB;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;<br>&#x2461;.&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x5C31;&#x662F;&#x6240;&#x6709;&#x5176;&#x5B83;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x662F;&#x7531;Java&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#xFF0C;&#x72EC;&#x7ACB;&#x4E8E;JVM&#x5916;&#x90E8;&#xFF0C;&#x5E76;&#x4E14;&#x5168;&#x90E8;&#x7EE7;&#x627F;&#x81EA;&#x62BD;&#x8C61;&#x7C7B;java.lang.ClassLoader&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E3B;&#x8981;&#x6709;&#x4E0B;&#x9762;3&#x4E2A;&#xFF1A;<br>1).&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08;Bootstarp ClassLoader&#xFF09;<br>&#x8FD9;&#x4E2A;ClassLoader&#x7531;JVM&#x81EA;&#x5DF1;&#x63A7;&#x5236;&#x3002;&#x4E3B;&#x8981;&#x52A0;&#x8F7D;JVM&#x81EA;&#x8EAB;&#x5DE5;&#x4F5C;&#x9700;&#x8981;&#x7684;&#x7C7B;&#xFF1A;&#x5C06;%JAVA_HOME%\lib&#x8DEF;&#x5F84;&#x4E0B;&#x6216;-Xbootclasspath&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x8DEF;&#x5F84;&#x4E0B;&#x7684;&#x3001;&#x80FD;&#x88AB;&#x865A;&#x62DF;&#x673A;&#x8BC6;&#x522B;&#x7684;&#x7C7B;&#x5E93;&#xFF08;&#x4EC5;&#x6309;&#x7167;&#x6587;&#x4EF6;&#x540D;&#x8BC6;&#x522B;&#xFF0C;&#x5982;&#xFF1A;rt.jar&#xFF0C;&#x540D;&#x5B57;&#x4E0D;&#x7B26;&#x5408;&#x7684;&#x7C7B;&#x5E93;&#x4E0D;&#x4F1A;&#x88AB;&#x52A0;&#x8F7D;&#xFF09;&#x52A0;&#x8F7D;&#x81F3;&#x865A;&#x62DF;&#x673A;&#x5185;&#x5B58;&#x4E2D;<br>&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x65E0;&#x6CD5;&#x88AB;Java&#x7A0B;&#x5E8F;&#x76F4;&#x63A5;&#x5F15;&#x7528;</p>
<p>2).&#x6269;&#x5C55;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08;Extension ClassLoader&#xFF09;<br>&#x8BE5;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7531;sun.misc.Launcher&#x7C7B;&#x7684;&#x9759;&#x6001;&#x5185;&#x90E8;&#x7C7B;ExtClassLoader&#x5B9E;&#x73B0;&#x3002;<br>&#x8D1F;&#x8D23;&#x52A0;&#x8F7D;java.ext.dirs&#x53C2;&#x6570;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#x662F;%JAVA_HOME%\jre\lib\ext&#xFF0C;&#x53EF;&#x7531;VM&#x53C2;&#x6570;-Djava.ext.dirs&#x6307;&#x5B9A;&#xFF09;&#x6307;&#x5B9A;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7C7B;&#x5E93;,&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x6269;&#x5C55;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;</p>
<p>3).&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08;Application ClassLoader&#xFF09;<br>&#x8BE5;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7531;sun.misc.Launcher$AppClassLoader&#x5B9E;&#x73B0;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x662F;ClassLoader&#x4E2D;&#x7684;getSystemClassLoader()&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x7CFB;&#x7EDF;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;<br>&#x8D1F;&#x8D23;&#x52A0;&#x8F7D;&#x7528;&#x6237;&#x7C7B;&#x8DEF;&#x5F84;&#xFF08;Classpath&#xFF09;&#x4E0A;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x7C7B;&#x5E93;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x8BE5;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x6CA1;&#x6709;&#x81EA;&#x5B9A;&#x4E49;&#x8FC7;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x9ED8;&#x8BA4;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;<br>&#x6CE8;&#x610F;&#xFF1A;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;JDK&#x63D0;&#x4F9B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x867D;&#x7136;&#x662F;&#x7236;&#x5B50;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x4E86;&#x7EC4;&#x5408;&#x5173;&#x7CFB;&#x3002;</p>
<p>4).&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;<br>&#x9664;&#x4E86;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E4B;&#x5916;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EE7;&#x627F;java.lang.ClassLoader&#x7C7B;&#x5E76;&#x91CD;&#x5199;&#x8BE5;&#x7C7B;&#x7684;findClass&#x65B9;&#x6CD5;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;</p>
<p>  &#x4ECE;JDK1.2&#x5F00;&#x59CB;&#xFF0C;java&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x63A8;&#x8350;&#x5F00;&#x53D1;&#x8005;&#x4F7F;&#x7528;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x5F0F;(ParentsDelegation Model)&#x8FDB;&#x884C;&#x7C7B;&#x52A0;&#x8F7D;&#xFF0C;&#x5176;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;<br>1).&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x6536;&#x5230;&#x4E86;&#x7C7B;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x4E0D;&#x4F1A;&#x81EA;&#x5DF1;&#x53BB;&#x5C1D;&#x8BD5;&#x52A0;&#x8F7D;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x7C7B;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#x59D4;&#x6D3E;&#x7ED9;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53BB;&#x5B8C;&#x6210;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#x7684;&#x52A0;&#x8F7D;&#x5668;&#x90FD;&#x662F;&#x5982;&#x6B64;</p>
<p>2).&#x56E0;&#x6B64;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#x90FD;&#x4F1A;&#x4F20;&#x7ED9;&#x9876;&#x5C42;&#x7684;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x7236;&#x52A0;&#x8F7D;&#x5668;&#x53CD;&#x9988;&#x81EA;&#x5DF1;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x8BE5;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#xFF08;&#x8BE5;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x641C;&#x7D22;&#x8303;&#x56F4;&#x4E2D;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#xFF09;&#x65F6;&#xFF0C;&#x5B50;&#x52A0;&#x8F7D;&#x5668;&#x624D;&#x4F1A;&#x5C1D;&#x8BD5;&#x81EA;&#x5DF1;&#x53BB;&#x52A0;&#x8F7D;&#x3002;</p>
<p>3).&#x5982;&#x679C;&#x8FDE;&#x6700;&#x521D;&#x53D1;&#x8D77;&#x7C7B;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E5F;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5C06;&#x4F1A;&#x629B;&#x51FA;ClassNotFoundException&#xFF0C;&#x800C;&#x4E0D;&#x518D;&#x8C03;&#x7528;&#x5176;&#x5B50;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53BB;&#x8FDB;&#x884C;&#x7C7B;&#x52A0;&#x8F7D;&#x3002;</p>
<p>&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x5F0F;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#x7684;&#x4F18;&#x70B9;&#x662F;java&#x7C7B;&#x5B83;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E00;&#x8D77;&#x5177;&#x5907;&#x4E86;&#x4E00;&#x79CD;&#x5E26;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x5C42;&#x6B21;&#x5173;&#x7CFB;&#xFF0C;&#x8D8A;&#x662F;&#x57FA;&#x7840;&#x7684;&#x7C7B;&#xFF0C;&#x8D8A;&#x662F;&#x88AB;&#x4E0A;&#x5C42;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x8FDB;&#x884C;&#x52A0;&#x8F7D;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;java&#x7A0B;&#x5E8F;&#x7684;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x4F8B;&#x5982;java.lang.Object&#x7C7B;&#xFF0C;&#x65E0;&#x8BBA;&#x54EA;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53BB;&#x52A0;&#x8F7D;&#x8BE5;&#x7C7B;&#xFF0C;&#x6700;&#x7EC8;&#x90FD;&#x662F;&#x7531;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x8FDB;&#x884C;&#x52A0;&#x8F7D;&#xFF0C;&#x56E0;&#x6B64;Object&#x7C7B;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x5404;&#x79CD;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x73AF;&#x5883;&#x4E2D;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;&#x5426;&#x5219;&#x7684;&#x8BDD;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4F7F;&#x7528;&#x8BE5;&#x6A21;&#x578B;&#x7684;&#x8BDD;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;java.lang.Object&#x7C7B;&#x4E14;&#x5B58;&#x653E;&#x5728;classpath&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x4E2D;&#x5C06;&#x4F1A;&#x51FA;&#x73B0;&#x591A;&#x4E2A;Object&#x7C7B;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E5F;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x6DF7;&#x4E71;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x81EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;rt.jar&#x4E2D;&#x5DF2;&#x6709;&#x7C7B;&#x7684;&#x540C;&#x540D;Java&#x7C7B;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;JVM&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x7F16;&#x8BD1;&#xFF0C;&#x4F46;&#x8BE5;&#x7C7B;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x88AB;&#x52A0;&#x8F7D;&#x8FD0;&#x884C;&#x3002;</p>
<p>5&#x3001;Method: &#x5BF9;&#x5E94;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;<br><figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">public</span> <span class="keyword">void</span> <span class="title">testMethod</span><span class="params">()</span> <span class="keyword">throws</span> ClassNotFoundException, NoSuchMethodException,   </span></span><br><span class="line"><span class="function">        IllegalAccessException, InstantiationException, InvocationTargetException </span>{  </span><br><span class="line">    Class clazz = Class.forName(<span class="string">&quot;com.java.reflection.Person&quot;</span>);  </span><br><span class="line">  </span><br><span class="line">    <span class="comment">//1&#x3001;&#x5F97;&#x5230;clazz &#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#x4E2D;&#x6709;&#x54EA;&#x4E9B;&#x65B9;&#x6CD5;,&#x4E0D;&#x80FD;&#x83B7;&#x53D6;private&#x65B9;&#x6CD5;  </span></span><br><span class="line">    Method[] methods =clazz.getMethods();  </span><br><span class="line">    System.out.print(<span class="string">&quot;        getMethods: &quot;</span>);  </span><br><span class="line">    <span class="keyword">for</span> (Method method : methods){  </span><br><span class="line">        System.out.print(method.getName() + <span class="string">&quot;, &quot;</span>);  </span><br><span class="line">    }  </span><br><span class="line">  </span><br><span class="line">    <span class="comment">//2&#x3001;&#x83B7;&#x53D6;&#x6240;&#x6709;&#x7684;&#x65B9;&#x6CD5;(&#x4E14;&#x53EA;&#x83B7;&#x53D6;&#x5F53;&#x7740;&#x7C7B;&#x58F0;&#x660E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5305;&#x62EC;private&#x65B9;&#x6CD5;&#xFF09;  </span></span><br><span class="line">    Method[] methods2 = clazz.getDeclaredMethods();  </span><br><span class="line">    System.out.print(<span class="string">&quot;\ngetDeclaredMethods: &quot;</span>);  </span><br><span class="line">    <span class="keyword">for</span> (Method method : methods2){  </span><br><span class="line">        System.out.print(method.getName() + <span class="string">&quot;, &quot;</span>);  </span><br><span class="line">    }  </span><br><span class="line">  </span><br><span class="line">    <span class="comment">//3&#x3001;&#x83B7;&#x53D6;&#x6307;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;  </span></span><br><span class="line">    Method method = clazz.getDeclaredMethod(<span class="string">&quot;setName&quot;</span>,String.class);<span class="comment">//&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x662F;&#x65B9;&#x6CD5;&#x91CC;&#x7684;&#x53C2;&#x6570;  </span></span><br><span class="line">    System.out.println(<span class="string">&quot;\nmethod : &quot;</span> + method);  </span><br><span class="line">  </span><br><span class="line">    Method method2 = clazz.getDeclaredMethod(<span class="string">&quot;setName&quot;</span>,String.class ,<span class="keyword">int</span>.class);<span class="comment">//&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x65B9;&#x6CD5;&#x540D;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x662F;&#x65B9;&#x6CD5;&#x91CC;&#x7684;&#x53C2;&#x6570;  </span></span><br><span class="line">    System.out.println(<span class="string">&quot;method2: &quot;</span> + method2);  </span><br><span class="line">  </span><br><span class="line">    <span class="comment">//4&#x3001;&#x6267;&#x884C;&#x65B9;&#x6CD5;&#xFF01;  </span></span><br><span class="line">    Object obj = clazz.newInstance();  </span><br><span class="line">    method2.invoke(obj, <span class="string">&quot;changwen&quot;</span>, <span class="number">22</span>);  </span><br><span class="line">}</span><br></pre></td></tr></table></figure></p>
<p>6&#x3001;invoke&#x65B9;&#x6CD5;</p>
<p>7&#x3001;Field&#x5B57;&#x6BB5;</p>
<p>8&#x3001;&#x6784;&#x9020;&#x5668;(Constructor)</p>
<p>9&#x3001;&#x6CE8;&#x89E3;(Annotation)</p>
<p>###5.&#x4EC0;&#x4E48;&#x662F; ACID<br>1)&#x539F;&#x5B50;&#x6027;(Atomic)&#xFF1A;&#x4E8B;&#x52A1;&#x4E2D;&#x5404;&#x9879;&#x64CD;&#x4F5C;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x505A;&#x8981;&#x4E48;&#x5168;&#x4E0D;&#x505A;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x9879;&#x64CD;&#x4F5C;&#x7684;&#x5931;&#x8D25;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x5931;&#x8D25;&#xFF1B;</p>
<p>2)&#x4E00;&#x81F4;&#x6027;(Consistent)&#xFF1A;&#x4E00;&#x81F4;&#x6027;&#x662F;&#x6307;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x4F7F;&#x6570;&#x636E;&#x5E93;&#x4ECE;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x6027;&#x72B6;&#x6001;&#x53D8;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x6027;&#x72B6;&#x6001;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x548C;&#x6267;&#x884C;&#x4E4B;&#x540E;&#x90FD;&#x5FC5;&#x987B;&#x5904;&#x4E8E;&#x4E00;&#x81F4;&#x6027;&#x72B6;&#x6001;&#x3002;&#xFF1B;</p>
<p>3)&#x9694;&#x79BB;&#x6027;(Isolated)&#xFF1A;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x5F7C;&#x6B64;&#x65E0;&#x6CD5;&#x770B;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#xFF1B;</p>
<p>4)&#x6301;&#x4E45;&#x6027;(Durable)&#xFF1A;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x540E;&#x6240;&#x505A;&#x7684;&#x6539;&#x52A8;&#x90FD;&#x4F1A;&#x88AB;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x5373;&#x4F7F;&#x53D1;&#x751F;&#x707E;&#x96BE;&#x6027;&#x7684;&#x5931;&#x8D25;&#x3002;&#x901A;&#x8FC7;&#x65E5;&#x5FD7;&#x548C;&#x540C;&#x6B65;&#x5907;&#x4EFD;&#x53EF;&#x4EE5;&#x5728;&#x6545;&#x969C;&#x53D1;&#x751F;&#x540E;&#x91CD;&#x5EFA;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5F53;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5B58;&#x5728;5&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x5305;&#x62EC;3&#x7C7B;&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x95EE;&#x9898;&#xFF08;&#x810F;&#x8BFB;&#x3001;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x548C;&#x5E7B;&#x8BFB;&#xFF09;&#x548C;2&#x7C7B;&#x6570;&#x636E;&#x66F4;&#x65B0;&#x95EE;&#x9898;&#xFF08;&#x7B2C;1&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x548C;&#x7B2C;2&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF09;&#x3002;</p>
<blockquote>
<ul class="ui list">
<li><p>&#x810F;&#x8BFB;&#xFF08;Dirty Read&#xFF09;&#xFF1A;&#x810F;&#x8BFB;&#x662F;&#x6307;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x91CC;&#x8BFB;&#x53D6;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;</p>
</li>
<li><p>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF08;Unrepeatable Read&#xFF09;&#xFF1A;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x662F;&#x6307;&#x5728;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8303;&#x56F4;&#x5185;&#x591A;&#x6B21;&#x67E5;&#x8BE2;&#x5374;&#x8FD4;&#x56DE;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x503C;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x5728;&#x67E5;&#x8BE2;&#x95F4;&#x9694;&#xFF0C;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x5E76;&#x63D0;&#x4EA4;&#x4E86;&#x3002;<br>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x548C;&#x810F;&#x8BFB;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF0C;&#x810F;&#x8BFB;&#x662F;&#x67D0;&#x4E00;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x810F;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x5219;&#x662F;&#x8BFB;&#x53D6;&#x4E86;&#x524D;&#x4E00;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x3002;</p>
</li>
<li><p>&#x5E7B;&#x8BFB;&#xFF08;Phantom Read&#xFF09;&#xFF1A;&#x4E8B;&#x52A1;A&#x91CD;&#x65B0;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x7CFB;&#x5217;&#x7B26;&#x5408;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x7684;&#x884C;&#xFF0C;&#x53D1;&#x73B0;&#x5176;&#x4E2D;&#x63D2;&#x5165;&#x4E86;&#x88AB;&#x4E8B;&#x52A1;B&#x63D0;&#x4EA4;&#x7684;&#x884C;&#x3002;<br>&#x5E7B;&#x8BFB;&#x548C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x90FD;&#x662F;&#x8BFB;&#x53D6;&#x4E86;&#x53E6;&#x4E00;&#x6761;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;&#xFF08;&#x8FD9;&#x70B9;&#x5C31;&#x810F;&#x8BFB;&#x4E0D;&#x540C;&#xFF09;&#xFF0C;&#x6240;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x67E5;&#x8BE2;&#x7684;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x9879;&#xFF0C;&#x800C;&#x5E7B;&#x8BFB;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x4E00;&#x6279;&#x6570;&#x636E;&#x6574;&#x4F53;&#xFF08;&#x6BD4;&#x5982;&#x6570;&#x636E;&#x7684;&#x4E2A;&#x6570;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x7B2C;1&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF1A;&#x4E8B;&#x52A1;A&#x64A4;&#x9500;&#x65F6;&#xFF0C;&#x628A;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;B&#x7684;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x8986;&#x76D6;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x7B2C;2&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF1A;&#x4E8B;&#x52A1;A&#x8986;&#x76D6;&#x4E8B;&#x52A1;B&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x9020;&#x6210;&#x4E8B;&#x52A1;B&#x6240;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x4E22;&#x5931;&#x3002;</p>
</li>
</ul>
</blockquote>
<p>&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x4F1A;&#x901A;&#x8FC7;&#x9501;&#x673A;&#x5236;&#x6765;&#x89E3;&#x51B3;&#x6570;&#x636E;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x95EE;&#x9898;&#xFF0C;&#x6309;&#x9501;&#x5B9A;&#x5BF9;&#x8C61;&#x4E0D;&#x540C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x8868;&#x7EA7;&#x9501;&#x548C;&#x884C;&#x7EA7;&#x9501;&#xFF1B;&#x6309;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x9501;&#x5B9A;&#x5173;&#x7CFB;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x5171;&#x4EAB;&#x9501;&#x548C;&#x72EC;&#x5360;&#x9501;</p>
<p>&#x6570;&#x636E;&#x5E93;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;&#x56DB;&#x79CD;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF1A;<br>&#x3000;&#x3000;&#x2460; Serializable (&#x4E32;&#x884C;&#x5316;)&#xFF1A;&#x53EF;&#x907F;&#x514D;&#x810F;&#x8BFB;&#x3001;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x3001;&#x5E7B;&#x8BFB;&#x7684;&#x53D1;&#x751F;&#x3002;<br>&#x3000;&#x3000;&#x2461; Repeatable read (&#x53EF;&#x91CD;&#x590D;&#x8BFB;)&#xFF1A;&#x53EF;&#x907F;&#x514D;&#x810F;&#x8BFB;&#x3001;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x53D1;&#x751F;&#x3002;<br>&#x3000;&#x3000;&#x2462; Read committed (&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;)&#xFF1A;&#x53EF;&#x907F;&#x514D;&#x810F;&#x8BFB;&#x7684;&#x53D1;&#x751F;&#x3002;<br>&#x3000;&#x3000;&#x2463; Read uncommitted (&#x8BFB;&#x672A;&#x63D0;&#x4EA4;)&#xFF1A;&#x6700;&#x4F4E;&#x7EA7;&#x522B;&#xFF0C;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x90FD;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x3002;</p>
<p>###6.BS&#x4E0E;CS&#x7684;&#x8054;&#x7CFB;&#x4E0E;&#x533A;&#x522B;<br>C/S&#x662F;Client/Server&#x7684;&#x7F29;&#x5199;&#x3002;&#x670D;&#x52A1;&#x5668;&#x901A;&#x5E38;&#x91C7;&#x7528;&#x9AD8;&#x6027;&#x80FD;&#x7684;PC&#x3001;&#x5DE5;&#x4F5C;&#x7AD9;&#x6216;&#x5C0F;&#x578B;&#x673A;&#xFF0C;&#x5E76;&#x91C7;&#x7528;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;Oracle&#x3001;Sybase&#x3001;Informix&#x6216; SQL Server&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x4E13;&#x7528;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x3002;<br>B/&#xFF33;&#x662F;Brower/Server&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x5BA2;&#x6237;&#x673A;&#x4E0A;&#x53EA;&#x8981;&#x5B89;&#x88C5;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#xFF08;Browser&#xFF09;&#xFF0C;&#x5982;Netscape Navigator&#x6216;Internet Explorer&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5B89;&#x88C5;Oracle&#x3001;Sybase&#x3001;Informix&#x6216; SQL Server&#x7B49;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#x4E0B;&#xFF0C;&#x7528;&#x6237;&#x754C;&#x9762;&#x5B8C;&#x5168;&#x901A;&#x8FC7;WWW&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x4E8B;&#x52A1;&#x903B;&#x8F91;&#x5728;&#x524D;&#x7AEF;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x4E3B;&#x8981;&#x4E8B;&#x52A1;&#x903B;&#x8F91;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5B9E;&#x73B0;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x901A;&#x8FC7;&#xFF37;eb Server &#x540C;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x3002;<br>C/S &#x4E0E; B/S &#x533A;&#x522B;&#xFF1A;<br>&#xFF11;&#xFF0E;&#x786C;&#x4EF6;&#x73AF;&#x5883;&#x4E0D;&#x540C;:<br>&#x3000;&#x3000;C/S &#x4E00;&#x822C;&#x5EFA;&#x7ACB;&#x5728;&#x4E13;&#x7528;&#x7684;&#x7F51;&#x7EDC;&#x4E0A;, &#x5C0F;&#x8303;&#x56F4;&#x91CC;&#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;, &#x5C40;&#x57DF;&#x7F51;&#x4E4B;&#x95F4;&#x518D;&#x901A;&#x8FC7;&#x4E13;&#x95E8;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x8FDE;&#x63A5;&#x548C;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x670D;&#x52A1;.<br>&#x3000;&#x3000;B/S &#x5EFA;&#x7ACB;&#x5728;&#x5E7F;&#x57DF;&#x7F51;&#x4E4B;&#x4E0A;&#x7684;, &#x4E0D;&#x5FC5;&#x662F;&#x4E13;&#x95E8;&#x7684;&#x7F51;&#x7EDC;&#x786C;&#x4EF6;&#x73AF;&#x5883;,&#x4F8B;&#x4E0E;&#x7535;&#x8BDD;&#x4E0A;&#x7F51;, &#x79DF;&#x7528;&#x8BBE;&#x5907;. &#x4FE1;&#x606F;&#x81EA;&#x5DF1;&#x7BA1;&#x7406;. &#x6709;&#x6BD4;C/S&#x66F4;&#x5F3A;&#x7684;&#x9002;&#x5E94;&#x8303;&#x56F4;, &#x4E00;&#x822C;&#x53EA;&#x8981;&#x6709;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x884C;<br>&#xFF12;&#xFF0E;&#x5BF9;&#x5B89;&#x5168;&#x8981;&#x6C42;&#x4E0D;&#x540C;<br>&#x3000;&#x3000;C/S &#x4E00;&#x822C;&#x9762;&#x5411;&#x76F8;&#x5BF9;&#x56FA;&#x5B9A;&#x7684;&#x7528;&#x6237;&#x7FA4;, &#x5BF9;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x7684;&#x63A7;&#x5236;&#x80FD;&#x529B;&#x5F88;&#x5F3A;. &#x4E00;&#x822C;&#x9AD8;&#x5EA6;&#x673A;&#x5BC6;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;C/S &#x7ED3;&#x6784;&#x9002;&#x5B9C;. &#x53EF;&#x4EE5;&#x901A;&#x8FC7;B/S&#x53D1;&#x5E03;&#x90E8;&#x5206;&#x53EF;&#x516C;&#x5F00;&#x4FE1;&#x606F;.<br>&#x3000;&#x3000;B/S &#x5EFA;&#x7ACB;&#x5728;&#x5E7F;&#x57DF;&#x7F51;&#x4E4B;&#x4E0A;, &#x5BF9;&#x5B89;&#x5168;&#x7684;&#x63A7;&#x5236;&#x80FD;&#x529B;&#x76F8;&#x5BF9;&#x5F31;, &#x53EF;&#x80FD;&#x9762;&#x5411;&#x4E0D;&#x53EF;&#x77E5;&#x7684;&#x7528;&#x6237;&#x3002;<br>&#xFF13;&#xFF0E;&#x5BF9;&#x7A0B;&#x5E8F;&#x67B6;&#x6784;&#x4E0D;&#x540C;<br>&#x3000;&#x3000;C/S &#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x6CE8;&#x91CD;&#x6D41;&#x7A0B;, &#x53EF;&#x4EE5;&#x5BF9;&#x6743;&#x9650;&#x591A;&#x5C42;&#x6B21;&#x6821;&#x9A8C;, &#x5BF9;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x53EF;&#x4EE5;&#x8F83;&#x5C11;&#x8003;&#x8651;.<br>&#x3000;&#x3000;B/S &#x5BF9;&#x5B89;&#x5168;&#x4EE5;&#x53CA;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x7684;&#x591A;&#x91CD;&#x7684;&#x8003;&#x8651;, &#x5EFA;&#x7ACB;&#x5728;&#x9700;&#x8981;&#x66F4;&#x52A0;&#x4F18;&#x5316;&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;. &#x6BD4;C/S&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x8981;&#x6C42; B/S&#x7ED3;&#x6784;&#x7684;&#x7A0B;&#x5E8F;&#x67B6;&#x6784;&#x662F;&#x53D1;&#x5C55;&#x7684;&#x8D8B;&#x52BF;, &#x4ECE;MS&#x7684;.Net&#x7CFB;&#x5217;&#x7684;BizTalk 2000 Exchange 2000&#x7B49;, &#x5168;&#x9762;&#x652F;&#x6301;&#x7F51;&#x7EDC;&#x7684;&#x6784;&#x4EF6;&#x642D;&#x5EFA;&#x7684;&#x7CFB;&#x7EDF;. SUN &#x548C;IBM&#x63A8;&#x7684;JavaBean &#x6784;&#x4EF6;&#x6280;&#x672F;&#x7B49;,&#x4F7F; B/S&#x66F4;&#x52A0;&#x6210;&#x719F;.<br>&#xFF14;&#xFF0E;&#x8F6F;&#x4EF6;&#x91CD;&#x7528;&#x4E0D;&#x540C;<br>&#x3000;&#x3000;C/S &#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x6574;&#x4F53;&#x6027;&#x8003;&#x8651;, &#x6784;&#x4EF6;&#x7684;&#x91CD;&#x7528;&#x6027;&#x4E0D;&#x5982;&#x5728;B/S&#x8981;&#x6C42;&#x4E0B;&#x7684;&#x6784;&#x4EF6;&#x7684;&#x91CD;&#x7528;&#x6027;&#x597D;.<br>&#x3000;&#x3000;B/S &#x5BF9;&#x7684;&#x591A;&#x91CD;&#x7ED3;&#x6784;,&#x8981;&#x6C42;&#x6784;&#x4EF6;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#x529F;&#x80FD;. &#x80FD;&#x591F;&#x76F8;&#x5BF9;&#x8F83;&#x597D;&#x7684;&#x91CD;&#x7528;.&#x5C31;&#x5165;&#x4E70;&#x6765;&#x7684;&#x9910;&#x684C;&#x53EF;&#x4EE5;&#x518D;&#x5229;&#x7528;,&#x800C;&#x4E0D;&#x662F;&#x505A;&#x5728;&#x5899;&#x4E0A;&#x7684;&#x77F3;&#x5934;&#x684C;&#x5B50;<br>&#xFF15;&#xFF0E;&#x7CFB;&#x7EDF;&#x7EF4;&#x62A4;&#x4E0D;&#x540C;<br>&#x3000;&#x3000;C/S &#x7A0B;&#x5E8F;&#x7531;&#x4E8E;&#x6574;&#x4F53;&#x6027;, &#x5FC5;&#x987B;&#x6574;&#x4F53;&#x8003;&#x5BDF;, &#x5904;&#x7406;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x4EE5;&#x53CA;&#x7CFB;&#x7EDF;&#x5347;&#x7EA7;. &#x5347;&#x7EA7;&#x96BE;. &#x53EF;&#x80FD;&#x662F;&#x518D;&#x505A;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x7CFB;&#x7EDF;<br>&#x3000;&#x3000;B/S &#x6784;&#x4EF6;&#x7EC4;&#x6210;,&#x65B9;&#x9762;&#x6784;&#x4EF6;&#x4E2A;&#x522B;&#x7684;&#x66F4;&#x6362;,&#x5B9E;&#x73B0;&#x7CFB;&#x7EDF;&#x7684;&#x65E0;&#x7F1D;&#x5347;&#x7EA7;. &#x7CFB;&#x7EDF;&#x7EF4;&#x62A4;&#x5F00;&#x9500;&#x51CF;&#x5230;&#x6700;&#x5C0F;.&#x7528;&#x6237;&#x4ECE;&#x7F51;&#x4E0A;&#x81EA;&#x5DF1;&#x4E0B;&#x8F7D;&#x5B89;&#x88C5;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5347;&#x7EA7;.<br>&#xFF16;&#xFF0E;&#x5904;&#x7406;&#x95EE;&#x9898;&#x4E0D;&#x540C;<br>&#x3000;&#x3000;C/S &#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x7528;&#x6237;&#x9762;&#x56FA;&#x5B9A;, &#x5E76;&#x4E14;&#x5728;&#x76F8;&#x540C;&#x533A;&#x57DF;, &#x5B89;&#x5168;&#x8981;&#x6C42;&#x9AD8;&#x9700;&#x6C42;, &#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;. &#x5E94;&#x8BE5;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#x7CFB;&#x7EDF;<br>&#x3000;&#x3000;B/S &#x5EFA;&#x7ACB;&#x5728;&#x5E7F;&#x57DF;&#x7F51;&#x4E0A;, &#x9762;&#x5411;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x7FA4;, &#x5206;&#x6563;&#x5730;&#x57DF;, &#x8FD9;&#x662F;C/S&#x65E0;&#x6CD5;&#x4F5C;&#x5230;&#x7684;. &#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E73;&#x53F0;&#x5173;&#x7CFB;&#x6700;&#x5C0F;.<br>&#xFF17;&#xFF0E;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x4E0D;&#x540C;<br>&#x3000;&#x3000;C/S &#x591A;&#x662F;&#x5EFA;&#x7ACB;&#x7684;Window&#x5E73;&#x53F0;&#x4E0A;,&#x8868;&#x73B0;&#x65B9;&#x6CD5;&#x6709;&#x9650;,&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x666E;&#x904D;&#x8981;&#x6C42;&#x8F83;&#x9AD8;<br>&#x3000;&#x3000;B/S &#x5EFA;&#x7ACB;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;, &#x6709;&#x66F4;&#x52A0;&#x4E30;&#x5BCC;&#x548C;&#x751F;&#x52A8;&#x7684;&#x8868;&#x73B0;&#x65B9;&#x5F0F;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x6D41;. &#x5E76;&#x4E14;&#x5927;&#x90E8;&#x5206;&#x96BE;&#x5EA6;&#x51CF;&#x4F4E;,&#x51CF;&#x4F4E;&#x5F00;&#x53D1;&#x6210;&#x672C;.<br>&#xFF18;&#xFF0E;&#x4FE1;&#x606F;&#x6D41;&#x4E0D;&#x540C;<br>&#x3000;&#x3000;C/S &#x7A0B;&#x5E8F;&#x4E00;&#x822C;&#x662F;&#x5178;&#x578B;&#x7684;&#x4E2D;&#x592E;&#x96C6;&#x6743;&#x7684;&#x673A;&#x68B0;&#x5F0F;&#x5904;&#x7406;, &#x4EA4;&#x4E92;&#x6027;&#x76F8;&#x5BF9;&#x4F4E;<br>&#x3000;&#x3000;B/S &#x4FE1;&#x606F;&#x6D41;&#x5411;&#x53EF;&#x53D8;&#x5316;, B-B B-C B-G&#x7B49;&#x4FE1;&#x606F;&#x3001;&#x6D41;&#x5411;&#x7684;&#x53D8;&#x5316;, &#x66F4;&#x50CF;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x3002;</p>
<p>###7.&#x6D45;&#x8C08;Session&#x4E0E;Cookie&#x7684;&#x533A;&#x522B;&#x4E0E;&#x8054;&#x7CFB;<br>&#x4E00;&#x3001;Session&#x7684;&#x6982;&#x5FF5;<br>Session &#x662F;&#x5B58;&#x653E;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;Session&#x7ED3;&#x6784;&#x6765;&#x5B58;&#x653E;&#x7528;&#x6237;&#x6570;&#x636E;&#xFF0C;&#x5F53;&#x6D4F;&#x89C8;&#x5668; &#x7B2C;&#x4E00;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4E86;&#x4E00;&#x4E2A;Session&#x548C;&#x4E00;&#x4E2A;Session ID&#x7528;&#x6765;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x8FD9;&#x4E2A;Session&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x901A;&#x8FC7;&#x54CD;&#x5E94;&#x53D1;&#x9001;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x5F53;&#x6D4F;&#x89C8;&#x5668;&#x7B2C;&#x4E8C;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x4F1A;&#x5C06;&#x524D;&#x4E00;&#x6B21;&#x670D;&#x52A1;&#x5668;&#x54CD;&#x5E94;&#x4E2D;&#x7684;Session ID&#x653E;&#x5728;&#x8BF7;&#x6C42;&#x4E2D;&#x4E00;&#x5E76;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4ECE;&#x8BF7;&#x6C42;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;Session ID&#xFF0C;&#x5E76;&#x548C;&#x4FDD;&#x5B58;&#x7684;&#x6240;&#x6709;Session ID&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#xFF0C;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x7528;&#x6237;&#x5BF9;&#x5E94;&#x7684;Session&#x3002;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x5728;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#xFF08;&#x9ED8;&#x8BA4;30&#x5206;&#x949F;&#xFF09;&#x4FDD;&#x5B58;&#x8FD9;&#x4E2A; Session&#xFF0C;&#x8FC7;&#x4E86;&#x65F6;&#x95F4;&#x9650;&#x5236;&#xFF0C;&#x5C31;&#x4F1A;&#x9500;&#x6BC1;&#x8FD9;&#x4E2A;Session&#x3002;&#x5728;&#x9500;&#x6BC1;&#x4E4B;&#x524D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5C06;&#x7528;&#x6237;&#x7684;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x4EE5;Key&#x548C;Value&#x7684;&#x5F62;&#x5F0F;&#x6682;&#x65F6;&#x5B58;&#x653E;&#x5728;&#x8FD9;&#x4E2A; Session&#x4E2D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x6709;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x8FD9;&#x4E2A;Session&#x5E8F;&#x5217;&#x5316;&#x540E;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x597D;&#x5904;&#x662F;&#x6CA1;&#x4E86;&#x65F6;&#x95F4;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x574F;&#x5904;&#x662F;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E; &#x5E93;&#x4F1A;&#x6025;&#x901F;&#x81A8;&#x80C0;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x8BBF;&#x95EE;&#x91CF;&#x589E;&#x52A0;&#x7684;&#x65F6;&#x5019;&#x3002;&#x4E00;&#x822C;&#x8FD8;&#x662F;&#x91C7;&#x53D6;&#x524D;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x51CF;&#x8F7B;&#x670D;&#x52A1;&#x5668;&#x538B;&#x529B;&#x3002;</p>
<p>&#x4E8C;&#x3001;Session&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5B9E;&#x73B0;&#x5F62;&#x5F0F;&#xFF08;&#x5373;Session ID&#x7684;&#x4FDD;&#x5B58;&#x65B9;&#x6CD5;&#xFF09;<br>&#x4E00;&#x822C;&#x6D4F;&#x89C8;&#x5668;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x4FDD;&#x5B58;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x4F7F;&#x7528;html&#x9690;&#x85CF;&#x57DF;&#x7684;&#x65B9;&#x5F0F;&#x81EA;&#x5B9A;&#x4E49;&#x5B9E;&#x73B0;&#xFF1A;</p>
<p>[1] &#x4F7F;&#x7528;Cookie&#x6765;&#x4FDD;&#x5B58;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x672C;&#x6587;&#x201C;&#x8BB0;&#x4F4F;&#x6211;&#x7684;&#x767B;&#x5F55;&#x72B6;&#x6001;&#x201D;&#x529F;&#x80FD;&#x7684;&#x5B9E;&#x73B0;&#x6B63;&#x5F0F;&#x57FA;&#x4E8E;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x3002;&#x670D;&#x52A1;&#x5668;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;Cookie&#x7684;&#x65B9;&#x5F0F;&#x5C06;Session ID&#x53D1;&#x9001;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;Cookie&#x5C06;&#x4E0D;&#x5B58;&#x653E;&#x5728;&#x786C;&#x76D8;&#x4E0A;&#xFF0C;&#x5F53;&#x6D4F;&#x89C8;&#x5668;&#x5173;&#x95ED;&#x7684;&#x65F6;&#x5019;&#xFF0C;Cookie&#x5C31;&#x6D88;&#x5931;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;Session ID&#x5C31;&#x4E22;&#x5931;&#x4E86;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x4E3A;&#x82E5;&#x5E72;&#x5929;&#x4E4B;&#x540E;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;Cookie&#x4F1A;&#x4FDD;&#x5B58;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x786C;&#x76D8;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x6D4F;&#x89C8;&#x5668;&#x5173;&#x95ED;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x4E0B;&#x6B21;&#x8BBF;&#x95EE;&#x76F8;&#x5E94;&#x7F51;&#x7AD9;&#x65F6;&#xFF0C;&#x540C; &#x6837;&#x4F1A;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;</p>
<p>[2] &#x4F7F;&#x7528;URL&#x9644;&#x52A0;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x50CF;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x770B;&#x5230;JSP&#x7F51;&#x7AD9;&#x4F1A;&#x6709;aaa.jsp?JSESSIONID=*&#x4E00;&#x6837;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x548C;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x91CC;&#x9762;&#x4E0D;&#x8BBE;&#x7F6E;Cookie&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>[3] &#x7B2C;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x5728;&#x9875;&#x9762;&#x8868;&#x5355;&#x91CC;&#x9762;&#x589E;&#x52A0;&#x9690;&#x85CF;&#x57DF;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x9645;&#x4E0A;&#x548C;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x5F0F;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x524D;&#x8005;&#x901A;&#x8FC7;GET&#x65B9;&#x5F0F;&#x53D1;&#x9001;&#x6570;&#x636E;&#xFF0C;&#x540E;&#x8005;&#x4F7F;&#x7528;POST&#x65B9;&#x5F0F;&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;&#x4F46;&#x662F;&#x660E;&#x663E;&#x540E;&#x8005;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#x3002;</p>
<p>&#x4E09;&#xFF1A;Session&#x4E0E;Cookie&#x533A;&#x522B;&#x548C;&#x8054;&#x7CFB;&#xFF1A;<br>cookie&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;session&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x3002;</p>
<p>Cookies&#x662F;&#x5C5E;&#x4E8E;Session&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x79CD;&#x3002;&#x4F46;&#x6709;&#x4E0D;&#x540C;&#xFF0C;Cookies&#x4E0D;&#x4F1A;&#x5360;&#x670D;&#x52A1;&#x5668;&#x8D44;&#x6E90;&#xFF0C;&#x662F;&#x5B58;&#x5728;&#x5BA2;&#x670D;&#x7AEF;&#x5185;&#x5B58;&#x6216;&#x8005;&#x4E00;&#x4E2A;cookie&#x7684;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x4E2D;&#xFF1B;&#x800C;&#x201C;Session&#x201D;&#x5219;&#x4F1A;&#x5360;&#x7528;&#x670D;&#x52A1;&#x5668;&#x8D44;&#x6E90;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x4F7F;&#x7528;Session&#xFF0C;&#x800C;&#x4F7F;&#x7528;Cookies&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x8BA4;&#x4E3A;cookie&#x662F;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#xFF0C;session&#x662F;&#x53EF;&#x9760;&#x5730;&#xFF0C;&#x4F46;&#x662F;&#x76EE;&#x524D;&#x5F88;&#x591A;&#x8457;&#x540D;&#x7684;&#x7AD9;&#x70B9;&#x4E5F;&#x90FD;&#x4EE5;&#x6765;cookie&#x3002;&#x6709;&#x65F6;&#x5019;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7981;&#x7528;cookie&#x540E;&#x7684;&#x9875;&#x9762;&#x5904;&#x7406;&#xFF0C;&#x901A;&#x5E38;&#x91C7;&#x7528;url&#x91CD;&#x5199;&#x6280;&#x672F;&#xFF0C;&#x8C03;&#x7528;session&#x4E2D;&#x5927;&#x91CF;&#x6709;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4ECE;session&#x4E2D;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x540E;&#x7F6E;&#x5165;&#x9875;&#x9762;&#x3002;</p>
<p>###8.java&#x4E2D;fail-fast &#x548C; fail-safe&#x7684;&#x533A;&#x522B;<br>1.&#x4EC0;&#x4E48;&#x662F;&#x540C;&#x6B65;&#x4FEE;&#x6539;&#xFF1F;<br>&#x5F53;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x6B63;&#x5728;&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x96C6;&#x5408;Collection&#xFF0C;&#x6B64;&#x65F6;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4FEE;&#x6539;&#x4E86;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#x7684;&#x5185;&#x5BB9;&#xFF08;&#x6DFB;&#x52A0;&#xFF0C;&#x5220;&#x9664;&#x6216;&#x8005;&#x4FEE;&#x6539;&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5E76;&#x53D1;&#x4FEE;&#x6539;</p>
<p>2.&#x4EC0;&#x4E48;&#x662F; fail-fast &#x673A;&#x5236;?<br>fail-fast&#x673A;&#x5236;&#x5728;&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x65F6;&#xFF0C;&#x5F53;&#x96C6;&#x5408;&#x7ED3;&#x6784;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x4F1A;&#x629B;&#x51FA;Concurrent Modification Exception&#x3002;<br>fail-fast&#x4F1A;&#x5728;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x629B;&#x51FA;ConcurrentModificationException<br>&#xFF08;1&#xFF09;&#x5355;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;<br>&#x96C6;&#x5408;&#x88AB;&#x521B;&#x5EFA;&#x540E;&#xFF0C;&#x5728;&#x904D;&#x5386;&#x5B83;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4FEE;&#x6539;&#x4E86;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6CE8;&#x610F; remove()&#x65B9;&#x6CD5;&#x4F1A;&#x8BA9;expectModcount&#x548C;modcount &#x76F8;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x4E0D;&#x4F1A;&#x629B;&#x51FA;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;<br>&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x904D;&#x5386;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5BF9;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#x7684;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x4E86;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FED;&#x4EE3;&#x5668;&#x7684;&#x5FEB;&#x901F;&#x5931;&#x8D25;&#x884C;&#x4E3A;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x4FDD;&#x8BC1;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x5BF9;&#x662F;&#x5426;&#x51FA;&#x73B0;&#x4E0D;&#x540C;&#x6B65;&#x5E76;&#x53D1;&#x4FEE;&#x6539;&#x505A;&#x51FA;&#x4EFB;&#x4F55;&#x786C;&#x6027;&#x4FDD;&#x8BC1;&#x3002;&#x5FEB;&#x901F;&#x5931;&#x8D25;&#x8FED;&#x4EE3;&#x5668;&#x4F1A;&#x5C3D;&#x6700;&#x5927;&#x52AA;&#x529B;&#x629B;&#x51FA; ConcurrentModificationException&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x63D0;&#x9AD8;&#x8FD9;&#x7C7B;&#x8FED;&#x4EE3;&#x5668;&#x7684;&#x6B63;&#x786E;&#x6027;&#x800C;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x4F9D;&#x8D56;&#x4E8E;&#x6B64;&#x5F02;&#x5E38;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x505A;&#x6CD5;&#xFF1A;&#x8FED;&#x4EE3;&#x5668;&#x7684;&#x5FEB;&#x901F;&#x5931;&#x8D25;&#x884C;&#x4E3A;&#x5E94;&#x8BE5;&#x4EC5;&#x7528;&#x4E8E;&#x68C0;&#x6D4B; bug&#x3002;</p>
<p>3.fail-fast&#x673A;&#x5236;&#x662F;&#x5982;&#x4F55;&#x68C0;&#x6D4B;&#x7684;&#xFF1F;<br>&#x8FED;&#x4EE3;&#x5668;&#x5728;&#x904D;&#x5386;&#x8FC7;&#x7A0B;&#x4E2D;&#x662F;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5185;&#x90E8;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5185;&#x90E8;&#x7684;&#x6570;&#x636E;&#x5728;&#x904D;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x65E0;&#x6CD5;&#x88AB;&#x4FEE;&#x6539;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x4E0D;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x8FED;&#x4EE3;&#x5668;&#x5185;&#x90E8;&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4E2A;&#x6807;&#x8BB0; &#x201C;mode&#x201D; &#xFF0C;&#x5F53;&#x96C6;&#x5408;&#x7ED3;&#x6784;&#x6539;&#x53D8;&#xFF08;&#x6DFB;&#x52A0;&#x5220;&#x9664;&#x6216;&#x8005;&#x4FEE;&#x6539;&#xFF09;&#xFF0C;&#x6807;&#x8BB0;&#x201D;mode&#x201D;&#x4F1A;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x800C;&#x8FED;&#x4EE3;&#x5668;&#x6BCF;&#x6B21;&#x7684;hasNext()&#x548C;next()&#x65B9;&#x6CD5;&#x90FD;&#x4F1A;&#x68C0;&#x67E5;&#x8BE5;&#x201D;mode&#x201D;&#x662F;&#x5426;&#x88AB;&#x6539;&#x53D8;&#xFF0C;&#x5F53;&#x68C0;&#x6D4B;&#x5230;&#x88AB;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x629B;&#x51FA;Concurrent Modification Exception</p>
<p>4.fail-safe&#x673A;&#x5236;<br>fail-safe&#x4EFB;&#x4F55;&#x5BF9;&#x96C6;&#x5408;&#x7ED3;&#x6784;&#x7684;&#x4FEE;&#x6539;&#x90FD;&#x4F1A;&#x5728;&#x4E00;&#x4E2A;&#x590D;&#x5236;&#x7684;&#x96C6;&#x5408;&#x4E0A;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x629B;&#x51FA;ConcurrentModificationException</p>
<p>fail-safe&#x673A;&#x5236;&#x6709;&#x4E24;&#x4E2A;&#x95EE;&#x9898;<br>&#xFF08;1&#xFF09;&#x9700;&#x8981;&#x590D;&#x5236;&#x96C6;&#x5408;&#xFF0C;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x7684;&#x65E0;&#x6548;&#x5BF9;&#x8C61;&#xFF0C;&#x5F00;&#x9500;&#x5927;<br>&#xFF08;2&#xFF09;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x8BFB;&#x53D6;&#x7684;&#x6570;&#x636E;&#x662F;&#x76EE;&#x524D;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>###9.http&#x4E2D;post &#x548C; get &#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#x533A;&#x522B;<br>HTTP&#x534F;&#x8BAE;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x7684;&#x4E0D;&#x540C;&#x65B9;&#x6CD5;&#xFF0C;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x6709;4&#x79CD;&#xFF0C;&#x5206;&#x522B;&#x662F;GET&#xFF0C;POST&#xFF0C;PUT&#xFF0C;DELETE&#x3002;&#x8FD9;&#x56DB;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#xFF0C;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x8D44;&#x6E90;&#x7684;&#x67E5;&#xFF0C;&#x6539;&#xFF0C;&#x589E;&#xFF0C;&#x5220;&#x3002;</p>
<p>GET&#xFF1A;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x67E5;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x5668;&#x8D44;&#x6E90;&#xFF0C;&#x4E0D;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;</p>
<p>POST&#xFF1A;&#x5411;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4EA4;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x4E86;&#x6570;&#x636E;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x66F4;&#x6539;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>PUT&#xFF1A;PUT&#x7684;&#x82F1;&#x6587;&#x542B;&#x4E49;&#x662F;&#x653E;&#x7F6E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5411;&#x670D;&#x52A1;&#x5668;&#x65B0;&#x6DFB;&#x52A0;&#x6570;&#x636E;&#xFF0C;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x589E;&#x3002;</p>
<p>DELETE&#xFF1A;&#x4ECE;&#x5B57;&#x9762;&#x610F;&#x601D;&#x4E5F;&#x80FD;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x5220;&#x9664;&#x670D;&#x52A1;&#x5668;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<blockquote>
<ul class="ui list">
<li><p>GET&#x4EA4;&#x4E92;<br>1&#x3001;GET&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x662F;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x5E76;&#x975E;&#x4FEE;&#x6539;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;GET&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;<br>2&#x3001;GET&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x662F;&#x5E42;&#x7B49;&#x7684;&#xFF0C;&#x5E42;&#x7B49;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B66;&#x6982;&#x5FF5;&#xFF0C;&#x5E42;&#x7B49;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x53C2;&#x6570;&#x91CD;&#x590D;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x83B7;&#x5F97;&#x76F8;&#x540C;&#x7ED3;&#x679C;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5728;GET&#x4EA4;&#x4E92;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#xFF0C;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;URL&#x7684;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;</p>
</li>
<li><p>POST&#x4EA4;&#x4E92;<br>1&#x3001;POST&#x4EA4;&#x4E92;&#x662F;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x670D;&#x52A1;&#x5668;&#x6570;&#x636E;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x4FE1;&#x606F;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x3002;<br>2&#x3001;&#x4E00;&#x822C;&#x7684;POST&#x4EA4;&#x4E92;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x7528;&#x5230;&#x8868;&#x5355;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8868;&#x5355;&#x63D0;&#x4EA4;&#x7684;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#x662F;GET&#xFF0C;&#x5982;&#x679C;&#x6539;&#x4E3A;POST&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x8868;&#x5355;&#x63D0;&#x4EA4;&#x65F6;&#x7684;Method</p>
</li>
<li><p>&#x4E24;&#x8005;&#x7684;&#x533A;&#x522B;<br>GET&#x65B9;&#x5F0F;&#xFF1A;<br>1&#x3001;GET&#x65B9;&#x5F0F;&#x662F;&#x4EE5;&#x5B9E;&#x4F53;&#x7684;&#x65B9;&#x5F0F;&#x5F97;&#x5230;&#x7531;&#x8BF7;&#x6C42;URL&#x6240;&#x6307;&#x5B9A;&#x8D44;&#x6E90;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x8BF7;&#x6C42;URL&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4EA7;&#x751F;&#x8FC7;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x7EC8;&#x8981;&#x5728;&#x54CD;&#x5E94;&#x5B9E;&#x4F53;&#x4E2D;&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x7684;&#x7ED3;&#x679C;&#x6240;&#x6307;&#x5411;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;GET&#x7684;&#x5230;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8D44;&#x6E90;&#x7684;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x3002;<br>2&#x3001;&#x8BF7;&#x7684;&#x6C42;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x9644;&#x52A0;&#x5728;URL&#x4E4B;&#x540E;&#xFF0C;&#x4EE5;&#xFF1F;&#x5206;&#x9694;URL&#x548C;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF0C;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#x7528;&amp;&#x8FDE;&#x63A5;&#x3002;URL&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x91C7;&#x7528;&#x7684;&#x662F;ASCII&#x7F16;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x662F;Unicode&#xFF0C;&#x5373;&#x6240;&#x6709;&#x7684;&#x975E;ASCII&#x5B57;&#x7B26;&#x90FD;&#x8981;&#x7F16;&#x7801;&#x4E4B;&#x540E;&#x518D;&#x4F20;&#x8F93;&#x3002;<br>3&#x3001;&#x56E0;&#x4E3A;URL&#x7684;&#x957F;&#x5EA6;&#x9650;&#x5236;&#xFF0C;GET&#x65B9;&#x5F0F;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x6709;&#x6240;&#x9650;&#x5236;&#xFF0C;&#x4F20;&#x9001;&#x7684;&#x6570;&#x636E;&#x91CF;&#x4E0D;&#x8D85;&#x8FC7;2KB&#x3002;<br>4&#x3001;GET&#x65B9;&#x5F0F;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7528;Request.QueryString&#x83B7;&#x53D6;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x3002;<br>5&#x3001;GET&#x65B9;&#x5F0F;&#x4F20;&#x8F93;&#x7684;&#x53C2;&#x6570;&#x5B89;&#x5168;&#x6027;&#x4F4E;&#xFF0C;&#x56E0;&#x4E3A;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x663E;&#x793A;&#x5728;&#x8BF7;&#x6C42;&#x7684;URL&#x4E2D;&#x3002;<br>POST&#x65B9;&#x5F0F;&#xFF1A;<br>1&#x3001;&#x7528;&#x6765;&#x5411;&#x76EE;&#x7684;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#xFF0C;&#x8981;&#x6C42;&#x5B83;&#x63A5;&#x6536;&#x88AB;&#x9644;&#x5728;&#x8BF7;&#x6C42;&#x540E;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x5F53;&#x505A;&#x8BF7;&#x6C42;&#x961F;&#x5217;&#x4E2D;&#x8BF7;&#x6C42;URL&#x6240;&#x6307;&#x5B9A;&#x8D44;&#x6E90;&#x7684;&#x9644;&#x52A0;&#x65B0;&#x5B50;&#x9879;&#x3002;<br>2&#x3001;POST&#x65B9;&#x5F0F;&#x5C06;&#x8868;&#x5355;&#x5185;&#x5404;&#x4E2A;&#x5B57;&#x6BB5;&#x548C;&#x5185;&#x5BB9;&#x653E;&#x7F6E;&#x5728;HTML HEADER&#x4E2D;&#x4E00;&#x8D77;&#x4F20;&#x9001;&#x5230;Action&#x5C5E;&#x6027;&#x6240;&#x6307;&#x5B9A;&#x7684;URL&#x5730;&#x5740;&#xFF0C;&#x7528;&#x6237;&#x662F;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x3002;<br>3&#x3001;POST&#x65B9;&#x5F0F;&#x4F20;&#x9001;&#x7684;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x4E00;&#x822C;&#x88AB;&#x9ED8;&#x8BA4;&#x4E3A;&#x6CA1;&#x6709;&#x9650;&#x5236;&#xFF0C;&#x4F46;&#x662F;&#x6839;&#x636E;IIS&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x4F20;&#x8F93;&#x91CF;&#x4E5F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;<br>4&#x3001;POST&#x65B9;&#x5F0F;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7528;Request.Form&#x83B7;&#x53D6;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x3002;<br>5&#x3001;POST&#x65B9;&#x5F0F;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x5B89;&#x5168;&#x6027;&#x8F83;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x4E0D;&#x662F;&#x660E;&#x663E;&#x663E;&#x793A;&#x7684;&#x3002;</p>
</li>
</ul>
</blockquote>
<p>###10.interface&#x548C;abstract &#x7684;&#x533A;&#x522B;&#x548C;&#x76F8;&#x540C;&#x70B9;<br>1.&#x76F8;&#x540C;&#x70B9;<br>A. &#x4E24;&#x8005;&#x90FD;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x90FD;&#x4E0D;&#x80FD;&#x5B9E;&#x4F8B;&#x5316;&#x3002;<br>B. interface&#x5B9E;&#x73B0;&#x7C7B;&#x53CA;abstrctclass&#x7684;&#x5B50;&#x7C7B;&#x90FD;&#x5FC5;&#x987B;&#x8981;&#x5B9E;&#x73B0;&#x5DF2;&#x7ECF;&#x58F0;&#x660E;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x3002;</p>
<p>2.&#x4E0D;&#x540C;&#x70B9;<br>A. interface&#x9700;&#x8981;&#x5B9E;&#x73B0;&#xFF0C;&#x8981;&#x7528;implements&#xFF0C;&#x800C;abstract class&#x9700;&#x8981;&#x7EE7;&#x627F;&#xFF0C;&#x8981;&#x7528;extends&#x3002;<br>B. &#x4E00;&#x4E2A;&#x7C7B;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;interface&#xFF0C;&#x4F46;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x80FD;&#x7EE7;&#x627F;&#x4E00;&#x4E2A;abstract class&#x3002;<br>C. interface&#x5F3A;&#x8C03;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;abstractclass&#x5F3A;&#x8C03;&#x6240;&#x5C5E;&#x5173;&#x7CFB;&#x3002;<br>D. &#x5C3D;&#x7BA1;interface&#x5B9E;&#x73B0;&#x7C7B;&#x53CA;abstrct class&#x7684;&#x5B50;&#x7C7B;&#x90FD;&#x5FC5;&#x987B;&#x8981;&#x5B9E;&#x73B0;&#x76F8;&#x5E94;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x5B9E;&#x73B0;&#x7684;&#x5F62;&#x5F0F;&#x4E0D;&#x540C;&#x3002;interface&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x90FD;&#x53EA;&#x662F;&#x58F0;&#x660E;&#x7684;(declaration,&#x6CA1;&#x6709;&#x65B9;&#x6CD5;&#x4F53;)&#xFF0C;&#x5B9E;&#x73B0;&#x7C7B;&#x5FC5;&#x987B;&#x8981;&#x5B9E;&#x73B0;&#x3002;&#x800C;abstractclass&#x7684;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x6709;&#x9009;&#x62E9;&#x5730;&#x5B9E;&#x73B0;&#x3002;<br>&#x8FD9;&#x4E2A;&#x9009;&#x62E9;&#x6709;&#x4E24;&#x70B9;&#x542B;&#x4E49;&#xFF1A;<br>    &#x4E00;&#x662F;Abastract class&#x4E2D;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x62BD;&#x8C61;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x90A3;&#x4E9B;&#x51A0;&#x6709;abstract&#x7684;&#x65B9;&#x6CD5;&#x624D;&#x662F;&#x62BD;&#x8C61;&#x7684;&#xFF0C;&#x5B50;&#x7C7B;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x3002;&#x90A3;&#x4E9B;&#x6CA1;&#x6709;abstract&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;Abstrct class&#x4E2D;&#x5FC5;&#x987B;&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#x4F53;&#x3002;<br>    &#x4E8C;&#x662F;abstract class&#x7684;&#x5B50;&#x7C7B;&#x5728;&#x7EE7;&#x627F;&#x5B83;&#x65F6;&#xFF0C;&#x5BF9;&#x975E;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x65E2;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7EE7;&#x627F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#xFF1B;&#x800C;&#x5BF9;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5B9E;&#x73B0;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x518D;&#x6B21;&#x58F0;&#x660E;&#x5176;&#x65B9;&#x6CD5;&#x4E3A;&#x62BD;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x65E0;&#x9700;&#x5B9E;&#x73B0;&#xFF0C;&#x7559;&#x7ED9;&#x5176;&#x5B50;&#x7C7B;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x6B64;&#x7C7B;&#x5FC5;&#x987B;&#x4E5F;&#x58F0;&#x660E;&#x4E3A;&#x62BD;&#x8C61;&#x7C7B;&#x3002;&#x65E2;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x4E0D;&#x80FD;&#x5B9E;&#x4F8B;&#x5316;&#x3002;<br>E. abstract class&#x662F;interface&#x4E0E;Class&#x7684;&#x4E2D;&#x4ECB;&#x3002;<br>interface&#x662F;&#x5B8C;&#x5168;&#x62BD;&#x8C61;&#x7684;&#xFF0C;&#x53EA;&#x80FD;&#x58F0;&#x660E;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x80FD;&#x58F0;&#x660E;pulic&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x80FD;&#x58F0;&#x660E;private&#x53CA;protected&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x80FD;&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#x4F53;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x58F0;&#x660E;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x3002;&#x7136;&#x800C;&#xFF0C;interface&#x5374;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x5E38;&#x91CF;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x5728;JDK&#x4E2D;&#x4E0D;&#x96BE;&#x627E;&#x51FA;&#x8FD9;&#x79CD;&#x4F8B;&#x5B50;&#x3002;&#x4F46;&#x5C06;&#x5E38;&#x91CF;&#x53D8;&#x91CF;&#x653E;&#x5728;interface&#x4E2D;&#x8FDD;&#x80CC;&#x4E86;&#x5176;&#x4F5C;&#x4E3A;&#x63A5;&#x53E3;&#x7684;&#x4F5C;&#x7528;&#x800C;&#x5B58;&#x5728;&#x7684;&#x5B97;&#x65E8;&#xFF0C;&#x4E5F;&#x6DF7;&#x6DC6;&#x4E86;interface&#x4E0E;&#x7C7B;&#x7684;&#x4E0D;&#x540C;&#x4EF7;&#x503C;&#x3002;&#x5982;&#x679C;&#x7684;&#x786E;&#x9700;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x653E;&#x5728;&#x76F8;&#x5E94;&#x7684;abstractclass&#x6216;Class&#x4E2D;&#x3002;<br>abstract class&#x5728;interface&#x53CA;Class&#x4E2D;&#x8D77;&#x5230;&#x4E86;&#x627F;&#x4E0A;&#x542F;&#x4E0B;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;abstract class&#x662F;&#x62BD;&#x8C61;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x89C4;&#x8303;&#x5B50;&#x7C7B;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5B83;&#x53C8;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x7F3A;&#x7701;&#x7684;&#x65B9;&#x6CD5;&#x4F53;&#xFF0C;&#x4F9B;&#x5B50;&#x7C7B;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x6216;&#x8986;&#x76D6;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF0C;&#x4EE5;&#x4F9B;&#x5B50;&#x7C7B;&#x901A;&#x8FC7;&#x7EE7;&#x627F;&#x6765;&#x4F7F;&#x7528;&#x3002;</p>
<p>3.interface&#x7684;&#x5E94;&#x7528;&#x573A;&#x5408;<br>A. &#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x7279;&#x5B9A;&#x7684;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#xFF0C;&#x800C;&#x4E0D;&#x5728;&#x4E4E;&#x5176;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x3002;<br>B. &#x4F5C;&#x4E3A;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x7684;&#x6807;&#x8BC6;&#x5B58;&#x5728;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4EC0;&#x4E48;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#x90FD;&#x6CA1;&#x6709;&#x7684;&#x7EAF;&#x7CB9;&#x6807;&#x8BC6;&#x3002;<br>C. &#x9700;&#x8981;&#x5C06;&#x4E00;&#x7EC4;&#x7C7B;&#x89C6;&#x4E3A;&#x5355;&#x4E00;&#x7684;</p>
<p>###11.spring IoC &#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;<br>IOC(Inversion of Control)&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#xFF0C;&#x5C06;&#x63A7;&#x5236;&#x6743;(&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x548C;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x6743;&#x5229;)&#x4EA4;&#x7ED9;spring&#x5BB9;&#x5668;&#x3002;<br>&#x63A5;&#x53E3;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;(Interface Driven Design)&#x7684;&#x597D;&#x5904;&#xFF0C;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;(&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x89E3;&#x8026;),&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;<br>IOC&#x6A21;&#x5F0F;&#x5C06;&#x8026;&#x5408;&#x4EE3;&#x7801;&#x4ECE;&#x7A0B;&#x5E8F;&#x4E2D;&#x79FB;&#x51FA;&#xFF0C;&#x653E;&#x5230;&#x7EDF;&#x4E00;&#x7684;XML&#x6587;&#x4EF6;&#x4E2D;&#x7BA1;&#x7406;&#x3002;<br>&#x7531;IOC&#x5BB9;&#x5668;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6765;&#x7BA1;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3001;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7B49;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x7528;&#x91CD;&#x65B0;&#x4FEE;&#x6539;&#x5E76;&#x7F16;&#x8BD1;&#x5177;&#x4F53;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x89E3;&#x8026;&#x3002;<br>&#x8F7B;&#x91CF;&#x7EA7;IOC&#x5BB9;&#x5668;&#xFF1A;Pico Container&#x3001;Avalon&#x3001;Spring&#x3001;HiveMind&#x7B49;&#x3002;<br>&#x8D85;&#x91CD;&#x91CF;&#x7EA7;IOC&#x5BB9;&#x5668;&#xFF1A;EJB&#x3002;<br>&#x534A;&#x8F7B;&#x534A;&#x91CD;IOC&#x5BB9;&#x5668;&#xFF1A;JBoss&#xFF0C;Jdon&#x7B49;&#x3002;<br>&#x53CD;&#x5C04;:&#x5C31;&#x662F;&#x5C06;Java&#x7C7B;&#x4E2D;&#x7684;&#x5404;&#x79CD;&#x6210;&#x5206;&#x6620;&#x5C04;&#x6210;&#x76F8;&#x5E94;&#x7684;Java&#x7C7B;&#x3002;<br>&#x901A;&#x4FD7;&#x7684;&#x8BF4;&#xFF0C;&#x53CD;&#x5C04;&#x5C31;&#x662F;&#x6839;&#x636E;&#x7ED9;&#x51FA;&#x7684;&#x5B57;&#x7B26;&#x4E32;(&#x7C7B;&#x540D;&#x7B49;)&#x6765;&#x751F;&#x6210;&#x5BF9;&#x8C61;&#x3002;<br>&#x53CD;&#x5C04;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x4E34;&#x65F6;&#x51B3;&#x5B9A;&#x8981;&#x751F;&#x6210;&#x54EA;&#x4E00;&#x79CD;&#x5BF9;&#x8C61;&#xFF0C;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x751F;&#x6210;&#x5BF9;&#x8C61;&#x8F83;&#x6162;&#x3002;<br>IOC&#x7684;&#x4F18;&#x70B9;:&#x5B9E;&#x73B0;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;<br>IOC&#x7684;&#x7F3A;&#x70B9;:<br>1&#x3001;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x6B65;&#x9AA4;&#x53D8;&#x590D;&#x6742;&#x4E86;&#xFF0C;&#x4E0D;&#x76F4;&#x89C2;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x5BF9;&#x4E0D;&#x4E60;&#x60EF;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x7684;&#x3002;<br>2&#x3001;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x53CD;&#x5C04;&#x6765;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6548;&#x7387;&#x4E0A;&#x4F1A;&#x6709;&#x4E9B;&#x635F;&#x8017;&#x3002;&#x4F46;&#x76F8;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x70B9;&#x635F;&#x8017;&#x662F;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x7684;&#x3002;<br>3&#x3001;&#x7F3A;&#x5C11;IDE&#x91CD;&#x6784;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5982;&#x679C;&#x4FEE;&#x6539;&#x4E86;&#x7C7B;&#x540D;&#xFF0C;&#x8FD8;&#x9700;&#x5230;XML&#x6587;&#x4EF6;&#x4E2D;&#x624B;&#x52A8;&#x4FEE;&#x6539;&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x6240;&#x6709;XML&#x65B9;&#x5F0F;&#x7684;&#x7F3A;&#x61BE;&#x6240;&#x5728;&#x3002;</p>
<p>###12.Java NIO &#x4E0E; IO&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;</p>
<blockquote>
<ul class="ui list">
<li><p>&#x6982;&#x8FF0;<br>Java NIO&#x63D0;&#x4F9B;&#x4E86;&#x4E0E;&#x6807;&#x51C6;IO&#x4E0D;&#x540C;&#x7684;IO&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#xFF1A;<br>Channels and Buffers&#xFF08;&#x901A;&#x9053;&#x548C;&#x7F13;&#x51B2;&#x533A;&#xFF09;&#xFF1A;&#x6807;&#x51C6;&#x7684;IO&#x57FA;&#x4E8E;&#x5B57;&#x8282;&#x6D41;&#x548C;&#x5B57;&#x7B26;&#x6D41;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x800C;NIO&#x662F;&#x57FA;&#x4E8E;&#x901A;&#x9053;&#xFF08;Channel&#xFF09;&#x548C;&#x7F13;&#x51B2;&#x533A;&#xFF08;Buffer&#xFF09;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x6570;&#x636E;&#x603B;&#x662F;&#x4ECE;&#x901A;&#x9053;&#x8BFB;&#x53D6;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x7F13;&#x51B2;&#x533A;&#x5199;&#x5165;&#x5230;&#x901A;&#x9053;&#x4E2D;&#x3002;<br>Asynchronous IO&#xFF08;&#x5F02;&#x6B65;IO&#xFF09;&#xFF1A;Java NIO&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5F02;&#x6B65;&#x7684;&#x4F7F;&#x7528;IO&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x5F53;&#x7EBF;&#x7A0B;&#x4ECE;&#x901A;&#x9053;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x65F6;&#xFF0C;&#x7EBF;&#x7A0B;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#x3002;&#x5F53;&#x6570;&#x636E;&#x88AB;&#x5199;&#x5165;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x65F6;&#xFF0C;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x5B83;&#x3002;&#x4ECE;&#x7F13;&#x51B2;&#x533A;&#x5199;&#x5165;&#x901A;&#x9053;&#x4E5F;&#x7C7B;&#x4F3C;&#x3002;<br>Selectors&#xFF08;&#x9009;&#x62E9;&#x5668;&#xFF09;&#xFF1A;Java NIO&#x5F15;&#x5165;&#x4E86;&#x9009;&#x62E9;&#x5668;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x9009;&#x62E9;&#x5668;&#x7528;&#x4E8E;&#x76D1;&#x542C;&#x591A;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x4E8B;&#x4EF6;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;&#x8FDE;&#x63A5;&#x6253;&#x5F00;&#xFF0C;&#x6570;&#x636E;&#x5230;&#x8FBE;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5355;&#x4E2A;&#x7684;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x76D1;&#x542C;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x901A;&#x9053;&#x3002;</p>
</li>
<li><p>&#x4F7F;&#x7528;&#x573A;&#x666F;<br>NIO<br>&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x901A;&#x9053;&#xFF1B;&#x4F46;&#x662F;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#x5C06;&#x4F1A;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF1B;<br>&#x5982;&#x679C;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x540C;&#x65F6;&#x6253;&#x5F00;&#x7684;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x6BCF;&#x6B21;&#x53EA;&#x662F;&#x53D1;&#x9001;&#x5C11;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#xFF1B;<br>&#x4F20;&#x7EDF;&#x7684;IO<br>&#x9002;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7BA1;&#x7406;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x60C5;&#x51B5;&#xFF1B;&#x56E0;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x6D41;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x53D6;&#x662F;&#x963B;&#x585E;&#x7684;&#xFF1B;<br>&#x5982;&#x679C;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x540C;&#x65F6;&#x6253;&#x5F00;&#x4E0D;&#x592A;&#x591A;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x4F1A;&#x53D1;&#x9001;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF1B;</p>
</li>
<li><p>NIO vs IO&#x533A;&#x522B;<br>NIO vs IO&#x4E4B;&#x95F4;&#x7684;&#x7406;&#x5FF5;&#x4E0A;&#x9762;&#x7684;&#x533A;&#x522B;&#xFF08;NIO&#x5C06;&#x963B;&#x585E;&#x4EA4;&#x7ED9;&#x4E86;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#xFF09;<br>IO&#x662F;&#x9762;&#x5411;&#x6D41;&#x7684;&#xFF0C;NIO&#x662F;&#x9762;&#x5411;&#x7F13;&#x51B2;&#x533A;&#x7684;<br>Java IO&#x9762;&#x5411;&#x6D41;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x6B21;&#x4ECE;&#x6D41;&#x4E2D;&#x8BFB;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x76F4;&#x81F3;&#x8BFB;&#x53D6;&#x6240;&#x6709;&#x5B57;&#x8282;&#xFF0C;&#x5B83;&#x4EEC;&#x6CA1;&#x6709;&#x88AB;&#x7F13;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#xFF1B;<br>NIO&#x5219;&#x80FD;&#x524D;&#x540E;&#x79FB;&#x52A8;&#x6D41;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x9762;&#x5411;&#x7F13;&#x51B2;&#x533A;&#x7684;<br>IO&#x6D41;&#x662F;&#x963B;&#x585E;&#x7684;&#xFF0C;NIO&#x6D41;&#x662F;&#x4E0D;&#x963B;&#x585E;&#x7684;<br>Java IO&#x7684;&#x5404;&#x79CD;&#x6D41;&#x662F;&#x963B;&#x585E;&#x7684;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;read() &#x6216; write()&#x65F6;&#xFF0C;&#x8BE5;&#x7EBF;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x88AB;&#x8BFB;&#x53D6;&#xFF0C;&#x6216;&#x6570;&#x636E;&#x5B8C;&#x5168;&#x5199;&#x5165;&#x3002;&#x8BE5;&#x7EBF;&#x7A0B;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x4E0D;&#x80FD;&#x518D;&#x5E72;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x4E86;<br>Java NIO&#x7684;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF0C;&#x4F7F;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4ECE;&#x67D0;&#x901A;&#x9053;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EC5;&#x80FD;&#x5F97;&#x5230;&#x76EE;&#x524D;&#x53EF;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x76EE;&#x524D;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x5C31;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x4F1A;&#x83B7;&#x53D6;&#x3002;NIO&#x53EF;&#x8BA9;&#x60A8;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#xFF08;&#x6216;&#x51E0;&#x4E2A;&#xFF09;&#x5355;&#x7EBF;&#x7A0B;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x901A;&#x9053;&#xFF08;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x6216;&#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x4F46;&#x4ED8;&#x51FA;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x89E3;&#x6790;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4F1A;&#x6BD4;&#x4ECE;&#x4E00;&#x4E2A;&#x963B;&#x585E;&#x6D41;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x66F4;&#x590D;&#x6742;&#x3002;<br>&#x975E;&#x963B;&#x585E;&#x5199;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BF7;&#x6C42;&#x5199;&#x5165;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5230;&#x67D0;&#x901A;&#x9053;&#xFF0C;&#x4F46;&#x4E0D;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x5B83;&#x5B8C;&#x5168;&#x5199;&#x5165;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x53BB;&#x505A;&#x522B;&#x7684;&#x4E8B;&#x60C5;&#x3002;<br>&#x9009;&#x62E9;&#x5668;<br>Java NIO&#x7684;&#x9009;&#x62E9;&#x5668;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x6765;&#x76D1;&#x89C6;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x901A;&#x9053;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6CE8;&#x518C;&#x591A;&#x4E2A;&#x901A;&#x9053;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x6765;&#x201C;&#x9009;&#x62E9;&#x201D;&#x901A;&#x9053;&#xFF1A;&#x8FD9;&#x4E9B;&#x901A;&#x9053;&#x91CC;&#x5DF2;&#x7ECF;&#x6709;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x6216;&#x8005;&#x9009;&#x62E9;&#x5DF2;&#x51C6;&#x5907;&#x5199;&#x5165;&#x7684;&#x901A;&#x9053;&#x3002;&#x8FD9;&#x79CD;&#x9009;&#x62E9;&#x673A;&#x5236;&#xFF0C;&#x4F7F;&#x5F97;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x5F88;&#x5BB9;&#x6613;&#x6765;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x901A;&#x9053;&#x3002; </p>
</li>
</ul>
</blockquote>
<p>###13.&#x4EC0;&#x4E48;&#x662F;&#x7ADE;&#x6001;&#x6761;&#x4EF6;&#xFF1F;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;<br>&#x5F53;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#x540C;&#x4E00;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;&#x987A;&#x5E8F;&#x654F;&#x611F;&#xFF0C;&#x5C31;&#x79F0;&#x5B58;&#x5728;&#x7ADE;&#x6001;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x5BFC;&#x81F4;&#x7ADE;&#x6001;&#x6761;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x4EE3;&#x7801;&#x533A;&#x79F0;&#x4F5C;&#x4E34;&#x754C;&#x533A;&#x3002;</p>
<p>&#x5728;&#x4E34;&#x754C;&#x533A;&#x4E2D;&#x4F7F;&#x7528;&#x9002;&#x5F53;&#x7684;&#x540C;&#x6B65;&#x5C31;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7ADE;&#x6001;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x4E34;&#x754C;&#x533A;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x6709;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x7528;synchronized&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x7528;Lock&#x663E;&#x5F0F;&#x9501;&#x5B9E;&#x73B0;&#x3002;</p>
<figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Counter</span> </span>{ </span><br><span class="line">    <span class="keyword">protected</span> <span class="keyword">long</span> count = <span class="number">0</span>; </span><br><span class="line">    <span class="function"><span class="keyword">public</span> <span class="keyword">void</span> <span class="title">add</span><span class="params">(<span class="keyword">long</span> value)</span> </span>{ </span><br><span class="line">        <span class="keyword">this</span>.count = <span class="keyword">this</span>.count + value; </span><br><span class="line">    } </span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p> &#x89C2;&#x5BDF;&#x7EBF;&#x7A0B;A&#x548C;B&#x4EA4;&#x9519;&#x6267;&#x884C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF0C;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5206;&#x522B;&#x52A0;&#x4E86;2&#x548C;3&#x5230;count&#x53D8;&#x91CF;&#x4E0A;&#xFF0C;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7ED3;&#x675F;&#x540E;count&#x53D8;&#x91CF;&#x7684;&#x503C;&#x5E94;&#x8BE5;&#x7B49;&#x4E8E;5&#x3002;&#x7136;&#x800C;&#x7531;&#x4E8E;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x662F;&#x4EA4;&#x53C9;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x51FA;&#x7684;&#x521D;&#x59CB;&#x503C;&#x90FD;&#x662F;0&#x3002;&#x7136;&#x540E;&#x5404;&#x81EA;&#x52A0;&#x4E86;2&#x548C;3&#xFF0C;&#x5E76;&#x5206;&#x522B;&#x5199;&#x56DE;&#x5185;&#x5B58;&#x3002;&#x6700;&#x7EC8;&#x7684;&#x503C;&#x5E76;&#x4E0D;&#x662F;&#x671F;&#x671B;&#x7684;5&#xFF0C;&#x800C;&#x662F;&#x6700;&#x540E;&#x5199;&#x56DE;&#x5185;&#x5B58;&#x7684;&#x90A3;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x503C;&#xFF0C;&#x4E0A;&#x9762;&#x4F8B;&#x5B50;&#x4E2D;&#x6700;&#x540E;&#x5199;&#x56DE;&#x5185;&#x5B58;&#x7684;&#x662F;&#x7EBF;&#x7A0B;A&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E2D;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x7EBF;&#x7A0B;B&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x91C7;&#x7528;&#x5408;&#x9002;&#x7684;&#x540C;&#x6B65;&#x673A;&#x5236;&#xFF0C;&#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x4EA4;&#x53C9;&#x6267;&#x884C;&#x60C5;&#x51B5;&#x5C31;&#x65E0;&#x6CD5;&#x9884;&#x6599;&#x3002;<br>add()&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E34;&#x754C;&#x533A;,&#x5B83;&#x4F1A;&#x4EA7;&#x751F;&#x7ADE;&#x6001;&#x6761;&#x4EF6;&#x3002;</p>
<p>###14.JVM JRE JDK JIT&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;<br>java&#x865A;&#x62DF;&#x673A;(JVM)<br>    &#x4F7F;&#x7528;java&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x4E3B;&#x8981;&#x4F18;&#x52BF;&#x5C31;&#x662F;&#x5E73;&#x53F0;&#x7684;&#x72EC;&#x7ACB;&#x6027;&#x3002;&#x4F60;&#x66FE;&#x7ECF;&#x60F3;&#x77E5;&#x9053;&#x8FC7;java&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x5E73;&#x53F0;&#x7684;&#x72EC;&#x7ACB;&#x6027;&#x5417;&#xFF1F;&#x5BF9;&#xFF0C;&#x5C31;&#x662F;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x5B83;&#x62BD;&#x8C61;&#x5316;&#x4E86;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x5F97;&#x4EE5;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x865A;&#x62DF;&#x673A;&#x7684;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x5904;&#x7406;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4EA4;&#x6D41;&#x3002;java&#x4E0D;&#x540C;&#x7684;&#x63A5;&#x53E3;&#x89C4;&#x8303;&#x5BF9;&#x4EFB;&#x4F55;&#x5E73;&#x53F0;&#x90FD;&#x6709;&#x826F;&#x597D;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x56E0;&#x4E3A;jvm&#x5F88;&#x597D;&#x7684;&#x5B9E;&#x73B0;&#x4E86;&#x6BCF;&#x4E2A;&#x5E73;&#x53F0;&#x7684;&#x89C4;&#x8303;&#x3002;jvm&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4F2A;&#x4EE3;&#x7801;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x5C42;&#x67A2;&#x7EBD;&#x3002;</p>
<p>java&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;(JRE)<br>    java&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#x662F;JVM&#x7684;&#x4E00;&#x4E2A;&#x8D85;&#x96C6;&#x3002;JVM&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x6216;&#x8005;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x660E;&#x786E;&#x7684;&#xFF0C;&#x800C;JRE&#x786E;&#x5B9E;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4ED6;&#x4EE3;&#x8868;&#x4E86;&#x5B8C;&#x6574;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#x3002;&#x6211;&#x4EEC;&#x5728;jre&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x6240;&#x6709;&#x7684;jar&#x6587;&#x4EF6;&#x548C;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x90FD;&#x4F1A;&#x53D8;&#x6210;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;JRE&#x53D8;&#x6210;&#x4E86;JVM&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x65F6;&#x5019;&#x4F7F;&#x7528;JRE&#xFF0C;&#x5BF9;&#x4E8E;&#x660E;&#x786E;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x4F7F;&#x7528;JVM&#x3002;&#x5F53;&#x4F60;&#x4E0B;&#x8F7D;&#x4E86;JRE&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5C31;&#x81EA;&#x52A8;&#x4E0B;&#x8F7D;&#x4E86;JVM&#x3002;</p>
<p>java&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x7BB1;(JDK)<br>    java&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x7BB1;&#x6307;&#x7684;&#x662F;&#x7F16;&#x5199;&#x4E00;&#x4E2A;java&#x5E94;&#x7528;&#x6240;&#x9700;&#x8981;&#x7684;&#x6240;&#x6709;jar&#x6587;&#x4EF6;&#x548C;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;JRE&#x662F;JKD&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0B;&#x8F7D;&#x4E86;JDK,&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x540D;&#x53EB;JRE&#x7684;&#x6587;&#x4EF6;&#x5939;&#x5728;&#x91CC;&#x9762;&#x3002;JDK&#x4E2D;&#x8981;&#x88AB;&#x7262;&#x8BB0;&#x7684;jar&#x6587;&#x4EF6;&#x5C31;&#x662F;tools.jar,&#x5B83;&#x5305;&#x542B;&#x4E86;&#x7528;&#x4E8E;&#x6267;&#x884C;java&#x6587;&#x6863;&#x7684;&#x7C7B;&#x8FD8;&#x6709;&#x7528;&#x4E8E;&#x7C7B;&#x7B7E;&#x540D;&#x7684;jar&#x5305;&#x3002;</p>
<p>&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;(JIT)<br>    &#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x662F;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x6709;&#x6548;&#x7684;&#x628A;&#x5B57;&#x8282;&#x7801;&#x53D8;&#x6210;&#x673A;&#x5668;&#x7801;&#x6765;&#x63D0;&#x9AD8;JVM&#x7684;&#x6548;&#x7387;&#x3002;JIT&#x8FD9;&#x79CD;&#x529F;&#x6548;&#x5F88;&#x7279;&#x6B8A;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x628A;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x76F8;&#x4F3C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x7F16;&#x8BD1;&#x6210;&#x5355;&#x4E00;&#x8FD0;&#x884C;&#x7684;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x4ECE;&#x800C;&#x8282;&#x7701;&#x4E86;CPU&#x7684;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x5B57;&#x8282;&#x7801;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x662F;&#x8FD0;&#x884C;&#x65F6;(&#x7B2C;&#x4E00;&#x7C7B;&#x6267;&#x884C;&#x7684;&#x7F16;&#x8BD1;&#xFF1F;)the firs of its kind to perform the compilation(&#x4ECE;&#x5B57;&#x8282;&#x7801;&#x5230;&#x673A;&#x5668;&#x7801;&#xFF09;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#x3002;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#xFF0C;&#x52A8;&#x6001;&#x7F16;&#x8BD1;&#x8FD9;&#x4E2A;&#x8BCD;&#x6C47;&#x624D;&#x548C;JIT&#x6709;&#x90A3;&#x4E48;&#x7D27;&#x5BC6;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>###15.MVC&#x5404;&#x4E2A; &#x90E8;&#x5206;&#x6709;&#x54EA;&#x4E9B;&#x6280;&#x672F;&#x5B9E;&#x73B0;<br>&#x89C6;&#x56FE;&#x5C42;&#x7528;jsp&#xFF0C;javascript<br>     &#x4F5C;&#x7528;&#x2013;&#x663E;&#x793A;&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x53D7;&#x7528;&#x6237;&#x8F93;&#x5165;&#x6570;&#x636E;<br>&#x63A7;&#x5236;&#x5C42;&#x7528;servlet<br>     &#x4F5C;&#x7528;&#x2013;&#x63A5;&#x6536;&#x89C6;&#x56FE;&#x5C42;&#x6570;&#x636E;&#xFF0C;&#x4F20;&#x8F93; &#x7ED9;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#xFF08;&#x5373;&#x6A21;&#x578B;&#x5C42;&#xFF09;<br>&#x6A21;&#x578B;&#x5C42;&#x7528;&#x666E;&#x901A;java class<br>     &#x4F5C;&#x7528;&#x2013;&#x4E1A;&#x52A1;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5982;&#xFF1A;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;</p>
<p>M(DAO)&#x5C42;,&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x540E;&#x53F0;&#xFF0C;</p>
<p>V(jsp),&#x76F8;&#x5F53;&#x4E8E;&#x524D;&#x53F0;&#xFF0C;</p>
<p>C(control)&#x5C42;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x63A7;&#x5236;&#x9875;&#x9762;&#x8DF3;&#x8F6C;&#xFF1B;</p>
<p>MVC&#x6A21;&#x5F0F;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x5B9E;&#x73B0;Web&#x7CFB;&#x7EDF;&#x7684;&#x804C;&#x80FD;&#x5206;&#x5DE5;&#x3002;<br>Model&#x5C42;&#x5B9E;&#x73B0;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x7528;JavaBean&#x6216;EJB&#x6765;&#x5B9E;&#x73B0;&#x3002;<br>View&#x5C42;&#x7528;&#x4E8E;&#x4E0E;&#x7528;&#x6237;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x901A;&#x5E38;&#x7528;JSP&#x6765;&#x5B9E;&#x73B0;&#x3002;<br>Controller&#x5C42;&#x662F;Model&#x4E0E;View&#x4E4B;&#x95F4;&#x6C9F;&#x901A;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5206;&#x6D3E;&#x7528;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x5E76;&#x9009;&#x62E9;&#x6070;&#x5F53;&#x7684;&#x89C6;&#x56FE;&#x4EE5;&#x7528;&#x4E8E;&#x663E;&#x793A;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x7528;&#x6237;&#x7684;&#x8F93;&#x5165;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x6620;&#x5C04;&#x4E3A;&#x6A21;&#x578B;&#x5C42;&#x53EF;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>M&#xFF1A;hibernate&#x3001;mybatis&#x3001;ibatis<br>C&#xFF1A;severlet&#x3001;struts&#x3001;spring&#x3001;action<br>V&#xFF1A;jsp&#x3001;FreeMarker&#x3001;tails&#x3001;taglib&#x3001;EL&#x3001;Velocity</p>
<p>###16.Java RMI&#x4E0E;RPC&#x7684;&#x533A;&#x522B;<br>&#x4E00;&#xFF1A;RPC &#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;</p>
<p> RPC&#xFF08;Remote Procedure Call Protocol&#xFF09;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x534F;&#x8BAE;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4ECE;&#x8FDC;&#x7A0B;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8BF7;&#x6C42;&#x8C03;&#x7528;&#x67D0;&#x79CD;&#x670D;&#x52A1;&#x3002;</p>
<p> &#x4E00;&#x6B21;RPC&#x8C03;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x5927;&#x6982;&#x6709;10&#x6B65;&#xFF1A;</p>
<p>&#x3000;&#x3000;1.&#x6267;&#x884C;&#x5BA2;&#x6237;&#x7AEF;&#x8C03;&#x7528;&#x8BED;&#x53E5;&#xFF0C;&#x4F20;&#x9001;&#x53C2;&#x6570;</p>
<p>&#x3000;&#x3000;2.&#x8C03;&#x7528;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x53D1;&#x9001;&#x7F51;&#x7EDC;&#x6D88;&#x606F;</p>
<p>&#x3000;&#x3000;3.&#x6D88;&#x606F;&#x4F20;&#x9001;&#x5230;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;</p>
<p>&#x3000;&#x3000;4.&#x670D;&#x52A1;&#x5668;&#x5F97;&#x5230;&#x6D88;&#x606F;&#x5E76;&#x53D6;&#x5F97;&#x53C2;&#x6570; </p>
<p>&#x3000;&#x3000;5.&#x6839;&#x636E;&#x8C03;&#x7528;&#x8BF7;&#x6C42;&#x4EE5;&#x53CA;&#x53C2;&#x6570;&#x6267;&#x884C;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#xFF08;&#x670D;&#x52A1;&#xFF09;</p>
<p>&#x3000;&#x3000;6.&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x5B8C;&#x6BD5;&#xFF0C;&#x5C06;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x670D;&#x52A1;&#x5668;&#x53E5;&#x67C4;</p>
<p>&#x3000;&#x3000;7.&#x670D;&#x52A1;&#x5668;&#x53E5;&#x67C4;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;&#x8C03;&#x7528;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x7684;&#x7CFB;&#x7EDF;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x53D1;&#x9001;&#x7ED3;&#x679C;</p>
<p>&#x3000;&#x3000;8.&#x6D88;&#x606F;&#x4F20;&#x56DE;&#x672C;&#x5730;&#x4E3B;&#x673A; </p>
<p>&#x3000;&#x3000;9.&#x5BA2;&#x6237;&#x7AEF;&#x53E5;&#x67C4;&#x7531;&#x672C;&#x5730;&#x4E3B;&#x673A;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x63A5;&#x6536;&#x6D88;&#x606F;</p>
<p>&#x3000;&#x3000;10.&#x5BA2;&#x6237;&#x7AEF;&#x63A5;&#x6536;&#x5230;&#x8C03;&#x7528;&#x8BED;&#x53E5;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x6570;&#x636E;</p>
<p> &#x4E8C;&#xFF1A;RMI &#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x8C03;&#x7528;</p>
<p> RMI:&#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x8C03;&#x7528;(Remote Method Invocation)&#x3002;&#x80FD;&#x591F;&#x8BA9;&#x5728;&#x5BA2;&#x6237;&#x7AEF;Java&#x865A;&#x62DF;&#x673A;&#x4E0A;&#x7684;&#x5BF9;&#x8C61;&#x50CF;&#x8C03;&#x7528;&#x672C;&#x5730;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#x8C03;&#x7528;&#x670D;&#x52A1;&#x7AEF;java &#x865A;&#x62DF;&#x673A;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>RMI&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x6B65;&#x9AA4;&#xFF1A;</p>
<p>1&#xFF0C;&#x5BA2;&#x6237;&#x8C03;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;stub&#x4E0A;&#x7684;&#x65B9;&#x6CD5;</p>
<p>2&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;stub&#x6253;&#x5305;&#x8C03;&#x7528;&#x4FE1;&#x606F;&#xFF08;&#x53D8;&#x91CF;&#xFF0C;&#x65B9;&#x6CD5;&#x540D;&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x7ED9;&#x670D;&#x52A1;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;skeleton</p>
<p>3&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;skeleton&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;&#x53D1;&#x9001;&#x6765;&#x7684;&#x4FE1;&#x606F;&#x89E3;&#x5305;&#xFF0C;&#x627E;&#x51FA;&#x771F;&#x6B63;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;&#x8BE5;&#x65B9;&#x6CD5;&#x6240;&#x5728;&#x5BF9;&#x8C61;</p>
<p>4&#xFF0C;&#x8C03;&#x7528;&#x771F;&#x6B63;&#x670D;&#x52A1;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x771F;&#x6B63;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x7ED9;&#x670D;&#x52A1;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;skeleton</p>
<p>5&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;&#x5C06;&#x7ED3;&#x679C;&#x6253;&#x5305;&#xFF0C;&#x53D1;&#x9001;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;stub</p>
<p>6&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8F85;&#x52A9;&#x5BF9;&#x8C61;&#x5C06;&#x8FD4;&#x56DE;&#x503C;&#x89E3;&#x5305;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x7528;&#x8005;</p>
<p>7&#xFF0C;&#x5BA2;&#x6237;&#x83B7;&#x5F97;&#x8FD4;&#x56DE;&#x503C;</p>
<p> &#x4E09;&#xFF1A;RPC&#x4E0E;RMI&#x7684;&#x533A;&#x522B;</p>
<p> 1&#xFF1A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF1A;</p>
<p> RMI&#x4E2D;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x7684;Stub&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x8FDC;&#x7A0B;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x3002;&#x6BCF;&#x4E2A;&#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x90FD;&#x5177;&#x6709;&#x65B9;&#x6CD5;&#x7B7E;&#x540D;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x76F8;&#x5339;&#x914D;&#x7684;&#x7B7E;&#x540D;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x8FD9;&#x4E2A;&#x8FDC;&#x7A0B;&#x63A5;&#x53E3;(stub)&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x65B0;&#x65B9;&#x6CD5;&#x5C31;&#x4E0D;&#x80FD;&#x88AB;RMI&#x5BA2;&#x6237;&#x65B9;&#x6240;&#x8C03;&#x7528;&#x3002;</p>
<p>  RPC&#x4E2D;&#x662F;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x534F;&#x8BAE;&#x5411;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x8BF7;&#x6C42;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x96C6;&#x548C;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x503C;&#xFF0C;&#x901A;&#x5E38;&#x5F62;&#x6210;&#x201C;classname.methodname(&#x53C2;&#x6570;&#x96C6;)&#x201D;&#x7684;&#x5F62;&#x5F0F;&#x3002;RPC&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x5C31;&#x53BB;&#x641C;&#x7D22;&#x4E0E;&#x4E4B;&#x76F8;&#x5339;&#x914D;&#x7684;&#x7C7B;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x627E;&#x5230;&#x540E;&#x5C31;&#x6267;&#x884C;&#x65B9;&#x6CD5;&#x5E76;&#x628A;&#x7ED3;&#x679C;&#x7F16;&#x7801;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x53D1;&#x56DE;&#x3002;</p>
<p>  2&#xFF1A;&#x9002;&#x7528;&#x8BED;&#x8A00;&#x8303;&#x56F4;&#x4E0D;&#x540C;&#xFF1A;</p>
<p>   RMI&#x53EA;&#x7528;&#x4E8E;Java,&#x91C7;&#x7528;tcp/ip&#x534F;&#x8BAE;&#xFF1B;</p>
<p>   RPC&#x662F;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x534F;&#x8BAE;&#xFF0C;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x8BED;&#x8A00;&#x65E0;&#x5173;,&#x91C7;&#x7528;http&#x534F;&#x8BAE;</p>
<p>  3&#xFF1A;&#x8C03;&#x7528;&#x7ED3;&#x679C;&#x7684;&#x8FD4;&#x56DE;&#x5F62;&#x5F0F;&#x4E0D;&#x540C;&#xFF1A;</p>
<pre><code>Java&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;&#x6240;&#x4EE5;RMI&#x7684;&#x8C03;&#x7528;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x662F;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x6216;&#x8005;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1B;

RPC&#x7684;&#x7ED3;&#x679C;&#x7EDF;&#x4E00;&#x7531;&#x5916;&#x90E8;&#x6570;&#x636E;&#x8868;&#x793A; (External Data Representation, XDR) &#x8BED;&#x8A00;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#x62BD;&#x8C61;&#x4E86;&#x5B57;&#x8282;&#x5E8F;&#x7C7B;&#x548C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7ED3;&#x6784;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x4E0D;&#x652F;&#x6301;&#x5BF9;&#x8C61;
</code></pre><p>4.RMI&#x53EA;&#x9650;&#x4E8E;JAVA&#x8BED;&#x97F3;&#xFF0C;RPC&#x8DE8;&#x8BED;&#x8A00;</p>
<p>###17.&#x7B80;&#x8FF0;&#x4EC0;&#x4E48;&#x662F;Web&#x670D;&#x52A1;&#xFF08;Web Service&#xFF09;&#x6280;&#x672F;&#xFF1F;<br>1.WebService&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;<br>&#x4E00;&#x8A00;&#x4EE5;&#x853D;&#x4E4B;&#xFF1A;WebService&#x662F;&#x4E00;&#x79CD;&#x8DE8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x8DE8;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E73;&#x53F0;&#x7684;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#x6280;&#x672F;&#x3002;</p>
<p>   &#x6240;&#x8C13;&#x8DE8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x8DE8;&#x64CD;&#x4F5C;&#x5E73;&#x53F0;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x670D;&#x52A1;&#x7AEF;&#x7A0B;&#x5E8F;&#x91C7;&#x7528;java&#x7F16;&#x5199;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#x5219;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#xFF01;&#x8DE8;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E73;&#x53F0;&#x5219;&#x662F;&#x6307;&#x670D;&#x52A1;&#x7AEF;&#x7A0B;&#x5E8F;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>
<pre><code>&#x6240;&#x8C13;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;a&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;b&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8B6C;&#x5982;&#xFF0C;&#x94F6;&#x8054;&#x63D0;&#x4F9B;&#x7ED9;&#x5546;&#x573A;&#x7684;pos&#x5237;&#x5361;&#x7CFB;&#x7EDF;&#xFF0C;&#x5546;&#x573A;&#x7684;POS&#x673A;&#x8F6C;&#x8D26;&#x8C03;&#x7528;&#x7684;&#x8F6C;&#x8D26;&#x65B9;&#x6CD5;&#x7684;&#x4EE3;&#x7801;&#x5176;&#x5B9E;&#x662F;&#x8DD1;&#x5728;&#x94F6;&#x884C;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x518D;&#x6BD4;&#x5982;&#xFF0C;amazon&#xFF0C;&#x5929;&#x6C14;&#x9884;&#x62A5;&#x7CFB;&#x7EDF;&#xFF0C;&#x6DD8;&#x5B9D;&#x7F51;&#xFF0C;&#x6821;&#x5185;&#x7F51;&#xFF0C;&#x767E;&#x5EA6;&#x7B49;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x4EE5;webservice&#x670D;&#x52A1;&#x7684;&#x5F62;&#x5F0F;&#x66B4;&#x9732;&#x51FA;&#x6765;&#xFF0C;&#x8BA9;&#x7B2C;&#x4E09;&#x65B9;&#x7F51;&#x7AD9;&#x548C;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x6837;&#x6269;&#x5C55;&#x4E86;&#x81EA;&#x5DF1;&#x7CFB;&#x7EDF;&#x7684;&#x5E02;&#x573A;&#x5360;&#x6709;&#x7387;&#xFF0C;&#x5F80;&#x5927;&#x7684;&#x6982;&#x5FF5;&#x4E0A;&#x5439;&#xFF0C;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;SOA&#x5E94;&#x7528;&#x3002;
</code></pre><p>   &#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x4ECE;&#x591A;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x7406;&#x89E3;WebService&#xFF0C;&#x4ECE;&#x8868;&#x9762;&#x4E0A;&#x770B;&#xFF0C;WebService&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5411;&#x5916;&#x754C;&#x66B4;&#x9732;&#x51FA;&#x4E00;&#x4E2A;&#x80FD;&#x901A;&#x8FC7;Web&#x8FDB;&#x884C;&#x8C03;&#x7528;&#x7684;API&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x80FD;&#x7528;&#x7F16;&#x7A0B;&#x7684;&#x65B9;&#x6CD5;&#x901A;&#x8FC7;Web&#x6765;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;WebService&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EB;&#x505A;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x800C;&#x628A;&#x63D0;&#x4F9B;&#x8FD9;&#x4E2A;WebService&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EB;&#x505A;&#x670D;&#x52A1;&#x7AEF;&#x3002;&#x4ECE;&#x6DF1;&#x5C42;&#x6B21;&#x770B;&#xFF0C;WebService&#x662F;&#x5EFA;&#x7ACB;&#x53EF;&#x4E92;&#x64CD;&#x4F5C;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B0;&#x5E73;&#x53F0;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x662F;&#x4E00;&#x5957;&#x6807;&#x51C6;&#x3002;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x5728;Web&#x4E0A;&#x5B9E;&#x73B0;&#x4E92;&#x64CD;&#x4F5C;&#x6027;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x4F55;&#x4F60;&#x559C;&#x6B22;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x4F60;&#x559C;&#x6B22;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x5199;Web service &#xFF0C;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Web service&#x6807;&#x51C6;&#x5BF9;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x548C;&#x8BBF;&#x95EE;&#x3002; </p>
<p>   WebService&#x5E73;&#x53F0;&#x9700;&#x8981;&#x4E00;&#x5957;&#x534F;&#x8BAE;&#x6765;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x521B;&#x5EFA;&#x3002;&#x4EFB;&#x4F55;&#x5E73;&#x53F0;&#x90FD;&#x6709;&#x5B83;&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x548C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x3002;&#x8981;&#x5B9E;&#x73B0;&#x4E92;&#x64CD;&#x4F5C;&#x6027;&#xFF0C;WebService&#x5E73;&#x53F0;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x4E00;&#x5957;&#x6807;&#x51C6;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x7528;&#x4E8E;&#x6C9F;&#x901A;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x3001;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x7EC4;&#x4EF6;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x3002;Web service&#x5E73;&#x53F0;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x6807;&#x51C6;&#x6765;&#x63CF;&#x8FF0;Web service&#xFF0C;&#x8BA9;&#x5BA2;&#x6237;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;Web service&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x5BF9;&#x8FD9;&#x4E2A;Web service&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x8C03;&#x7528;,&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5B9E;&#x9645;&#x662F;&#x4E00;&#x79CD;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x534F;&#x8BAE;(RPC)&#x3002;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x4E92;&#x64CD;&#x4F5C;&#x6027;&#xFF0C;&#x8FD9;&#x79CD;RPC&#x534F;&#x8BAE;&#x8FD8;&#x5FC5;&#x987B;&#x4E0E;&#x5E73;&#x53F0;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#x3002;</p>
<p>2.WebService&#x5E73;&#x53F0;&#x6280;&#x672F;<br>XML+XSD,SOAP&#x548C;WSDL&#x5C31;&#x662F;&#x6784;&#x6210;WebService&#x5E73;&#x53F0;&#x7684;&#x4E09;&#x5927;&#x6280;&#x672F;&#x3002;</p>
<p>XML+XSD&#xFF1A;</p>
<p>  WebService&#x91C7;&#x7528;HTTP&#x534F;&#x8BAE;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF0C;&#x91C7;&#x7528;XML&#x683C;&#x5F0F;&#x5C01;&#x88C5;&#x6570;&#x636E;&#xFF08;&#x5373;XML&#x4E2D;&#x8BF4;&#x660E;&#x8C03;&#x7528;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5BF9;&#x8C61;&#x7684;&#x54EA;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x4F20;&#x9012;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x670D;&#x52A1;&#x5BF9;&#x8C61;&#x7684;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x662F;&#x4EC0;&#x4E48;&#xFF09;&#x3002;XML&#x662F;WebService&#x5E73;&#x53F0;&#x4E2D;&#x8868;&#x793A;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;&#x3002;&#x9664;&#x4E86;&#x6613;&#x4E8E;&#x5EFA;&#x7ACB;&#x548C;&#x6613;&#x4E8E;&#x5206;&#x6790;&#x5916;&#xFF0C;XML&#x4E3B;&#x8981;&#x7684;&#x4F18;&#x70B9;&#x5728;&#x4E8E;&#x5B83;&#x65E2;&#x662F;&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x7684;&#xFF0C;&#x53C8;&#x662F;&#x5382;&#x5546;&#x65E0;&#x5173;&#x7684;&#x3002;&#x65E0;&#x5173;&#x6027;&#x662F;&#x6BD4;&#x6280;&#x672F;&#x4F18;&#x8D8A;&#x6027;&#x66F4;&#x91CD;&#x8981;&#x7684;&#xFF1A;&#x8F6F;&#x4EF6;&#x5382;&#x5546;&#x662F;&#x4E0D;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x7531;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x6240;&#x53D1;&#x660E;&#x7684;&#x6280;&#x672F;&#x7684;&#x3002; </p>
<p>  XML&#x89E3;&#x51B3;&#x4E86;&#x6570;&#x636E;&#x8868;&#x793A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5B83;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x4E00;&#x5957;&#x6807;&#x51C6;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x8BF4;&#x600E;&#x4E48;&#x53BB;&#x6269;&#x5C55;&#x8FD9;&#x5957;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6574;&#x5F62;&#x6570;&#x5230;&#x5E95;&#x4EE3;&#x8868;&#x4EC0;&#x4E48;&#xFF1F;16&#x4F4D;&#xFF0C;32&#x4F4D;&#xFF0C;64&#x4F4D;&#xFF1F;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x5BF9;&#x5B9E;&#x73B0;&#x4E92;&#x64CD;&#x4F5C;&#x6027;&#x5F88;&#x91CD;&#x8981;&#x3002;XML Schema(XSD)&#x5C31;&#x662F;&#x4E13;&#x95E8;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x5957;&#x6807;&#x51C6;&#x3002;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x5957;&#x6807;&#x51C6;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x6765;&#x6269;&#x5C55;&#x8FD9;&#x5957;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;WebService&#x5E73;&#x53F0;&#x5C31;&#x662F;&#x7528;XSD&#x6765;&#x4F5C;&#x4E3A;&#x5176;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x7528;&#x67D0;&#x79CD;&#x8BED;&#x8A00;(&#x5982;VB.NET&#x6216;C#)&#x6765;&#x6784;&#x9020;&#x4E00;&#x4E2A;Web service&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x7B26;&#x5408;WebService&#x6807;&#x51C6;&#xFF0C;&#x6240;&#x6709;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x90FD;&#x5FC5;&#x987B;&#x88AB;&#x8F6C;&#x6362;&#x4E3A;XSD&#x7C7B;&#x578B;&#x3002;&#x4F60;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x81EA;&#x52A8;&#x5E2E;&#x4F60;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x4E2A;&#x8F6C;&#x6362;&#xFF0C;&#x4F46;&#x4F60;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x6839;&#x636E;&#x4F60;&#x7684;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>SOAP&#xFF1A;</p>
<p>   WebService&#x901A;&#x8FC7;HTTP&#x534F;&#x8BAE;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x548C;&#x63A5;&#x6536;&#x7ED3;&#x679C;&#x65F6;&#xFF0C;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x5185;&#x5BB9;&#x548C;&#x7ED3;&#x679C;&#x5185;&#x5BB9;&#x90FD;&#x91C7;&#x7528;XML&#x683C;&#x5F0F;&#x5C01;&#x88C5;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7684;HTTP&#x6D88;&#x606F;&#x5934;&#xFF0C;&#x4EE5;&#x8BF4;&#x660E;HTTP&#x6D88;&#x606F;&#x7684;&#x5185;&#x5BB9;&#x683C;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x5B9A;&#x7684;HTTP&#x6D88;&#x606F;&#x5934;&#x548C;XML&#x5185;&#x5BB9;&#x683C;&#x5F0F;&#x5C31;&#x662F;SOAP&#x534F;&#x8BAE;&#x3002;SOAP&#x63D0;&#x4F9B;&#x4E86;&#x6807;&#x51C6;&#x7684;RPC&#x65B9;&#x6CD5;&#x6765;&#x8C03;&#x7528;Web Service&#x3002;</p>
<p>  SOAP&#x534F;&#x8BAE; = HTTP&#x534F;&#x8BAE; + XML&#x6570;&#x636E;&#x683C;&#x5F0F;</p>
<p>  SOAP&#x534F;&#x8BAE;&#x5B9A;&#x4E49;&#x4E86;SOAP&#x6D88;&#x606F;&#x7684;&#x683C;&#x5F0F;&#xFF0C;SOAP&#x534F;&#x8BAE;&#x662F;&#x57FA;&#x4E8E;HTTP&#x534F;&#x8BAE;&#x7684;&#xFF0C;SOAP&#x4E5F;&#x662F;&#x57FA;&#x4E8E;XML&#x548C;XSD&#x7684;&#xFF0C;XML&#x662F;SOAP&#x7684;&#x6570;&#x636E;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x3002;&#x6253;&#x4E2A;&#x6BD4;&#x55BB;&#xFF1A;HTTP&#x5C31;&#x662F;&#x666E;&#x901A;&#x516C;&#x8DEF;&#xFF0C;XML&#x5C31;&#x662F;&#x4E2D;&#x95F4;&#x7684;&#x7EFF;&#x8272;&#x9694;&#x79BB;&#x5E26;&#x548C;&#x4E24;&#x8FB9;&#x7684;&#x9632;&#x62A4;&#x680F;&#xFF0C;SOAP&#x5C31;&#x662F;&#x666E;&#x901A;&#x516C;&#x8DEF;&#x7ECF;&#x8FC7;&#x52A0;&#x9694;&#x79BB;&#x5E26;&#x548C;&#x9632;&#x62A4;&#x680F;&#x6539;&#x9020;&#x8FC7;&#x7684;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#x3002;</p>
<p>WSDL&#xFF1A;</p>
<p>   &#x597D;&#x6BD4;&#x6211;&#x4EEC;&#x53BB;&#x5546;&#x5E97;&#x4E70;&#x4E1C;&#x897F;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x77E5;&#x9053;&#x5546;&#x5E97;&#x91CC;&#x6709;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x53EF;&#x4E70;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6765;&#x8D2D;&#x4E70;&#xFF0C;&#x5546;&#x5BB6;&#x7684;&#x505A;&#x6CD5;&#x5C31;&#x662F;&#x5F20;&#x8D34;&#x5E7F;&#x544A;&#x6D77;&#x62A5;&#x3002; WebService&#x4E5F;&#x4E00;&#x6837;&#xFF0C;WebService&#x5BA2;&#x6237;&#x7AEF;&#x8981;&#x8C03;&#x7528;&#x4E00;&#x4E2A;WebService&#x670D;&#x52A1;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x6709;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x5730;&#x5740;&#x5728;&#x54EA;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x91CC;&#x6709;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;WebService&#x52A1;&#x5668;&#x7AEF;&#x9996;&#x5148;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;WSDL&#x6587;&#x4EF6;&#x6765;&#x8BF4;&#x660E;&#x81EA;&#x5DF1;&#x5BB6;&#x91CC;&#x6709;&#x5565;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x5BF9;&#x5916;&#x8C03;&#x7528;&#xFF0C;&#x670D;&#x52A1;&#x662F;&#x4EC0;&#x4E48;&#xFF08;&#x670D;&#x52A1;&#x4E2D;&#x6709;&#x54EA;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x4EC0;&#x4E48;&#xFF09;&#xFF0C;&#x670D;&#x52A1;&#x7684;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x7528;&#x54EA;&#x4E2A;url&#x5730;&#x5740;&#x8868;&#x793A;&#xFF0C;&#x670D;&#x52A1;&#x901A;&#x8FC7;&#x4EC0;&#x4E48;&#x65B9;&#x5F0F;&#x6765;&#x8C03;&#x7528;&#x3002;</p>
<p>   WSDL(Web Services Description Language)&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;XML&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;Web Service&#x53CA;&#x5176;&#x51FD;&#x6570;&#x3001;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x3002;&#x5B83;&#x662F;WebService&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x90FD;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x6807;&#x51C6;&#x683C;&#x5F0F;&#x3002;&#x56E0;&#x4E3A;&#x662F;&#x57FA;&#x4E8E;XML&#x7684;&#xFF0C;&#x6240;&#x4EE5;WSDL&#x65E2;&#x662F;&#x673A;&#x5668;&#x53EF;&#x9605;&#x8BFB;&#x7684;&#xFF0C;&#x53C8;&#x662F;&#x4EBA;&#x53EF;&#x9605;&#x8BFB;&#x7684;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x597D;&#x5904;&#x3002;&#x4E00;&#x4E9B;&#x6700;&#x65B0;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x65E2;&#x80FD;&#x6839;&#x636E;&#x4F60;&#x7684;Web service&#x751F;&#x6210;WSDL&#x6587;&#x6863;&#xFF0C;&#x53C8;&#x80FD;&#x5BFC;&#x5165;WSDL&#x6587;&#x6863;&#xFF0C;&#x751F;&#x6210;&#x8C03;&#x7528;&#x76F8;&#x5E94;WebService&#x7684;&#x4EE3;&#x7406;&#x7C7B;&#x4EE3;&#x7801;&#x3002;</p>
<p>  WSDL&#x6587;&#x4EF6;&#x4FDD;&#x5B58;&#x5728;Web&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;url&#x5730;&#x5740;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#x5B83;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x8981;&#x8C03;&#x7528;&#x4E00;&#x4E2A;WebService&#x670D;&#x52A1;&#x4E4B;&#x524D;&#xFF0C;&#x8981;&#x77E5;&#x9053;&#x8BE5;&#x670D;&#x52A1;&#x7684;WSDL&#x6587;&#x4EF6;&#x7684;&#x5730;&#x5740;&#x3002;WebService&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x66B4;&#x9732;&#x5B83;&#x7684;WSDL&#x6587;&#x4EF6;&#x5730;&#x5740;&#xFF1A;1.&#x6CE8;&#x518C;&#x5230;UDDI&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4EE5;&#x4FBF;&#x88AB;&#x4EBA;&#x67E5;&#x627E;&#xFF1B;2.&#x76F4;&#x63A5;&#x544A;&#x8BC9;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x8C03;&#x7528;&#x8005;&#x3002;</p>
<p>###18.WEB SERVICE&#x540D;&#x8BCD;&#x89E3;&#x91CA;&#x3002;JSWDL&#x5F00;&#x53D1;&#x5305;&#x7684;&#x4ECB;&#x7ECD;&#x3002;JAXP&#x3001;JAXM&#x7684;&#x89E3;&#x91CA;&#x3002;SOAP&#x3001;UDDI,WSDL&#x89E3;&#x91CA;&#x3002;<br>Web Service&#x662F;&#x57FA;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x6A21;&#x5757;&#x5316;&#x7EC4;&#x4EF6;&#xFF0C;&#x5B83;&#x6267;&#x884C;&#x7279;&#x5B9A;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x9075;&#x5B88;&#x5177;&#x4F53;&#x7684;&#x6280;&#x672F;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x4E9B;&#x89C4;&#x8303;&#x4F7F;&#x5F97;Web Service&#x80FD;&#x4E0E;&#x5176;&#x4ED6;&#x517C;&#x5BB9;&#x7684;&#x7EC4;&#x4EF6;&#x8FDB;&#x884C;&#x4E92;&#x64CD;&#x4F5C;&#x3002;<br>JAXP(Java API for XML Parsing) &#x5B9A;&#x4E49;&#x4E86;&#x5728;Java&#x4E2D;&#x4F7F;&#x7528;DOM, SAX, XSLT&#x7684;&#x901A;&#x7528;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x6837;&#x5728;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F60;&#x53EA;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x901A;&#x7528;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x6539;&#x53D8;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x65F6;&#x5019;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x3002;<br>JAXM(Java API for XML Messaging) &#x662F;&#x4E3A;SOAP&#x901A;&#x4FE1;&#x63D0;&#x4F9B;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;&#x548C;&#x4F20;&#x8F93;&#x673A;&#x5236;&#x7684;API&#x3002;<br>WSDL&#x662F;&#x4E00;&#x79CD; XML &#x683C;&#x5F0F;&#xFF0C;&#x7528;&#x4E8E;&#x5C06;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x4E3A;&#x4E00;&#x7EC4;&#x7AEF;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x7AEF;&#x70B9;&#x5BF9;&#x5305;&#x542B;&#x9762;&#x5411;&#x6587;&#x6863;&#x4FE1;&#x606F;&#x6216;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x4FE1;&#x606F;&#x7684;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#x9996;&#x5148;&#x5BF9;&#x64CD;&#x4F5C;&#x548C;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#x63CF;&#x8FF0;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x7ED1;&#x5B9A;&#x5230;&#x5177;&#x4F53;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x548C;&#x6D88;&#x606F;&#x683C;&#x5F0F;&#x4E0A;&#x4EE5;&#x5B9A;&#x4E49;&#x7AEF;&#x70B9;&#x3002;&#x76F8;&#x5173;&#x7684;&#x5177;&#x4F53;&#x7AEF;&#x70B9;&#x5373;&#x7EC4;&#x5408;&#x6210;&#x4E3A;&#x62BD;&#x8C61;&#x7AEF;&#x70B9;&#xFF08;&#x670D;&#x52A1;&#xFF09;&#x3002;<br>SOAP&#x5373;&#x7B80;&#x5355;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x534F;&#x8BAE;(Simple Object Access Protocol)&#xFF0C;&#x5B83;&#x662F;&#x7528;&#x4E8E;&#x4EA4;&#x6362;XML&#x7F16;&#x7801;&#x4FE1;&#x606F;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x534F;&#x8BAE;&#x3002;<br>UDDI &#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5EFA;&#x7ACB;&#x6807;&#x51C6;&#xFF1B;UDDI&#x662F;&#x4E00;&#x5957;&#x57FA;&#x4E8E;Web&#x7684;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x3001;&#x4E3A;Web Service&#x63D0;&#x4F9B;&#x7684;&#x3001;&#x4FE1;&#x606F;&#x6CE8;&#x518C;&#x4E2D;&#x5FC3;&#x7684;&#x5B9E;&#x73B0;&#x6807;&#x51C6;&#x89C4;&#x8303;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5305;&#x542B;&#x4E00;&#x7EC4;&#x4F7F;&#x4F01;&#x4E1A;&#x80FD;&#x5C06;&#x81EA;&#x8EAB;&#x63D0;&#x4F9B;&#x7684;Web Service&#x6CE8;&#x518C;&#xFF0C;&#x4EE5;&#x4F7F;&#x522B;&#x7684;&#x4F01;&#x4E1A;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x7684;&#x8BBF;&#x95EE;&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x73B0;&#x6807;&#x51C6;&#x3002;</p>
<p>###19.WEB&#x5BB9;&#x5668;&#x4E3B;&#x8981;&#x6709;&#x54EA;&#x4E9B;&#x529F;&#x80FD;? &#x5E76;&#x8BF7;&#x5217;&#x51FA;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7684;WEB&#x5BB9;&#x5668;&#x540D;&#x5B57;&#x3002;<br>Web&#x5BB9;&#x5668;&#x7ED9;&#x5904;&#x4E8E;&#x5176;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EC4;&#x4EF6;&#xFF08;JSP&#xFF0C;SERVLET&#xFF09;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#xFF0C;&#x4F7F;JSP,SERVLET&#x76F4;&#x63A5;&#x8DDF;&#x5BB9;&#x5668;&#x4E2D;&#x7684;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x4EA4;&#x4E92;&#xFF0C;&#x4E0D;&#x5FC5;&#x5173;&#x6CE8;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x95EE;&#x9898;&#x3002;&#x4E3B;&#x8981;&#x6709;WEB&#x670D;&#x52A1;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#xFF1A;TOMCAT,WEBLOGIC,WEBSPHERE&#x7B49;&#x3002;  </p>
<p>&#x5E38;&#x89C1;&#x7684;&#x6709;&#x5BB9;&#x5668;  Apache, IIS, Tomcat, Resin &#x7B49;&#x7B49;</p>
<p>###20.&#x4E00;&#x4E2A;&#x201D;.java&#x201D;&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7C7B;&#xFF08;&#x4E0D;&#x662F;&#x5185;&#x90E8;&#x7C7B;&#xFF09;&#xFF1F;&#x6709;&#x4EC0;&#x4E48;&#x9650;&#x5236;<br>&#x8FD9;&#x4E2A;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x201C;.java&#x201D;&#x6E90;&#x6587;&#x4EF6;&#x91CC;&#x9762;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7C7B;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x5141;&#x8BB8;&#x6709;&#x4E00;&#x4E2A;public&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x7C7B;&#x540D;&#x5FC5;&#x987B;&#x548C;&#x6587;&#x4EF6;&#x540D;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;public &#x7C7B;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x6BCF;&#x4E2A;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x516C;&#x5F00;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x5C31;&#x7531;&#x5176;public &#x7C7B;&#x6765;&#x8868;&#x793A;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#xFF0C;&#x5F80;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x91CC;&#x9762;&#x6DFB;&#x52A0;&#x4EFB;&#x610F;&#x591A;&#x4E2A;&#x63D0;&#x4F9B;&#x8F85;&#x52A9;&#x529F;&#x80FD;&#x7684;package &#x6743;&#x9650;&#x7684;&#x7C7B;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x91CC;&#x9762;&#x6709;&#x4E24;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;public &#x7C7B;&#x7684;&#x8BDD;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x54EA;&#x91CC;&#x5BFC;&#x5165;&#x4E86;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x4F1A;&#x62A5;&#x9519;&#x3002;</p>
<p>###21.&#x7B80;&#x5355;&#x8BF4;&#x8BF4;&#x4F60;&#x4E86;&#x89E3;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;&#x662F;&#x5426;&#x5B9E;&#x73B0;&#x8FC7;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;<br>&#x865A;&#x62DF;&#x673A;&#x8BBE;&#x8BA1;&#x56E2;&#x961F;&#x628A;&#x7C7B;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#x4E2D;&#x201C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5168;&#x9650;&#x5B9A;&#x540D;&#x6765;&#x83B7;&#x53D6;&#x63CF;&#x8FF0;&#x6B64;&#x7C7B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x8282;&#x6D41;&#x201D;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x653E;&#x5230;Java&#x865A;&#x62DF;&#x673A;&#x5916;&#x90E8;&#x53BB;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#x5982;&#x4F55;&#x53BB;&#x83B7;&#x53D6;&#x6240;&#x9700;&#x8981;&#x7684;&#x7C7B;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x7684;&#x6A21;&#x5757;&#x79F0;&#x4E3A;&#x201C;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x201D;&#x3002;</p>
<p>###22.&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x53EB;AOP&#xFF08;&#x9762;&#x5411;&#x5207;&#x9762;&#x7F16;&#x7A0B;&#xFF09;<br>&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x52A8;&#x6001;&#x5730;&#x5C06;&#x4EE3;&#x7801;&#x5207;&#x5165;&#x5230;&#x7C7B;&#x7684;&#x6307;&#x5B9A;&#x65B9;&#x6CD5;&#x3001;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x4E0A;&#x7684;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x9762;&#x5411;&#x5207;&#x9762;&#x7684;&#x7F16;&#x7A0B;&#x3002;</p>
<p>###23.&#x8BF7;&#x7B80;&#x8FF0; Servlet &#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x53CA;&#x5176;&#x76F8;&#x5173;&#x7684;&#x65B9;&#x6CD5;<br>Servlet &#x751F;&#x547D;&#x5468;&#x671F;&#xFF1A;Servlet &#x52A0;&#x8F7D;&#x2014;&gt;&#x5B9E;&#x4F8B;&#x5316;&#x2014;&gt;&#x670D;&#x52A1;&#x2014;&gt;&#x9500;&#x6BC1;&#x3002;</p>
<p>init&#xFF08;&#xFF09;&#xFF1A;&#x5728;Servlet&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#xFF0C;&#x4EC5;&#x6267;&#x884C;&#x4E00;&#x6B21;init()&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x662F;&#x5728;&#x670D;&#x52A1;&#x5668;&#x88C5;&#x5165;Servlet&#x65F6;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x8D1F;&#x8D23;&#x521D;&#x59CB;&#x5316;Servlet&#x5BF9;&#x8C61;&#x3002;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4EE5;&#x5728;&#x542F;&#x52A8;&#x670D;&#x52A1;&#x5668;&#x6216;&#x5BA2;&#x6237;&#x673A;&#x9996;&#x6B21;&#x8BBF;&#x95EE;Servlet&#x65F6;&#x88C5;&#x5165;Servlet&#x3002;&#x65E0;&#x8BBA;&#x6709;&#x591A;&#x5C11;&#x5BA2;&#x6237;&#x673A;&#x8BBF;&#x95EE;Servlet&#xFF0C;&#x90FD;&#x4E0D;&#x4F1A;&#x91CD;&#x590D;&#x6267;&#x884C;init&#xFF08;&#xFF09;&#x3002;</p>
<p>service&#xFF08;&#xFF09;&#xFF1A;&#x5B83;&#x662F;Servlet&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x8D1F;&#x8D23;&#x54CD;&#x5E94;&#x5BA2;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x8BF7;&#x6C42;&#x4E00;&#x4E2A;HttpServlet&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;Service()&#x65B9;&#x6CD5;&#x5C31;&#x8981;&#x8C03;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x4F20;&#x9012;&#x7ED9;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E00;&#x4E2A;&#x201C;&#x8BF7;&#x6C42;&#x201D;&#xFF08;ServletRequest&#xFF09;&#x5BF9;&#x8C61;&#x548C;&#x4E00;&#x4E2A;&#x201C;&#x54CD;&#x5E94;&#x201D;&#xFF08;ServletResponse&#xFF09;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;&#x5728;HttpServlet&#x4E2D;&#x5DF2;&#x5B58;&#x5728;Service()&#x65B9;&#x6CD5;&#x3002;&#x9ED8;&#x8BA4;&#x7684;&#x670D;&#x52A1;&#x529F;&#x80FD;&#x662F;&#x8C03;&#x7528;&#x4E0E;HTTP&#x8BF7;&#x6C42;&#x7684;&#x65B9;&#x6CD5;&#x76F8;&#x5E94;&#x7684;do&#x529F;&#x80FD;&#x3002;</p>
<p>destroy&#xFF08;&#xFF09;&#xFF1A; &#x4EC5;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x505C;&#x6B62;&#x4E14;&#x5378;&#x8F7D;Servlet&#x65F6;&#x6267;&#x884C;&#x8BE5;&#x65B9;&#x6CD5;&#x3002;&#x5F53;Servlet&#x5BF9;&#x8C61;&#x9000;&#x51FA;&#x751F;&#x547D;&#x5468;&#x671F;&#x65F6;&#xFF0C;&#x8D1F;&#x8D23;&#x91CA;&#x653E;&#x5360;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x4E00;&#x4E2A;Servlet&#x5728;&#x8FD0;&#x884C;service()&#x65B9;&#x6CD5;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x5176;&#x4ED6;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x786E;&#x8BA4;&#x5728;&#x8C03;&#x7528;destroy()&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x7EC8;&#x6B62;&#x6216;&#x5B8C;&#x6210;&#x3002;</p>
<p>###24.&#x8BF7;&#x7B80;&#x8FF0;&#x4E00;&#x4E0B; Ajax &#x7684;&#x539F;&#x7406;&#x53CA;&#x5B9E;&#x73B0;&#x6B65;&#x9AA4;<br>Ajax&#x7684;&#x539F;&#x7406;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x901A;&#x8FC7;XmlHttpRequest&#x5BF9;&#x8C61;&#x6765;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x5F02;&#x6B65;&#x8BF7;&#x6C42;&#xFF0C;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x5F97;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x7528;javascript&#x6765;&#x64CD;&#x4F5C;DOM&#x800C;&#x66F4;&#x65B0;&#x9875;&#x9762;&#x3002;</p>
<p>1&#x3001;&#x521B;&#x5EFA;XMLHttpRequest&#x5BF9;&#x8C61;(&#x9700;&#x8981;&#x8003;&#x8651;&#x5404;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x7684;&#x95EE;&#x9898;)</p>
<p>2&#x3001;&#x4F7F;&#x7528;XMLHttpRequest&#x5BF9;&#x8C61;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;(&#x6307;&#x5B9A;&#x8FDE;&#x63A5;&#x65B9;&#x5F0F;<post get="">&#x548C;&#x8FDE;&#x63A5;&#x5730;&#x5740;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x540C;&#x6B65;);&#x8C03;&#x7528;XMLHttpRequest&#x5BF9;&#x8C61;&#x7684;open&#x65B9;&#x6CD5;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x63D0;&#x4EA4;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53D6;&#x503C;&#x4E3A;post/get&#xFF1B;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x63D0;&#x4EA4;&#x7684;&#x76EE;&#x6807;&#x9875;&#x9762;(&#x4E5F;&#x5C31;&#x662F;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x63D0;&#x4EA4;&#x6570;&#x636E;&#x7684;&#x9875;&#x9762;)&#xFF1B;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x662F;&#x5426;&#x8BF7;&#x6C42;&#x662F;&#x5F02;&#x6B65;&#x7684;-&#x7F3A;&#x7701;&#x503C;&#x4E3A;true&#xFF0C;&#x4E3A;&#x4E86;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x8BF7;&#x6C42;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E3A;false&#x3002;</post></p>
<p>3&#x3001;&#x8BBE;&#x7F6E;&#x8BF7;&#x6C42;&#x7684;&#x5934;&#x90E8;(&#x8BF7;&#x6C42;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x8BF7;&#x6C42;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;)</p>
<p>4&#x3001;&#x8BBE;&#x7F6E;&#x56DE;&#x8C03;&#x51FD;&#x6570;</p>
<p>&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x4ECE;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x9001;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528;javascript&#x53BB;&#x8C03;&#x7528;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x670D;&#x52A1;&#x7AEF;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x53BB;&#x63A7;&#x5236;&#x9875;&#x9762;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x66F4;&#x65B0;&#x3002;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x5B9E;&#x9645;&#x4E0A;&#x662F;javascript&#x4E2D;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x673A;&#x5236;&#x3002;</p>
<p>5&#x3001;&#x53D1;&#x9001;&#x8BF7;&#x6C42;:&#x8C03;&#x7528;XMLHttpRequest&#x5BF9;&#x8C61;&#x7684;send&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x7684;&#x53D1;&#x9001;&#x3002;</p>
<p>6&#x3001;&#x66F4;&#x65B0;&#x9875;&#x9762;&#x663E;&#x793A;</p>
<p>###25.&#x7B80;&#x5355;&#x63CF;&#x8FF0;Struts&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;<br>struts2&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x628A;&#x8BF7;&#x6C42;&#x548C;&#x663E;&#x793A;&#x7684;&#x7ED3;&#x679C;&#x5206;&#x5F00;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;jsp&#x9875;&#x9762;</p>
<p>&#x62E6;&#x622A;&#x5668;&#x53EF;&#x4EE5;&#x8BF4;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF1A;&#x5C31;&#x662F;&#x628A; &#x4E0D;&#x60F3;&#x8981;&#x7684;&#x6216;&#x4E0D;&#x60F3;&#x663E;&#x793A;&#x7684;&#x5185;&#x5BB9;&#x7ED9;&#x8FC7;&#x6EE4;&#x6389;&#x3002;&#x62E6;&#x622A;&#x5668;&#x53EF;&#x4EE5;&#x62BD;&#x8C61;&#x51FA;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B8C;&#x5584;&#x539F;&#x6765;&#x7684;action&#x3002;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x51CF;&#x8F7B;&#x4EE3;&#x7801;&#x5197;&#x4F59;&#xFF0C;&#x63D0;&#x9AD8;&#x91CD;&#x7528;&#x7387;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x5728;&#x767B;&#x5165;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x6C42;&#x7528;&#x6237;&#x5BC6;&#x7801;&#x3001;&#x6743;&#x9650;&#x7B49;&#x7684;&#x9A8C;&#x8BC1;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x62E6;&#x622A;&#x5668;&#x8FDB;&#x884C;&#x5BC6;&#x7801;&#x9A8C;&#x8BC1;&#x548C;&#x6743;&#x9650;&#x9650;&#x5236;&#x3002;&#x5BF9;&#x7B26;&#x5408;&#x7684;&#x767B;&#x5165;&#x8005;&#x624D;&#x8DF3;&#x8F6C;&#x5230;&#x6B63;&#x786E;&#x9875;&#x9762;&#x3002;&#x8FD9;&#x6837;&#x5982;&#x679C;&#x6709;&#x65B0;&#x589E;&#x6743;&#x9650;&#x7684;&#x8BDD;&#xFF0C;&#x4E0D;&#x7528;&#x5728;action&#x91CC;&#x4FEE;&#x6539;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#xFF0C;&#x76F4;&#x63A5;&#x5728;interceptor&#x91CC;&#x4FEE;&#x6539;&#x5C31;&#x884C;&#x4E86;</p>
<p>Struts&#x6846;&#x67B6;&#x63D0;&#x4F9B;&#x5982;&#x4E0B;&#x670D;&#x52A1;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x4F5C;&#x4E3A;&#x63A7;&#x5236;&#x5668;&#x7684;Servlet&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x63D0;&#x4F9B;&#x5927;&#x91CF;&#x7684;&#x6807;&#x7B7E;&#x5E93;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x63D0;&#x4F9B;&#x4E86;&#x7528;&#x4E8E;&#x56FD;&#x9645;&#x5316;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x5229;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x9009;&#x62E9;&#x5408;&#x9002;&#x81EA;&#x5DF1;&#x7684;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x63D0;&#x4F9B;&#x4E86;JDBC&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x6765;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x6E90;&#x548C;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x6C60;&#x3002;</p>
<p>&#xFF08;5&#xFF09;XML&#x8BED;&#x6CD5;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#xFF08;6&#xFF09;&#x6587;&#x4EF6;&#x4E0B;&#x8F7D;&#x673A;&#x5236;&#x3002;</p>
<p>###26.&#x4EC0;&#x4E48;&#x662F; N&#x5C42;&#x7ED3;&#x6784;<br>  N&#x5C42;&#x7ED3;&#x6784; &#xFF08;n-tiers&#x7ED3;&#x6784; &#xFF0C;&#x591A;&#x5C42;&#x5F0F;&#x8FD0;&#x884C;&#x67B6;&#x6784; &#xFF09;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x4E24;&#x5C42;&#x7ED3;&#x6784;&#x800C;&#x8A00;&#x7684;&#x3002;&#x4F20;&#x7EDF;&#x7684;C/S &#x8BA1;&#x7B97;&#x591A;&#x662F;&#x57FA;&#x4E8E;&#x4E24;&#x7EA7;&#x6A21;&#x5F0F; &#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5F62;&#x5F0F;&#x903B;&#x8F91;&#x548C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5747;&#x9A7B;&#x7559;&#x5728;Client &#x7AEF;&#xFF0C;&#x800C;Server&#x5219;&#x6210;&#x4E3A;&#x6570;&#x636E;&#x5E93; &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8D1F;&#x8D23;&#x5404;&#x79CD;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#x548C;&#x7EF4;&#x62A4;&#x3002;&#x56E0;&#x6B64;Server&#x53D8;&#x5F97;&#x5F88;&#x201C;&#x7626;&#x201D;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x7626;&#x670D;&#x52A1;&#x5668; (Thin Server)&#x201D;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x53CD;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x9700;&#x8981;&#x5728;&#x5BA2;&#x6237;&#x7AEF; &#x8FD0;&#x884C;&#x5E9E;&#x5927;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F; &#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x80D6;&#x5BA2;&#x6237;&#x673A; (Fat Client)&#x201D;&#x3002;</p>
<pre><code>N&#x5C42;&#x67B6;&#x6784; &#xFF08;n-tiers &#x7ED3;&#x6784;&#xFF0C;&#x591A;&#x5C42;&#x5F0F;&#x8FD0;&#x884C;&#x67B6;&#x6784;&#xFF09;&#x7684;&#x56DB;&#x5C42;&#x662F;&#x6307;Presentation Tier&#xFF08;&#x8868;&#x793A;&#x5C42;&#xFF0C;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x5448;&#x73B0;&#x5728;&#x7528;&#x6237;&#x9762;&#x524D;&#x7684;&#x754C;&#x9762;&#xFF09;&#x3001;Web Server Tier&#xFF08;Web&#x670D;&#x52A1;&#x5668;&#x5C42;&#xFF09;&#x3001; Application Server Tier&#xFF08;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x5C42;&#xFF09;&#x548C; Data Tier&#xFF08;&#x6570;&#x636E;&#x5C42;&#xFF09;.
</code></pre><p>&#x4E00;&#x3001;N&#x5C42;&#x67B6;&#x6784;&#xFF08;n-tiers&#x7ED3;&#x6784;&#xFF0C;&#x591A;&#x5C42;&#x5F0F;&#x8FD0;&#x884C;&#x67B6;&#x6784;&#xFF09;&#x5B58;&#x5728;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;<br>&#x9996;&#x5148;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x9760;&#x6027;&#x6709;&#x6240;&#x964D;&#x4F4E;&#x3002;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x673A;/&#x670D;&#x52A1;&#x5668;&#x7CFB;&#x7EDF;&#x662F;&#x7531;&#x5404;&#x81EA;&#x72EC;&#x7ACB;&#x5F00;&#x53D1;&#x3001;&#x5236;&#x9020;&#x548C;&#x7BA1;&#x7406;&#x7684;&#x5404;&#x79CD;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6; &#x7684;&#x6DF7;&#x5408;&#x4F53;&#xFF0C;&#x5176;&#x5185;&#x5728;&#x7684;&#x53EF;&#x9760;&#x6027;&#x4E0D;&#x5982;&#x5355;&#x4E00;&#x7684;&#x3001;&#x4E2D;&#x592E;&#x7BA1;&#x7406;&#x7684;&#x5927;&#x578B;&#x673A;&#x6216;&#x5C0F;&#x578B;&#x673A;&#xFF0C;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5F88;&#x96BE;&#x7ACB;&#x5373;&#x83B7;&#x5F97;&#x6280;&#x672F;&#x652F;&#x6301;&#x548C;&#x5E2E;&#x52A9;&#x3002;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; &#x5176;&#x6B21;&#xFF0C;&#x7EF4;&#x62A4;&#x8D39;&#x7528;&#x8F83;&#x9AD8;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x79CD;&#x5E94;&#x7528;&#x6A21;&#x5F0F;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x63D0;&#x9AD8;&#x4E86;&#x751F;&#x4EA7;&#x6548;&#x7387;&#xFF0C;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x5E9E;&#x5927;&#x800C;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5F53;&#x7F51;&#x7EDC;&#x7528;&#x6237;&#x7684;&#x89C4;&#x6A21;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x6570;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x7EF4;&#x62A4;&#x91CF;&#x6025;&#x5267;&#x589E;&#x52A0;&#xFF0C;&#x56E0;&#x800C;&#x7EF4;&#x62A4;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x5341;&#x5206;&#x56F0;&#x96BE;&#x3002;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; &#x7B2C;&#x4E09;&#xFF0C;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#x6D6A;&#x8D39;&#x3002;&#x968F;&#x7740;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x89C4;&#x6A21;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x5BF9;&#x5BA2;&#x6237;&#x673A;&#x8D44;&#x6E90;&#x7684;&#x8981;&#x6C42;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x3002;&#x5C3D;&#x7BA1;&#x786C;&#x4EF6;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#xFF0C;&#x4F46;&#x65B0;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF; &#x548C;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x7684;&#x4E0D;&#x65AD;&#x51FA;&#x73B0;&#xFF0C;&#x4F7F;&#x5F97;&#x7528;&#x6237;&#x5BF9;&#x786C;&#x4EF6;&#x7684;&#x66F4;&#x65B0;&#x4ECD;&#x7136;&#x8DDF;&#x4E0D;&#x4E0A;&#x8F6F;&#x4EF6;&#x66F4;&#x65B0;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x5BA2;&#x6237;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x672C;&#x5730;&#x786C;&#x76D8;&#x4E0A;&#x88C5;&#x5165;&#x5927;&#x91CF;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x7684;&#x5927;&#x90FD;&#x53EA;&#x662F;&#x5176;&#x4E2D;&#x5F88;&#x5C11;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x4E00;&#x822C;&#x4F4E;&#x4E8E;10&#xFF05;&#xFF09;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x4F17;&#x591A;&#x7684;&#x201C;&#x80D6;&#x5BA2;&#x6237;&#x673A;&#x201D;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8FD9;&#x65E0;&#x7591;&#x662F;&#x4E00;&#x79CD;&#x5DE8;&#x5927;&#x7684;&#x6D6A;&#x8D39;&#x3002;<br>&#x3000;&#x3000;<br>&#x3000; &#x3000; &#x6700;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x7F3A;&#x4E4F;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x7531;&#x4E8E;&#x903B;&#x8F91;&#x540C;&#x754C;&#x9762;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5BA2;&#x6237;&#x673A;/&#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E00;&#x5E94;&#x7528;&#x72EC;&#x7ACB;&#x5730;&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x7F3A;&#x5C11;&#x91CD;&#x7528;&#x6027;&#x3002;&#x4F46;&#x80D6;&#x5BA2;&#x6237;&#x673A;&#x7684;&#x8BA1;&#x7B97;&#x6A21;&#x5F0F;&#x5374;&#x4ECD;&#x7136;&#x6EE1;&#x8DB3;&#x4E0D;&#x4E86;&#x65E5; &#x76CA;&#x589E;&#x957F;&#x7684;&#x5E94;&#x7528;&#x7684;&#x9700;&#x8981;&#x3002;&#x5728;&#x5411;&#x5E7F;&#x57DF;&#x7F51;&#x6269;&#x5145;&#xFF08;&#x5982;Internet&#xFF09;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x4FE1;&#x606F;&#x91CF;&#x7684;&#x8FC5;&#x901F;&#x589E;&#x5927;&#xFF0C;&#x4E13;&#x7528;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x591A;&#x529F;&#x80FD;&#x7684;&#x9700;&#x6C42; &#x3002;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x6A21;&#x5F0F;&#x4ECE;&#x4E24;&#x5C42;&#x6A21;&#x5F0F;&#x6269;&#x5C55;&#x5230;N&#x5C42;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x7ED3;&#x5408;&#x52A8;&#x6001;&#x8BA1;&#x7B97;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x3002; </p>
<p>&#x4E8C;&#x3001;N&#x5C42;&#x67B6;&#x6784;&#xFF08;n-tiers&#x7ED3;&#x6784;&#xFF0C;&#x591A;&#x5C42;&#x5F0F;&#x8FD0;&#x884C;&#x67B6;&#x6784;&#xFF09;&#x7684;&#x4E3B;&#x8981;&#x4F18;&#x70B9;<br>&#xFF2E;&#x5C42;&#x7ED3;&#x6784;&#x4ECE;&#x903B;&#x8F91;&#x4E0A;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x67D0;&#x4E00;&#x5C42;&#x7684;&#x53D8;&#x52A8;&#x901A;&#x5E38;&#x4E0D;&#x5F71;&#x54CD;&#x5176;&#x5B83;&#x5C42;&#xFF0C;&#x5177;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x53EF;&#x91CD;&#x7528;&#x6027;&#x3002;&#x9664;&#x6B64;&#x4EE5;&#x5916;&#xFF0C;&#xFF4E;&#x5C42;&#x7ED3;&#x6784;&#x8FD8;&#x6709;&#x4EE5;&#x4E0B;&#x4F18;&#x70B9;&#xFF1A;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 1&#x3001;&#x5229;&#x7528;&#x5355;&#x4E00;&#x7684;&#x8BBF;&#x95EE;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x8BBF;&#x95EE;&#x7AD9;&#x70B9;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF1B;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 2&#x3001;&#x5BF9;&#x4E8E;&#x5404;&#x79CD;&#x4FE1;&#x606F;&#x6E90;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x6587;&#x672C;&#x8FD8;&#x662F;&#x56FE;&#x5F62;&#x90FD;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x7684;&#x754C;&#x9762;&#xFF1B;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 3&#x3001;&#x6240;&#x6709;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x8BBA;&#x5176;&#x57FA;&#x4E8E;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x76F8;&#x540C;&#x7684;&#x754C;&#x9762;&#x8BBF;&#x95EE;&#xFF1B;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 4&#x3001;&#x53EF;&#x8DE8;&#x5E73;&#x53F0;&#x64CD;&#x4F5C;&#xFF1B;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 5&#x3001;&#x51CF;&#x5C11;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x6210;&#x672C;&#xFF1B;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 6&#x3001;&#x7EF4;&#x62A4;&#x5347;&#x7EA7;&#x5341;&#x5206;&#x65B9;&#x4FBF;&#xFF1B;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 7&#x3001;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x5F00;&#x653E;&#x6027;&#xFF1B;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 8&#x3001;&#x8FDB;&#x884C;&#x4E25;&#x5BC6;&#x7684;&#x5B89;&#x5168;&#x7BA1;&#x7406;&#xFF1B;<br>&#x3000;&#x3000;<br>&#x3000;&#x3000; 9&#x3001;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406; &#x7B80;&#x5355;&#xFF0C;&#x53EF;&#x652F;&#x6301;&#x5F02;&#x79CD;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x53EF;&#x7528;&#x6027;</p>
<p>###27.&#x4EC0;&#x4E48;&#x662F;Java&#x865A;&#x62DF;&#x673A;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;Java&#x88AB;&#x79F0;&#x4F5C;&#x662F;&#x201C;&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x201D;<br>java&#x865A;&#x62DF;&#x673A;&#x662F;&#x6267;&#x884C;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;&#xFF08;.class&#xFF09;&#x7684;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x7A0B;&#x3002;<br>&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x88C5;&#x6709;&#x4E0D;&#x540C;&#x7684;JVM&#xFF0C;&#x5B83;&#x4EEC;&#x80FD;&#x591F;&#x5C06;&#x76F8;&#x540C;&#x7684;.class&#x6587;&#x4EF6;&#xFF0C;&#x89E3;&#x91CA;&#x6210;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x6240;&#x9700;&#x8981;&#x7684;&#x673A;&#x5668;&#x7801;&#x3002;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x6709;JVM&#x7684;&#x5B58;&#x5728;&#xFF0C;java&#x88AB;&#x79F0;&#x4E3A;&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</p>
<p>###28.&#x4EC0;&#x4E48;&#x662F;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF1F;&#x7528;&#x9014;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x54EA;&#x4E2A;&#x5305;&#x4F7F;&#x7528;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x6A21;&#x5F0F;&#x5339;&#x914D;<br>&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x5C31;&#x662F;&#xFF0C;&#x7528;&#x4E00;&#x5C0F;&#x6BB5;&#x7B80;&#x5355;&#x7684;&#x5404;&#x79CD;&#x5B57;&#x7B26;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x5373;&#x53EB;&#x505A; &#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x53BB;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#xFF0C;&#x67E5;&#x627E;&#x4F60;&#x5230;&#x4F60;&#x6240;&#x9700;&#x8981;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4EE5;&#x4FBF;&#x540E;&#x671F;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x4F60;&#x6240;&#x8981;&#x7684;&#x5185;&#x5BB9;&#xFF1B;</p>
<p>java.util.regex</p>
<p>###29.&#x4EC0;&#x4E48;&#x662F;&#x61D2;&#x52A0;&#x8F7D;&#xFF08;Lazy Loading&#xFF09;<br>&#x61D2;&#x52A0;&#x8F7D;&#x5C31;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x8F9F;&#x7A7A;&#x95F4;,&#x4E0D;&#x7528;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x4E0D;&#x5360;&#x7528;&#x5185;&#x5B58;,&#x5F53;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x4E3A;&#x5176;alloc/init,&#x8FD9;&#x65F6;&#x5019;&#x624D;&#x5360;&#x7528;&#x5185;&#x5B58;.&#x53EA;&#x8981;&#x4E0D;&#x4F7F;&#x7528;&#x5C31;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x771F;&#x6B63;&#x751F;&#x6210;,&#x4E0D;&#x4F1A;&#x5360;&#x7528;&#x7A7A;&#x95F4;.</p>
<p>###30.&#x4EC0;&#x4E48;&#x662F;&#x5C3E;&#x9012;&#x5F52;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x5C3E;&#x9012;&#x5F52;<br>&#x5C3E;&#x9012;&#x5F52;&#x662F;&#x6307;&#x6240;&#x6709;&#x9012;&#x5F52;&#x5F62;&#x5F0F;&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x53D1;&#x751F;&#x5728;&#x51FD;&#x6570;&#x7684;&#x672B;&#x5C3E;&#x3002;&#x5F62;&#x5F0F;&#x4E0A;&#x53EA;&#x8981;&#x6700;&#x540E;&#x4E00;&#x4E2A;return&#x8BED;&#x53E5;&#x662F;&#x5355;&#x7EAF;&#x51FD;&#x6570;&#x5C31;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#x5C3E;&#x9012;&#x5F52;&#x548C;&#x4E00;&#x822C;&#x7684;&#x9012;&#x5F52;&#x4E0D;&#x540C;&#x5728;&#x5BF9;&#x5185;&#x5B58;&#x7684;&#x5360;&#x7528;&#xFF0C;&#x666E;&#x901A;&#x9012;&#x5F52;&#x521B;&#x5EFA;stack&#x7D2F;&#x79EF;&#x800C;&#x540E;&#x8BA1;&#x7B97;&#x6536;&#x7F29;&#xFF0C;&#x5C3E;&#x9012;&#x5F52;&#x53EA;&#x4F1A;&#x5360;&#x7528;&#x6052;&#x91CF;&#x7684;&#x5185;&#x5B58;&#xFF08;&#x548C;&#x8FED;&#x4EE3;&#x4E00;&#x6837;&#xFF09;</p>
<p>###31.&#x4EC0;&#x4E48;&#x662F;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#xFF08;Inversion of Control&#xFF09;&#x4E0E;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#xFF08;Dependency Injection&#xFF09;<br>&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x5373;IoC (Inversion of Control)&#xFF0C;&#x5B83;&#x628A;&#x4F20;&#x7EDF;&#x4E0A;&#x7531;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x76F4;&#x63A5;&#x64CD;&#x63A7;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x8C03;&#x7528;&#x6743;&#x4EA4;&#x7ED9;&#x5BB9;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x5BB9;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#x5BF9;&#x8C61;&#x7EC4;&#x4EF6;&#x7684;&#x88C5;&#x914D;&#x548C;&#x7BA1;&#x7406;&#x3002;&#x6240;&#x8C13;&#x7684;&#x201C;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x201D;&#x6982;&#x5FF5;&#x5C31;&#x662F;&#x5BF9;&#x7EC4;&#x4EF6;&#x5BF9;&#x8C61;&#x63A7;&#x5236;&#x6743;&#x7684;&#x8F6C;&#x79FB;&#xFF0C;&#x4ECE;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x672C;&#x8EAB;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x5916;&#x90E8;&#x5BB9;&#x5668;&#x3002;</p>
<p>&#x5176;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x6709;&#x4E24;&#x79CD;&#xFF1A;<1>&#x4F9D;&#x8D56;&#x67E5;&#x627E;&#xFF08;Dependency Lookup&#xFF09;&#xFF1A;&#x5BB9;&#x5668;&#x63D0;&#x4F9B;&#x56DE;&#x8C03;&#x63A5;&#x53E3;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x7ED9;&#x7EC4;&#x4EF6;&#x3002;EJB&#x548C;Apache Avalon&#x90FD;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x3002;<2>&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#xFF08;Dependency Injection&#xFF09;&#xFF1A;&#x7EC4;&#x4EF6;&#x4E0D;&#x505A;&#x5B9A;&#x4F4D;&#x67E5;&#x8BE2;&#xFF0C;&#x53EA;&#x63D0;&#x4F9B;&#x666E;&#x901A;&#x7684;Java&#x65B9;&#x6CD5;&#x8BA9;&#x5BB9;&#x5668;&#x53BB;&#x51B3;&#x5B9A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x540E;&#x8005;&#x662F;&#x65F6;&#x4E0B;&#x6700;&#x6D41;&#x884C;&#x7684;IoC&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x53C8;&#x6709;&#x63A5;&#x53E3;&#x6CE8;&#x5165;&#xFF08;Interface Injection&#xFF09;&#xFF0C;&#x8BBE;&#x503C;&#x6CE8;&#x5165;&#xFF08;Setter Injection&#xFF09;&#x548C;&#x6784;&#x9020;&#x5B50;&#x6CE8;&#x5165;&#xFF08;Constructor Injection&#xFF09;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x3002;</2></1></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2018-03-24T02:50:08.000Z" itemprop="datePublished">2018-03-24</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/2018/03/26/interview2/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    interview2
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2017/11/13/some-question/" class="ui tiny button">
                    
                    Some Questions
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2018 <a href="/">LEO CHEN</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a
                href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
