

<!DOCTYPE html>
<html lang="">
<head prefix="og: http://ogp.me/ns#">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="">
    <title>interview2 | YMR</title>

    <!-- Open Graph -->
    <meta name="description" content="###1.Array &amp;#x548C; ArrayList&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x533A;&amp;#x522B;&amp;#xFF1F;&amp;#x4EC0;&amp;#x4E48;&amp;#x65F6;&amp;#x5019;&amp;#x5E94;&amp;#x8BE5;&amp;#x4F7F;&amp;#x7528;Array&amp;#x800C;&amp;#x4E0D;&amp;#x662F;ArrayList&amp;#x5B58;&amp;#x50A8;&amp;#x51">
<meta property="og:type" content="article">
<meta property="og:title" content="interview2">
<meta property="og:url" content="http://yoursite.com/2018/03/26/interview2/index.html">
<meta property="og:site_name" content="YMR">
<meta property="og:description" content="###1.Array &amp;#x548C; ArrayList&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x533A;&amp;#x522B;&amp;#xFF1F;&amp;#x4EC0;&amp;#x4E48;&amp;#x65F6;&amp;#x5019;&amp;#x5E94;&amp;#x8BE5;&amp;#x4F7F;&amp;#x7528;Array&amp;#x800C;&amp;#x4E0D;&amp;#x662F;ArrayList&amp;#x5B58;&amp;#x50A8;&amp;#x51">
<meta property="og:updated_time" content="2018-03-26T16:09:33.048Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="interview2">
<meta name="twitter:description" content="###1.Array &amp;#x548C; ArrayList&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x533A;&amp;#x522B;&amp;#xFF1F;&amp;#x4EC0;&amp;#x4E48;&amp;#x65F6;&amp;#x5019;&amp;#x5E94;&amp;#x8BE5;&amp;#x4F7F;&amp;#x7528;Array&amp;#x800C;&amp;#x4E0D;&amp;#x662F;ArrayList&amp;#x5B58;&amp;#x50A8;&amp;#x51">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "LEO CHEN",
  "url": "http://yoursite.com"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>YMR</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">LEO CHEN</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        首页
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-interview2" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    interview2
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>###1.Array &#x548C; ArrayList&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;Array&#x800C;&#x4E0D;&#x662F;ArrayList<br>&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#x6BD4;&#x8F83;&#xFF1A;</p>
<p>Array&#x6570;&#x7EC4;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;</p>
<p>ArrayList&#x5374;&#x53EA;&#x80FD;&#x5305;&#x542B;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;Array&#x6570;&#x7EC4;&#x5728;&#x5B58;&#x653E;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x5B9A;&#x662F;&#x540C;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5143;&#x7D20;&#x3002;ArrayList&#x5C31;&#x4E0D;&#x4E00;&#x5B9A;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;ArrayList&#x53EF;&#x4EE5;&#x5B58;&#x50A8;Object&#x3002;</p>
<p>&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x6BD4;&#x8F83;&#xFF1A;</p>
<p>&#x5B83;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x7A7A;&#x95F4;&#x4E0D;&#x591F;&#x65F6;&#x4E5F;&#x4E0D;&#x80FD;&#x518D;&#x6B21;&#x7533;&#x8BF7;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x4E8B;&#x524D;&#x786E;&#x5B9A;&#x5408;&#x9002;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x3002;</p>
<p>ArrayList&#x7684;&#x7A7A;&#x95F4;&#x662F;&#x52A8;&#x6001;&#x589E;&#x957F;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x7A7A;&#x95F4;&#x4E0D;&#x591F;&#xFF0C;&#x5B83;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7A7A;&#x95F4;&#x6BD4;&#x539F;&#x7A7A;&#x95F4;&#x5927;&#x4E00;&#x500D;&#x7684;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6240;&#x6709;&#x5143;&#x7D20;&#x590D;&#x5236;&#x5230;&#x65B0;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x63A5;&#x7740;&#x629B;&#x5F03;&#x65E7;&#x6570;&#x7EC4;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x6BCF;&#x6B21;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x5143;&#x7D20;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x68C0;&#x67E5;&#x5185;&#x90E8;&#x6570;&#x7EC4;&#x7684;&#x7A7A;&#x95F4;&#x662F;&#x5426;&#x8DB3;&#x591F;&#x3002;&#xFF08;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#x7684;&#x5730;&#x65B9;&#xFF09;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x4E0A;&#x7684;&#x6BD4;&#x8F83;&#xFF1A;</p>
<p>ArrayList&#x4F5C;&#x4E3A;Array&#x7684;&#x589E;&#x5F3A;&#x7248;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x5728;&#x65B9;&#x6CD5;&#x4E0A;&#x6BD4;Array&#x66F4;&#x591A;&#x6837;&#x5316;&#xFF0C;&#x6BD4;&#x5982;&#x6DFB;&#x52A0;&#x5168;&#x90E8;addAll()&#x3001;&#x5220;&#x9664;&#x5168;&#x90E8;removeAll()&#x3001;&#x8FD4;&#x56DE;&#x8FED;&#x4EE3;&#x5668;iterator()&#x7B49;&#x3002;</p>
<p>&#x9002;&#x7528;&#x573A;&#x666F;&#xFF1A;</p>
<p>&#x5982;&#x679C;&#x60F3;&#x8981;&#x4FDD;&#x5B58;&#x4E00;&#x4E9B;&#x5728;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x90FD;&#x4F1A;&#x5B58;&#x5728;&#x800C;&#x4E14;&#x4E0D;&#x53D8;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x6570;&#x7EC4;&#x91CC;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5355;&#x7EAF;&#x53EA;&#x662F;&#x60F3;&#x8981;&#x4EE5;&#x6570;&#x7EC4;&#x7684;&#x5F62;&#x5F0F;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x589E;&#x52A0;&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x662F;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9009;&#x62E9;ArrayList&#x3002;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x662F;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x9891;&#x7E41;&#x7684;&#x79FB;&#x52A8;&#x6216;&#x5220;&#x9664;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5904;&#x7406;&#x7684;&#x662F;&#x8D85;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4F7F;&#x7528;ArrayList&#x5C31;&#x771F;&#x7684;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x6548;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x52A8;&#x4F5C;&#x5C31;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x9009;&#x62E9;LinkedList&#x3002;</p>
<p>###2.&#x6570;&#x7EC4;&#x548C;&#x94FE;&#x8868;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x63CF;&#x8FF0;&#xFF0C;&#x5404;&#x81EA;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;<br>1&#x3001;&#x5B58;&#x53D6;&#x65B9;&#x5F0F;&#x4E0A;&#xFF0C;&#x6570;&#x7EC4;&#x53EF;&#x4EE5;&#x987A;&#x5E8F;&#x5B58;&#x53D6;&#x6216;&#x8005;&#x968F;&#x673A;&#x5B58;&#x53D6;&#xFF0C;&#x800C;&#x94FE;&#x8868;&#x53EA;&#x80FD;&#x987A;&#x5E8F;&#x5B58;&#x53D6;&#xFF1B;&#x3000;</p>
<p>2&#x3001;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x4E0A;&#xFF0C;&#x6570;&#x7EC4;&#x903B;&#x8F91;&#x4E0A;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#x5728;&#x7269;&#x7406;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x4E0A;&#x4E5F;&#x76F8;&#x90BB;&#xFF0C;&#x800C;&#x94FE;&#x8868;&#x4E0D;&#x4E00;&#x5B9A;&#xFF1B;&#x3000;</p>
<p>3&#x3001;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E0A;&#xFF0C;&#x94FE;&#x8868;&#x7531;&#x4E8E;&#x5E26;&#x6709;&#x6307;&#x9488;&#x57DF;&#xFF0C;&#x5B58;&#x50A8;&#x5BC6;&#x5EA6;&#x4E0D;&#x5982;&#x6570;&#x7EC4;&#x5927;&#xFF1B;&#x3000;</p>
<p>4&#x3001;&#x6309;&#x5E8F;&#x53F7;&#x67E5;&#x627E;&#x65F6;&#xFF0C;&#x6570;&#x7EC4;&#x53EF;&#x4EE5;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#xFF0C;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E3A;O(1)&#xFF0C;&#x800C;&#x94FE;&#x8868;&#x4E0D;&#x652F;&#x6301;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#xFF0C;&#x5E73;&#x5747;&#x9700;&#x8981;O(n)&#xFF1B;&#x3000;</p>
<p>5&#x3001;&#x6309;&#x503C;&#x67E5;&#x627E;&#x65F6;&#xFF0C;&#x82E5;&#x6570;&#x7EC4;&#x65E0;&#x5E8F;&#xFF0C;&#x6570;&#x7EC4;&#x548C;&#x94FE;&#x8868;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5747;&#x4E3A;O(1)&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6570;&#x7EC4;&#x6709;&#x5E8F;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x6298;&#x534A;&#x67E5;&#x627E;&#x5C06;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x964D;&#x4E3A;O(logn)&#xFF1B;&#x3000;</p>
<p>6&#x3001;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x65F6;&#xFF0C;&#x6570;&#x7EC4;&#x5E73;&#x5747;&#x9700;&#x8981;&#x79FB;&#x52A8;n/2&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x94FE;&#x8868;&#x53EA;&#x9700;&#x4FEE;&#x6539;&#x6307;&#x9488;&#x5373;&#x53EF;&#xFF1B;&#x3000;</p>
<p>7&#x3001;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#x65B9;&#x9762;&#xFF1A;<br>&#x3000;&#x3000;&#x6570;&#x7EC4;&#x5728;&#x9759;&#x6001;&#x5B58;&#x50A8;&#x5206;&#x914D;&#x60C5;&#x5F62;&#x4E0B;&#xFF0C;&#x5B58;&#x50A8;&#x5143;&#x7D20;&#x6570;&#x91CF;&#x53D7;&#x9650;&#x5236;&#xFF0C;&#x52A8;&#x6001;&#x5B58;&#x50A8;&#x5206;&#x914D;&#x60C5;&#x5F62;&#x4E0B;&#xFF0C;&#x867D;&#x7136;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x6269;&#x5145;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x5927;&#x91CF;&#x5143;&#x7D20;&#xFF0C;&#x5BFC;&#x81F4;&#x64CD;&#x4F5C;&#x6548;&#x7387;&#x964D;&#x4F4E;&#xFF0C;&#x800C;&#x4E14;&#x5982;&#x679C;&#x5185;&#x5B58;&#x4E2D;&#x6CA1;&#x6709;&#x66F4;&#x5927;&#x5757;&#x8FDE;&#x7EED;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x5C06;&#x5BFC;&#x81F4;&#x5206;&#x914D;&#x5931;&#x8D25;&#xFF1B;<br>&#x3000;&#x3000;&#x94FE;&#x8868;&#x5B58;&#x50A8;&#x7684;&#x8282;&#x70B9;&#x7A7A;&#x95F4;&#x53EA;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x7533;&#x8BF7;&#x5206;&#x914D;&#xFF0C;&#x53EA;&#x8981;&#x5185;&#x5B58;&#x4E2D;&#x6709;&#x7A7A;&#x95F4;&#x5C31;&#x53EF;&#x4EE5;&#x5206;&#x914D;&#xFF0C;&#x64CD;&#x4F5C;&#x6BD4;&#x8F83;&#x7075;&#x6D3B;&#x9AD8;&#x6548;</p>
<p>###3.&#x961F;&#x5217;&#x548C;&#x6808;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5217;&#x51FA;&#x5B83;&#x4EEC;&#x7684;&#x533A;&#x522B;<br>&#x961F;&#x5217;&#xFF08;Queue&#xFF09;&#xFF1A;&#x662F;&#x9650;&#x5B9A;&#x53EA;&#x80FD;&#x5728;&#x8868;&#x7684;&#x4E00;&#x7AEF;&#x8FDB;&#x884C;&#x63D2;&#x5165;&#x548C;&#x5728;&#x53E6;&#x4E00;&#x7AEF;&#x8FDB;&#x884C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x7684;&#x7EBF;&#x6027;&#x8868;&#xFF1B;</p>
<p>&#x6808;&#xFF08;Stack&#xFF09;&#xFF1A;&#x662F;&#x9650;&#x5B9A;&#x53EA;&#x80FD;&#x5728;&#x8868;&#x7684;&#x4E00;&#x7AEF;&#x8FDB;&#x884C;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x7684;&#x7EBF;&#x6027;&#x8868;&#x3002;</p>
<p>&#x533A;&#x522B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x4E00;&#x3001;&#x89C4;&#x5219;&#x4E0D;&#x540C;</p>
<pre><code>1. &#x961F;&#x5217;&#xFF1A;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF08;First In First Out&#xFF09;FIFO

2. &#x6808;&#xFF1A;&#x5148;&#x8FDB;&#x540E;&#x51FA;&#xFF08;First In Last Out &#xFF09;FILO
</code></pre><p>&#x4E8C;&#x3001;&#x5BF9;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x7684;&#x9650;&#x5B9A;&#x4E0D;&#x540C;</p>
<pre><code>1. &#x961F;&#x5217;&#xFF1A;&#x53EA;&#x80FD;&#x5728;&#x8868;&#x7684;&#x4E00;&#x7AEF;&#x8FDB;&#x884C;&#x63D2;&#x5165;&#xFF0C;&#x5E76;&#x5728;&#x8868;&#x7684;&#x53E6;&#x4E00;&#x7AEF;&#x8FDB;&#x884C;&#x5220;&#x9664;&#xFF1B;

2. &#x6808;&#xFF1A;&#x53EA;&#x80FD;&#x5728;&#x8868;&#x7684;&#x4E00;&#x7AEF;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x3002;
</code></pre><p>&#x4E09;&#x3001;&#x904D;&#x5386;&#x6570;&#x636E;&#x901F;&#x5EA6;&#x4E0D;&#x540C;</p>
<pre><code>1. &#x961F;&#x5217;&#xFF1A;&#x57FA;&#x4E8E;&#x5730;&#x5740;&#x6307;&#x9488;&#x8FDB;&#x884C;&#x904D;&#x5386;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x4ECE;&#x5934;&#x90E8;&#x6216;&#x8005;&#x5C3E;&#x90E8;&#x8FDB;&#x884C;&#x904D;&#x5386;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x904D;&#x5386;&#xFF0C;&#x65E0;&#x9700;&#x5F00;&#x8F9F;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x904D;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x5F71;&#x54CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x6240;&#x4EE5;&#x904D;&#x5386;&#x901F;&#x5EA6;&#x8981;&#x5FEB;&#xFF1B;

2. &#x6808;&#xFF1A;&#x53EA;&#x80FD;&#x4ECE;&#x9876;&#x90E8;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6700;&#x5148;&#x8FDB;&#x5165;&#x6808;&#x5E95;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x904D;&#x5386;&#x6574;&#x4E2A;&#x6808;&#x624D;&#x80FD;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x904D;&#x5386;&#x6570;&#x636E;&#x7684;&#x540C;&#x65F6;&#x9700;&#x8981;&#x4E3A;&#x6570;&#x636E;&#x5F00;&#x8F9F;&#x4E34;&#x65F6;&#x7A7A;&#x95F4;&#xFF0C;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x5728;&#x904D;&#x5386;&#x524D;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;
</code></pre><p>###4.&#x4EC0;&#x4E48;&#x662F;BlockingQueue<br>BlockingQueue&#x5373;&#x963B;&#x585E;&#x961F;&#x5217;&#xFF0C;&#x4ECE;&#x963B;&#x585E;&#x8FD9;&#x4E2A;&#x8BCD;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x5BF9;&#x963B;&#x585E;&#x961F;&#x5217;&#x7684;&#x8BBF;&#x95EE;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x963B;&#x585E;&#x3002;&#x88AB;&#x963B;&#x585E;&#x7684;&#x60C5;&#x51B5;&#x4E3B;&#x8981;&#x6709;&#x5982;&#x4E0B;&#x4E24;&#x79CD;&#xFF1A;</p>
<ol class="ui list">
<li>&#x5F53;&#x961F;&#x5217;&#x6EE1;&#x4E86;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x5165;&#x961F;&#x5217;&#x64CD;&#x4F5C;</li>
<li>&#x5F53;&#x961F;&#x5217;&#x7A7A;&#x4E86;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x51FA;&#x961F;&#x5217;&#x64CD;&#x4F5C;</li>
</ol>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BD5;&#x56FE;&#x5BF9;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x6EE1;&#x4E86;&#x7684;&#x961F;&#x5217;&#x8FDB;&#x884C;&#x5165;&#x961F;&#x5217;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x9664;&#x975E;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x505A;&#x4E86;&#x51FA;&#x961F;&#x5217;&#x64CD;&#x4F5C;&#xFF1B;&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BD5;&#x56FE;&#x5BF9;&#x4E00;&#x4E2A;&#x7A7A;&#x961F;&#x5217;&#x8FDB;&#x884C;&#x51FA;&#x961F;&#x5217;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x9664;&#x975E;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x4E86;&#x5165;&#x961F;&#x5217;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x5728;Java&#x4E2D;&#xFF0C;BlockingQueue&#x7684;&#x63A5;&#x53E3;&#x4F4D;&#x4E8E;java.util.concurrent &#x5305;&#x4E2D;(&#x5728;Java5&#x7248;&#x672C;&#x5F00;&#x59CB;&#x63D0;&#x4F9B;)&#xFF0C;&#x7531;&#x4E0A;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x963B;&#x585E;&#x961F;&#x5217;&#x7684;&#x7279;&#x6027;&#x53EF;&#x77E5;&#xFF0C;&#x963B;&#x585E;&#x961F;&#x5217;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>BlockingQueue&#x7684;&#x5B9E;&#x73B0;&#x7C7B;</p>
<p>1.ArrayBlockingQueue<br>ArrayBlockingQueue&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x8FB9;&#x754C;&#x7684;&#x963B;&#x585E;&#x961F;&#x5217;&#xFF0C;&#x5B83;&#x7684;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x3002;&#x6709;&#x8FB9;&#x754C;&#x7684;&#x610F;&#x601D;&#x662F;&#x5B83;&#x7684;&#x5BB9;&#x91CF;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5728;&#x5176;&#x521D;&#x59CB;&#x5316;&#x7684;&#x65F6;&#x5019;&#x6307;&#x5B9A;&#x5B83;&#x7684;&#x5BB9;&#x91CF;&#x5927;&#x5C0F;&#xFF0C;&#x5BB9;&#x91CF;&#x5927;&#x5C0F;&#x4E00;&#x65E6;&#x6307;&#x5B9A;&#x5C31;&#x4E0D;&#x53EF;&#x6539;&#x53D8;&#x3002;</p>
<p>ArrayBlockingQueue&#x662F;&#x4EE5;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x65B0;&#x63D2;&#x5165;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5C3E;&#x90E8;&#xFF0C;&#x6700;&#x65B0;&#x79FB;&#x51FA;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5934;&#x90E8;</p>
<p>2.DelayQueue<br>DelayQueue&#x963B;&#x585E;&#x7684;&#x662F;&#x5176;&#x5185;&#x90E8;&#x5143;&#x7D20;&#xFF0C;DelayQueue&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x5FC5;&#x987B;&#x5B9E;&#x73B0; java.util.concurrent.Delayed&#x63A5;&#x53E3;&#xFF0C;&#x8FD8;&#x7EE7;&#x627F;&#x4E86;Comparable&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;DelayedQueue&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x6309;&#x5143;&#x7D20;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3002;</p>
<p>3.LinkedBlockingQueue<br>LinkedBlockingQueue&#x963B;&#x585E;&#x961F;&#x5217;&#x5927;&#x5C0F;&#x7684;&#x914D;&#x7F6E;&#x662F;&#x53EF;&#x9009;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x6709;&#x8FB9;&#x754C;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6307;&#x5B9A;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x65E0;&#x8FB9;&#x754C;&#x7684;&#x3002;&#x8BF4;&#x662F;&#x65E0;&#x8FB9;&#x754C;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x91C7;&#x7528;&#x4E86;&#x9ED8;&#x8BA4;&#x5927;&#x5C0F;&#x4E3A;Integer.MAX_VALUE&#x7684;&#x5BB9;&#x91CF; &#x3002;&#x5B83;&#x7684;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x662F;&#x4E00;&#x4E2A;&#x94FE;&#x8868;&#x3002;</p>
<p>&#x548C;ArrayBlockingQueue&#x4E00;&#x6837;&#xFF0C;LinkedBlockingQueue &#x4E5F;&#x662F;&#x4EE5;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x65B0;&#x63D2;&#x5165;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5C3E;&#x90E8;&#xFF0C;&#x6700;&#x65B0;&#x79FB;&#x51FA;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5934;&#x90E8;</p>
<p>4.PriorityBlockingQueue<br>PriorityBlockingQueue&#x662F;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x8FB9;&#x754C;&#x7684;&#x961F;&#x5217;&#xFF0C;&#x5B83;&#x7684;&#x6392;&#x5E8F;&#x89C4;&#x5219;&#x548C; java.util.PriorityQueue&#x4E00;&#x6837;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;PriorityBlockingQueue&#x4E2D;&#x5141;&#x8BB8;&#x63D2;&#x5165;null&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x6240;&#x6709;&#x63D2;&#x5165;PriorityBlockingQueue&#x7684;&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x5B9E;&#x73B0; java.lang.Comparable&#x63A5;&#x53E3;&#xFF0C;&#x961F;&#x5217;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x6392;&#x5E8F;&#x89C4;&#x5219;&#x5C31;&#x662F;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x6765;&#x5B9A;&#x4E49;&#x7684;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;PriorityBlockingQueue&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x5668;Iterator&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x8FED;&#x4EE3;&#x5668;&#x5E76;&#x4E0D;&#x4FDD;&#x8BC1;&#x6309;&#x7167;&#x4F18;&#x5148;&#x7EA7;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x3002;</p>
<p>5.SynchronousQueue<br>SynchronousQueue&#x961F;&#x5217;&#x5185;&#x90E8;&#x4EC5;&#x5141;&#x8BB8;&#x5BB9;&#x7EB3;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x540E;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x9664;&#x975E;&#x8FD9;&#x4E2A;&#x5143;&#x7D20;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6D88;&#x8D39;&#x3002;</p>
<p>###5.ConcurrentLinkedQueue&#x4E0E;LinkedBlockingQueue&#x7684;&#x5BF9;&#x6BD4;<br>&#x7531;&#x4E8E;2&#x91C7;&#x7528;&#x8BFB;&#x5199;&#x9501;&#x7684;&#x5F62;&#x5F0F;&#x5BF9;&#x8BFB;&#x5199;&#x8FDB;&#x884C;&#x63A7;&#x5236;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x9501;&#x7684;&#x83B7;&#x53D6;&#x4E0E;&#x91CA;&#x653E;&#x4E0A;&#x635F;&#x5931;&#x4E00;&#x5B9A;&#x7684;&#x6027;&#x80FD;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x6709;&#x591A;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x65F6;&#x591A;&#x7528;1&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;2&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5176;&#x6E90;&#x7801;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x83B7;&#x53D6;&#x961F;&#x9996;&#x5143;&#x7D20;&#x6709;take&#x4E0E;poll&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x6700;&#x672C;&#x8D28;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x5F53;&#x961F;&#x5217;&#x4E3A;&#x7A7A;&#x65F6;take&#x7EBF;&#x7A0B;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x8C03;&#x7528;wait&#xFF08;&#xFF09;&#x65B9;&#x6CD5;&#x91CA;&#x653E;&#x5176;&#x6240;&#x5360;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5F53;&#x6709;&#x65B0;&#x5143;&#x7D20;&#x5165;&#x961F;&#x65F6;&#x4F1A;&#x88AB;notify&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;poll&#xFF0C;&#x82E5;&#x961F;&#x5217;&#x4E3A;&#x7A7A;&#xFF0C;&#x4F1A;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;null&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x6D88;&#x8D39;&#x8005;&#x901F;&#x5EA6;&#x5927;&#x4E8E;&#x751F;&#x4EA7;&#x8005;&#x901F;&#x5EA6;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x961F;&#x5217;&#x7ECF;&#x5E38;&#x4E3A;&#x7A7A;&#xFF0C;&#x8FD9;&#x65F6;&#x5982;&#x679C;&#x4E0D;&#x5728;poll&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;&#x7A7A;&#x65F6;&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x7EBF;&#x7A0B;&#x7A7A;&#x8F6C;&#xFF0C;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x5BFC;&#x81F4;cpu&#x4F7F;&#x7528;&#x7387;&#x98D9;&#x5347;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x9501;&#x7684;&#x5F62;&#x5F0F;&#x5728;&#x7EBF;&#x7A0B;&#x5185;&#x90E8;&#x4E3B;&#x52A8;wait&#xFF08;&#xFF09;&#xFF0C;&#x800C;&#x5728;&#x5165;&#x961F;&#x65F6;notify&#x6216;&#x8005;notifyall&#x6765;&#x53C2;&#x7167;take&#x65B9;&#x6CD5;&#xFF0C;&#x9632;&#x6B62;&#x5927;&#x91CF;&#x7684;&#x7EBF;&#x7A0B;&#x7A7A;&#x8F6C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;1&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x5185;&#x90E8;&#x6CA1;&#x6709;&#x7C7B;&#x4F3C;&#x4E8E;2&#x7684;take&#x65B9;&#x6CD5;&#xFF0C;&#x9664;&#x4E86;poll&#x4E0E;peek&#x4E4B;&#x5916;&#xFF0C;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x522B;&#x7684;&#x83B7;&#x53D6;&#x5143;&#x7D20;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x662F;&#x5426;&#x4F1A;&#x5F39;&#x51FA;&#x961F;&#x9996;&#x5143;&#x7D20;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x65F6;&#x5982;&#x679C;&#x6D88;&#x8D39;&#x901F;&#x5EA6;&#x5927;&#x4E8E;&#x751F;&#x4EA7;&#x901F;&#x5EA6;&#xFF0C;&#x540C;&#x6837;&#x4F1A;&#x4EA7;&#x751F;&#x4E0A;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x5C31;&#x5FC5;&#x987B;&#x91C7;&#x7528;&#x663E;&#x5F0F;&#x7684;&#x65B9;&#x6CD5;&#x52A0;&#x9501;&#x8C03;&#x7528;wait&#xFF08;&#xFF09;&#x65B9;&#x6CD5;&#xFF0C;&#x9632;&#x6B62;cpu&#x7B49;&#x8D44;&#x6E90;&#x7684;&#x6D6A;&#x8D39;&#x3002;&#x63D0;&#x9AD8;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x3002;</p>
<p>###6.ArrayList&#x3001;Vector&#x3001;LinkedList&#x7684;&#x5B58;&#x50A8;&#x6027;&#x80FD;&#x548C;&#x7279;&#x6027;<br>1.ArrayList &#x91C7;&#x7528;&#x7684;&#x662F;&#x6570;&#x7EC4;&#x5F62;&#x5F0F;&#x6765;&#x4FDD;&#x5B58;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5C06;&#x5BF9;&#x8C61;&#x653E;&#x5728;&#x8FDE;&#x7EED;&#x7684;&#x4F4D;&#x7F6E;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x5927;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x63D2;&#x5165;&#x5220;&#x9664;&#x65F6;&#x975E;&#x5E38;&#x9EBB;&#x70E6;.</p>
<p>2.LinkedList &#x91C7;&#x7528;&#x7684;&#x5C06;&#x5BF9;&#x8C61;&#x5B58;&#x653E;&#x5728;&#x72EC;&#x7ACB;&#x7684;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x6BCF;&#x4E2A;&#x7A7A;&#x95F4;&#x4E2D;&#x8FD8;&#x4FDD;&#x5B58;&#x4E0B;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x7684;&#x7D22;&#x5F15; &#x4F46;&#x662F;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x67E5;&#x627E;&#x975E;&#x5E38;&#x9EBB;&#x70E6; &#x8981;&#x4E1B;&#x7B2C;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x5F00;&#x59CB;</p>
<p>3.ArrayList&#x548C;Vector&#x90FD;&#x662F;&#x7528;&#x6570;&#x7EC4;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#x6570;&#x636E;,&#x6B64;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x6570;&#x8981;&#x5927;&#x4E8E;&#x5B9E;&#x9645;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4EE5;&#x4FBF;&#x8FDB;&#x884C;&#x5143;&#x7D20;&#x589E;&#x52A0;&#x548C;&#x63D2;&#x5165;&#x64CD;&#x4F5C;,&#x4ED6;&#x4EEC;&#x90FD;&#x5141;&#x8BB8;&#x76F4;&#x63A5;&#x7528;&#x5E8F;&#x53F7;&#x7D22;&#x5F15;&#x5143;&#x7D20;,&#x4F46;&#x662F;&#x63D2;&#x5165;&#x6570;&#x636E;&#x5143;&#x7D20;&#x6D89;&#x53CA;&#x5230;&#x5143;&#x7D20;&#x79FB;&#x52A8;&#x7B49;&#x5185;&#x5B58;&#x64CD;&#x4F5C;,&#x6240;&#x4EE5;&#x7D22;&#x5F15;&#x6570;&#x636E;&#x5FEB;&#x800C;&#x63D2;&#x5165;&#x6570;&#x636E;&#x6162;.</p>
<p>4.Vector&#x4F7F;&#x7528;&#x4E86;sychronized&#x65B9;&#x6CD5;(&#x7EBF;&#x7A0B;&#x5B89;&#x5168;),&#x6240;&#x4EE5;&#x5728;&#x6027;&#x80FD;&#x4E0A;&#x6BD4;ArrayList&#x8981;&#x5DEE;&#x4E9B;.</p>
<p>5.LinkedList&#x4F7F;&#x7528;&#x53CC;&#x5411;&#x94FE;&#x8868;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#x6570;&#x636E;,&#x6309;&#x5E8F;&#x53F7;&#x7D22;&#x5F15;&#x6570;&#x636E;&#x9700;&#x8981;&#x524D;&#x5411;&#x6216;&#x540E;&#x5411;&#x904D;&#x5386;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x7D22;&#x5F15;&#x6570;&#x636E;&#x6162;,&#x662F;&#x63D2;&#x5165;&#x6570;&#x636E;&#x65F6;&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x524D;&#x540E;&#x9879;&#x5373;&#x53EF;,&#x6240;&#x4EE5;&#x63D2;&#x5165;&#x7684;&#x901F;&#x5EA6;&#x5FEB;.</p>
<p>6.arraylist&#x548C;vector&#x7684;&#x533A;&#x522B;?</p>
<p>1).&#x540C;&#x6B65;&#x6027;:Vector&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF0C;&#x800C;ArrayList&#x662F;&#x7EBF;&#x7A0B;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x540C;&#x6B65;&#x7684;</p>
<p>2).&#x6570;&#x636E;&#x589E;&#x957F;:&#x5F53;&#x9700;&#x8981;&#x589E;&#x957F;&#x65F6;,Vector&#x9ED8;&#x8BA4;&#x589E;&#x957F;&#x4E3A;&#x539F;&#x6765;&#x4E00;&#x57F9;&#xFF0C;&#x800C;ArrayList&#x5374;&#x662F;&#x539F;&#x6765;&#x7684;&#x4E00;&#x534A;</p>
<p>3).Vector&#x4E0D;&#x80FD;&#x6709;&#x79CD;&#x590D;&#x7684;&#x503C;&#xFF0C;ArrayList&#x5219;&#x53EF;&#x6709;&#x91CD;&#x590D;&#x7684;&#x503C;&#x3002;</p>
<p>###7.String&#x3001;StringBuffer&#x3001;StringBuilder<br>&#x4E09;&#x8005;&#x5728;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x65B9;&#x9762;&#x7684;&#x6BD4;&#x8F83;&#xFF1A;StringBuilder &gt;  StringBuffer  &gt;  String<br>StringBuilder&#xFF1A;&#x7EBF;&#x7A0B;&#x975E;&#x5B89;&#x5168;&#x7684;<br>StringBuffer&#xFF1A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;<br>&#x5982;&#x679C;&#x8981;&#x64CD;&#x4F5C;&#x5C11;&#x91CF;&#x7684;&#x6570;&#x636E;&#x7528; = String<br>&#x5355;&#x7EBF;&#x7A0B;&#x64CD;&#x4F5C;&#x5B57;&#x7B26;&#x4E32;&#x7F13;&#x51B2;&#x533A; &#x4E0B;&#x64CD;&#x4F5C;&#x5927;&#x91CF;&#x6570;&#x636E; = StringBuilder<br>&#x591A;&#x7EBF;&#x7A0B;&#x64CD;&#x4F5C;&#x5B57;&#x7B26;&#x4E32;&#x7F13;&#x51B2;&#x533A; &#x4E0B;&#x64CD;&#x4F5C;&#x5927;&#x91CF;&#x6570;&#x636E; = StringBuffer</p>
<p>###8.HashMap</p>
<p>####8.1HashMap&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x662F;&#x4EC0;&#x4E48;?<br>HashMap&#x57FA;&#x4E8E;hashing&#x539F;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;put()&#x548C;get()&#x65B9;&#x6CD5;&#x50A8;&#x5B58;&#x548C;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5C06;&#x952E;&#x503C;&#x5BF9;&#x4F20;&#x9012;&#x7ED9;put()&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x5B83;&#x8C03;&#x7528;&#x952E;&#x5BF9;&#x8C61;&#x7684;hashCode()&#x65B9;&#x6CD5;&#x6765;&#x8BA1;&#x7B97;hashcode&#xFF0C;&#x8BA9;&#x540E;&#x627E;&#x5230;bucket&#x4F4D;&#x7F6E;&#x6765;&#x50A8;&#x5B58;&#x503C;&#x5BF9;&#x8C61;&#x3002;&#x5F53;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x952E;&#x5BF9;&#x8C61;&#x7684;equals()&#x65B9;&#x6CD5;&#x627E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x952E;&#x503C;&#x5BF9;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x503C;&#x5BF9;&#x8C61;&#x3002;HashMap&#x4F7F;&#x7528;LinkedList&#x6765;&#x89E3;&#x51B3;&#x78B0;&#x649E;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x4E86;&#xFF0C;&#x5BF9;&#x8C61;&#x5C06;&#x4F1A;&#x50A8;&#x5B58;&#x5728;LinkedList&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#x3002; HashMap&#x5728;&#x6BCF;&#x4E2A;LinkedList&#x8282;&#x70B9;&#x4E2D;&#x50A8;&#x5B58;&#x952E;&#x503C;&#x5BF9;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5F53;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x952E;&#x5BF9;&#x8C61;&#x7684;hashcode&#x76F8;&#x540C;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F; &#x5B83;&#x4EEC;&#x4F1A;&#x50A8;&#x5B58;&#x5728;&#x540C;&#x4E00;&#x4E2A;bucket&#x4F4D;&#x7F6E;&#x7684;LinkedList&#x4E2D;&#x3002;&#x952E;&#x5BF9;&#x8C61;&#x7684;equals()&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x627E;&#x5230;&#x952E;&#x503C;&#x5BF9;&#x3002;</p>
<p>####8.2&#x5F53;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;hashcode&#x76F8;&#x540C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;<br>&#x56E0;&#x4E3A;hashcode&#x76F8;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x7684;bucket&#x4F4D;&#x7F6E;&#x76F8;&#x540C;&#xFF0C;&#x2018;&#x78B0;&#x649E;&#x2019;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x56E0;&#x4E3A;HashMap&#x4F7F;&#x7528;LinkedList&#x5B58;&#x50A8;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;Entry(&#x5305;&#x542B;&#x6709;&#x952E;&#x503C;&#x5BF9;&#x7684;Map.Entry&#x5BF9;&#x8C61;)&#x4F1A;&#x5B58;&#x50A8;&#x5728;LinkedList&#x4E2D;&#x3002;</p>
<p>####8.3&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x952E;&#x7684;hashcode&#x76F8;&#x540C;&#xFF0C;&#x4F60;&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x503C;&#x5BF9;&#x8C61;&#xFF1F;<br>&#x5F53;&#x6211;&#x4EEC;&#x8C03;&#x7528;get()&#x65B9;&#x6CD5;&#xFF0C;HashMap&#x4F1A;&#x4F7F;&#x7528;&#x952E;&#x5BF9;&#x8C61;&#x7684;hashcode&#x627E;&#x5230;bucket&#x4F4D;&#x7F6E;&#xFF0C;&#x627E;&#x5230;bucket&#x4F4D;&#x7F6E;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x8C03;&#x7528;keys.equals()&#x65B9;&#x6CD5;&#x53BB;&#x627E;&#x5230;LinkedList&#x4E2D;&#x6B63;&#x786E;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x6700;&#x7EC8;&#x627E;&#x5230;&#x8981;&#x627E;&#x7684;&#x503C;&#x5BF9;&#x8C61;<br>&#x4F7F;&#x7528;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3001;&#x58F0;&#x660E;&#x4F5C;final&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x91C7;&#x7528;&#x5408;&#x9002;&#x7684;equals()&#x548C;hashCode()&#x65B9;&#x6CD5;&#x7684;&#x8BDD;&#xFF0C;&#x5C06;&#x4F1A;&#x51CF;&#x5C11;&#x78B0;&#x649E;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x3002;&#x4E0D;&#x53EF;&#x53D8;&#x6027;&#x4F7F;&#x5F97;&#x80FD;&#x591F;&#x7F13;&#x5B58;&#x4E0D;&#x540C;&#x952E;&#x7684;hashcode&#xFF0C;&#x8FD9;&#x5C06;&#x63D0;&#x9AD8;&#x6574;&#x4E2A;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x4F7F;&#x7528;String&#xFF0C;Interger&#x8FD9;&#x6837;&#x7684;wrapper&#x7C7B;&#x4F5C;&#x4E3A;&#x952E;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>####8.4&#x5982;&#x679C;HashMap&#x7684;&#x5927;&#x5C0F;&#x8D85;&#x8FC7;&#x4E86;&#x8D1F;&#x8F7D;&#x56E0;&#x5B50;(load factor)&#x5B9A;&#x4E49;&#x7684;&#x5BB9;&#x91CF;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;<br>&#x9ED8;&#x8BA4;&#x7684;&#x8D1F;&#x8F7D;&#x56E0;&#x5B50;&#x5927;&#x5C0F;&#x4E3A;0.75&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;map&#x586B;&#x6EE1;&#x4E86;75%&#x7684;bucket&#x65F6;&#x5019;&#xFF0C;&#x548C;&#x5176;&#x5B83;&#x96C6;&#x5408;&#x7C7B;(&#x5982;ArrayList&#x7B49;)&#x4E00;&#x6837;&#xFF0C;&#x5C06;&#x4F1A;&#x521B;&#x5EFA;&#x539F;&#x6765;HashMap&#x5927;&#x5C0F;&#x7684;&#x4E24;&#x500D;&#x7684;bucket&#x6570;&#x7EC4;&#xFF0C;&#x6765;&#x91CD;&#x65B0;&#x8C03;&#x6574;map&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x5C06;&#x539F;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x653E;&#x5165;&#x65B0;&#x7684;bucket&#x6570;&#x7EC4;&#x4E2D;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EB;&#x4F5C;rehashing&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8C03;&#x7528;hash&#x65B9;&#x6CD5;&#x627E;&#x5230;&#x65B0;&#x7684;bucket&#x4F4D;&#x7F6E;&#x3002;</p>
<p>####8.5&#x4F60;&#x4E86;&#x89E3;&#x91CD;&#x65B0;&#x8C03;&#x6574;HashMap&#x5927;&#x5C0F;&#x5B58;&#x5728;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5417;&#xFF1F;<br>&#x5F53;&#x91CD;&#x65B0;&#x8C03;&#x6574;HashMap&#x5927;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x786E;&#x5B9E;&#x5B58;&#x5728;&#x6761;&#x4EF6;&#x7ADE;&#x4E89;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x53D1;&#x73B0;HashMap&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8C03;&#x6574;&#x5927;&#x5C0F;&#x4E86;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x540C;&#x65F6;&#x8BD5;&#x7740;&#x8C03;&#x6574;&#x5927;&#x5C0F;&#x3002;&#x5728;&#x8C03;&#x6574;&#x5927;&#x5C0F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B58;&#x50A8;&#x5728;LinkedList&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x7684;&#x6B21;&#x5E8F;&#x4F1A;&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x79FB;&#x52A8;&#x5230;&#x65B0;&#x7684;bucket&#x4F4D;&#x7F6E;&#x7684;&#x65F6;&#x5019;&#xFF0C;HashMap&#x5E76;&#x4E0D;&#x4F1A;&#x5C06;&#x5143;&#x7D20;&#x653E;&#x5728;LinkedList&#x7684;&#x5C3E;&#x90E8;&#xFF0C;&#x800C;&#x662F;&#x653E;&#x5728;&#x5934;&#x90E8;&#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5C3E;&#x90E8;&#x904D;&#x5386;(tail traversing)&#x3002;&#x5982;&#x679C;&#x6761;&#x4EF6;&#x7ADE;&#x4E89;&#x53D1;&#x751F;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6B7B;&#x5FAA;&#x73AF;&#x4E86;&#x3002;</p>
<p>####8.6&#x4E3A;&#x4EC0;&#x4E48;String, Interger&#x8FD9;&#x6837;&#x7684;wrapper&#x7C7B;&#x9002;&#x5408;&#x4F5C;&#x4E3A;&#x952E;&#xFF1F;<br>String, Interger&#x8FD9;&#x6837;&#x7684;wrapper&#x7C7B;&#x4F5C;&#x4E3A;HashMap&#x7684;&#x952E;&#x662F;&#x518D;&#x9002;&#x5408;&#x4E0D;&#x8FC7;&#x4E86;&#xFF0C;&#x800C;&#x4E14;String&#x6700;&#x4E3A;&#x5E38;&#x7528;&#x3002;&#x56E0;&#x4E3A;String&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x4E5F;&#x662F;final&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5DF2;&#x7ECF;&#x91CD;&#x5199;&#x4E86;equals()&#x548C;hashCode()&#x65B9;&#x6CD5;&#x4E86;&#x3002;&#x5176;&#x4ED6;&#x7684;wrapper&#x7C7B;&#x4E5F;&#x6709;&#x8FD9;&#x4E2A;&#x7279;&#x70B9;&#x3002;&#x4E0D;&#x53EF;&#x53D8;&#x6027;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E3A;&#x4E86;&#x8981;&#x8BA1;&#x7B97;hashCode()&#xFF0C;&#x5C31;&#x8981;&#x9632;&#x6B62;&#x952E;&#x503C;&#x6539;&#x53D8;&#xFF0C;&#x5982;&#x679C;&#x952E;&#x503C;&#x5728;&#x653E;&#x5165;&#x65F6;&#x548C;&#x83B7;&#x53D6;&#x65F6;&#x8FD4;&#x56DE;&#x4E0D;&#x540C;&#x7684;hashcode&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x80FD;&#x4ECE;HashMap&#x4E2D;&#x627E;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4E0D;&#x53EF;&#x53D8;&#x6027;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4F18;&#x70B9;&#x5982;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x5C06;&#x67D0;&#x4E2A;field&#x58F0;&#x660E;&#x6210;final&#x5C31;&#x80FD;&#x4FDD;&#x8BC1;hashCode&#x662F;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x8FD9;&#x4E48;&#x505A;&#x5427;&#x3002;&#x56E0;&#x4E3A;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#x8981;&#x7528;&#x5230;equals()&#x548C;hashCode()&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x952E;&#x5BF9;&#x8C61;&#x6B63;&#x786E;&#x7684;&#x91CD;&#x5199;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E0D;&#x76F8;&#x7B49;&#x7684;&#x5BF9;&#x8C61;&#x8FD4;&#x56DE;&#x4E0D;&#x540C;&#x7684;hashcode&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x78B0;&#x649E;&#x7684;&#x51E0;&#x7387;&#x5C31;&#x4F1A;&#x5C0F;&#x4E9B;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x63D0;&#x9AD8;HashMap&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>####8.7&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x952E;&#x5417;&#xFF1F;<br>&#x5F53;&#x7136;&#x4F60;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x952E;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x9075;&#x5B88;&#x4E86;equals()&#x548C;hashCode()&#x65B9;&#x6CD5;&#x7684;&#x5B9A;&#x4E49;&#x89C4;&#x5219;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x5BF9;&#x8C61;&#x63D2;&#x5165;&#x5230;Map&#x4E2D;&#x4E4B;&#x540E;&#x5C06;&#x4E0D;&#x4F1A;&#x518D;&#x6539;&#x53D8;&#x4E86;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#x65F6;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5DF2;&#x7ECF;&#x6EE1;&#x8DB3;&#x4E86;&#x4F5C;&#x4E3A;&#x952E;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x5B83;&#x521B;&#x5EFA;&#x4E4B;&#x540E;&#x5C31;&#x5DF2;&#x7ECF;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x4E86;&#x3002;</p>
<p>####8.8&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;CocurrentHashMap&#x6765;&#x4EE3;&#x66FF;HashTable&#x5417;&#xFF1F;<br>&#x8FD9;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5F88;&#x70ED;&#x95E8;&#x7684;&#x9762;&#x8BD5;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;ConcurrentHashMap&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x4EBA;&#x7528;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;HashTable&#x662F;synchronized&#x7684;&#xFF0C;&#x4F46;&#x662F;ConcurrentHashMap&#x540C;&#x6B65;&#x6027;&#x80FD;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EC5;&#x4EC5;&#x6839;&#x636E;&#x540C;&#x6B65;&#x7EA7;&#x522B;&#x5BF9;map&#x7684;&#x4E00;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x4E0A;&#x9501;&#x3002;ConcurrentHashMap&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;HashTable&#xFF0C;&#x4F46;&#x662F;HashTable&#x63D0;&#x4F9B;&#x66F4;&#x5F3A;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<p>###9.HashMap&#x3001;HashTable&#x4EE5;&#x53CA;ConCurrentHashMap&#x5F02;&#x540C;&#x6BD4;&#x8F83;</p>
<p>HashTable&#x548C;HashMap&#x91C7;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5B58;&#x50A8;&#x673A;&#x5236;&#xFF0C;&#x4E8C;&#x8005;&#x7684;&#x5B9E;&#x73B0;&#x57FA;&#x672C;&#x4E00;&#x81F4;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;HashMap&#x662F;&#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;HashTable&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x5185;&#x90E8;&#x7684;&#x65B9;&#x6CD5;&#x57FA;&#x672C;&#x90FD;&#x7ECF;&#x8FC7;synchronized&#x4FEE;&#x9970;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x56E0;&#x4E3A;&#x540C;&#x6B65;&#x3001;&#x54C8;&#x5E0C;&#x6027;&#x80FD;&#x7B49;&#x539F;&#x56E0;&#xFF0C;&#x6027;&#x80FD;&#x80AF;&#x5B9A;&#x662F;HashMap&#x66F4;&#x4F73;&#xFF0C;&#x56E0;&#x6B64;HashTable&#x5DF2;&#x88AB;&#x6DD8;&#x6C70;&#x3002;</p>
<p>&#xFF08;3&#xFF09; HashMap&#x5141;&#x8BB8;&#x6709;null&#x503C;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x800C;&#x5728;HashTable&#x4E2D;put&#x8FDB;&#x7684;&#x952E;&#x503C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;null&#xFF0C;&#x76F4;&#x63A5;&#x629B;&#x51FA;NullPointerException&#x3002;</p>
<p>&#xFF08;4&#xFF09;HashMap&#x9ED8;&#x8BA4;&#x521D;&#x59CB;&#x5316;&#x6570;&#x7EC4;&#x7684;&#x5927;&#x5C0F;&#x4E3A;16&#xFF0C;HashTable&#x4E3A;11&#x3002;&#x524D;&#x8005;&#x6269;&#x5BB9;&#x65F6;&#x4E58;2&#xFF0C;&#x4F7F;&#x7528;&#x4F4D;&#x8FD0;&#x7B97;&#x53D6;&#x5F97;&#x54C8;&#x5E0C;&#xFF0C;&#x6548;&#x7387;&#x9AD8;&#x4E8E;&#x53D6;&#x6A21;&#x3002;&#x800C;&#x540E;&#x8005;&#x4E3A;&#x4E58;2&#x52A0;1&#xFF0C;&#x90FD;&#x662F;&#x7D20;&#x6570;&#x548C;&#x5947;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x53D6;&#x6A21;&#x54C8;&#x5E0C;&#x7ED3;&#x679C;&#x66F4;&#x5747;&#x5300;&#x3002;</p>
<p>HashTable&#x548C;ConCurrentHashMap&#x7684;&#x5BF9;&#x6BD4;<br>&#x5148;&#x5BF9;ConcurrentHashMap&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x4ECB;&#x7ECD;&#x5427;&#xFF0C;&#x5B83;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;HashMap&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>HashTable&#x91CC;&#x4F7F;&#x7528;&#x7684;&#x662F;synchronized&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x5BF9;&#x5BF9;&#x8C61;&#x52A0;&#x9501;&#xFF0C;&#x9501;&#x4F4F;&#x7684;&#x90FD;&#x662F;&#x5BF9;&#x8C61;&#x6574;&#x4F53;&#xFF0C;&#x5F53;Hashtable&#x7684;&#x5927;&#x5C0F;&#x589E;&#x52A0;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6027;&#x80FD;&#x4F1A;&#x6025;&#x5267;&#x4E0B;&#x964D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FED;&#x4EE3;&#x65F6;&#x9700;&#x8981;&#x88AB;&#x9501;&#x5B9A;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>ConcurrentHashMap&#x5F15;&#x5165;&#x4E86;&#x5206;&#x5272;(Segment)&#xFF0C;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x884C;&#x5176;&#x5B9E;&#x5C31;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x628A;&#x4E00;&#x4E2A;&#x5927;&#x7684;Map&#x62C6;&#x5206;&#x6210;N&#x4E2A;&#x5C0F;&#x7684;HashTable&#xFF0C;&#x5728;put&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x4F1A;&#x6839;&#x636E;hash(paramK.hashCode())&#x6765;&#x51B3;&#x5B9A;&#x5177;&#x4F53;&#x5B58;&#x653E;&#x8FDB;&#x54EA;&#x4E2A;Segment&#xFF0C;&#x5982;&#x679C;&#x67E5;&#x770B;Segment&#x7684;put&#x64CD;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;&#x540C;&#x6B65;&#x673A;&#x5236;&#x662F;&#x57FA;&#x4E8E;lock&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;Map&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF08;Segment&#xFF09;&#x8FDB;&#x884C;&#x4E0A;&#x9501;&#xFF0C;&#x8FD9;&#x6837;&#x5F71;&#x54CD;&#x7684;&#x53EA;&#x662F;&#x5C06;&#x8981;&#x653E;&#x5165;&#x540C;&#x4E00;&#x4E2A;Segment&#x7684;&#x5143;&#x7D20;&#x7684;put&#x64CD;&#x4F5C;&#xFF0C;&#x4FDD;&#x8BC1;&#x540C;&#x6B65;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9501;&#x4F4F;&#x7684;&#x4E0D;&#x662F;&#x6574;&#x4E2A;Map&#xFF08;HashTable&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#xFF09;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;HashTable&#x63D0;&#x9AD8;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;HashTable&#x5DF2;&#x7ECF;&#x88AB;&#x6DD8;&#x6C70;&#x4E86;&#x3002;</p>
<p> HashMap&#x548C;ConCurrentHashMap&#x7684;&#x5BF9;&#x6BD4;<br> ConcurrentHashMap&#x5BF9;&#x6574;&#x4E2A;&#x6876;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x5272;&#x5206;&#x6BB5;(Segment)&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x6BB5;&#x4E0A;&#x90FD;&#x7528;lock&#x9501;&#x8FDB;&#x884C;&#x4FDD;&#x62A4;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;HashTable&#x7684;syn&#x5173;&#x952E;&#x5B57;&#x9501;&#x7684;&#x7C92;&#x5EA6;&#x66F4;&#x7CBE;&#x7EC6;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x66F4;&#x597D;&#xFF0C;&#x800C;HashMap&#x6CA1;&#x6709;&#x9501;&#x673A;&#x5236;&#xFF0C;&#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;<br> HashMap&#x7684;&#x952E;&#x503C;&#x5BF9;&#x5141;&#x8BB8;&#x6709;null&#xFF0C;&#x4F46;&#x662F;ConCurrentHashMap&#x90FD;&#x4E0D;&#x5141;&#x8BB8;&#x3002;</p>
<p>###10.HashMap&#x7684;&#x904D;&#x5386;&#x65B9;&#x5F0F;&#x53CA;&#x6548;&#x7387;<br><figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/* HashMap */</span>  </span><br><span class="line"><span class="function"><span class="keyword">public</span> <span class="keyword">static</span> <span class="keyword">void</span> <span class="title">hashMap</span><span class="params">()</span></span>{  </span><br><span class="line">    Map&lt;String,String&gt; hashMap = <span class="keyword">new</span> HashMap&lt;String, String&gt;();  </span><br><span class="line">      </span><br><span class="line">    <span class="keyword">for</span>(<span class="keyword">int</span> i=<span class="number">0</span>;i&lt;<span class="number">100000</span>;i++)  </span><br><span class="line">        hashMap.put(i+<span class="string">&quot;&quot;</span>, i+<span class="string">&quot;v&quot;</span>);  </span><br><span class="line">      </span><br><span class="line">    <span class="keyword">long</span> time = System.currentTimeMillis();  </span><br><span class="line">    System.out.println(<span class="string">&quot;==============&#x65B9;&#x5F0F;1&#xFF1A;&#x901A;&#x8FC7;&#x904D;&#x5386;keySet()&#x904D;&#x5386;HashMap&#x7684;value&quot;</span>);  </span><br><span class="line">    Iterator&lt;String&gt; it = hashMap.keySet().iterator();  </span><br><span class="line">    <span class="keyword">while</span>(it.hasNext()){  </span><br><span class="line">        hashMap.get(it.next());  </span><br><span class="line">        <span class="comment">//System.out.println(hashMap.get(it.next()));  </span></span><br><span class="line">    }  </span><br><span class="line">    System.out.println(<span class="string">&quot;&#x7528;&#x65F6;:&quot;</span>+(System.currentTimeMillis() - time));  </span><br><span class="line">      </span><br><span class="line">      </span><br><span class="line">    time = System.currentTimeMillis();  </span><br><span class="line">    System.out.println(<span class="string">&quot;==============&#x65B9;&#x5F0F;2&#xFF1A;&#x901A;&#x8FC7;&#x904D;&#x5386;values()&#x904D;&#x5386;HashMap&#x7684;value&quot;</span>);  </span><br><span class="line">    Collection&lt;String&gt; values = hashMap.values();  </span><br><span class="line">    <span class="keyword">for</span>(Iterator&lt;String&gt; valIt = values.iterator();valIt.hasNext();){  </span><br><span class="line">        valIt.next();  </span><br><span class="line">    }  </span><br><span class="line">    System.out.println(<span class="string">&quot;&#x7528;&#x65F6;:&quot;</span>+(System.currentTimeMillis() - time));  </span><br><span class="line">      </span><br><span class="line">      </span><br><span class="line">    time = System.currentTimeMillis();  </span><br><span class="line">    System.out.println(<span class="string">&quot;==============&#x65B9;&#x5F0F;3&#xFF1A;&#x901A;&#x8FC7;entrySet().iterator()&#x904D;&#x5386;HashMap&#x7684;key&#x548C;&#x6620;&#x5C04;&#x7684;value&quot;</span>);  </span><br><span class="line">    Iterator&lt;Entry&lt;String, String&gt;&gt; entryIt = hashMap.entrySet().iterator();  </span><br><span class="line">    <span class="keyword">while</span>(entryIt.hasNext()){  </span><br><span class="line">        Entry&lt;String, String&gt; entry = entryIt.next();  </span><br><span class="line">        entry.getKey();  </span><br><span class="line">        entry.getValue();  </span><br><span class="line">        <span class="comment">//System.out.println(&quot;key:&quot;+entry.getKey()+&quot; value:&quot;+entry.getValue());  </span></span><br><span class="line">    }  </span><br><span class="line">    System.out.println(<span class="string">&quot;&#x7528;&#x65F6;:&quot;</span>+(System.currentTimeMillis() - time));  </span><br><span class="line">  </span><br><span class="line">}</span><br></pre></td></tr></table></figure></p>
<p>&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>==============&#x65B9;&#x5F0F;1&#xFF1A;&#x901A;&#x8FC7;&#x904D;&#x5386;keySet()&#x904D;&#x5386;HashMap&#x7684;value<br>&#x7528;&#x65F6;:61</p>
<p>==============&#x65B9;&#x5F0F;2&#xFF1A;&#x901A;&#x8FC7;&#x904D;&#x5386;values()&#x904D;&#x5386;HashMap&#x7684;value<br>&#x7528;&#x65F6;:7</p>
<p>==============&#x65B9;&#x5F0F;3&#xFF1A;&#x901A;&#x8FC7;entrySet().iterator()&#x904D;&#x5386;HashMap&#x7684;key&#x548C;&#x6620;&#x5C04;&#x7684;value<br>&#x7528;&#x65F6;:12</p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x904D;&#x5386;key&#xFF0C;&#x6839;&#x636E;key&#x83B7;&#x53D6;&#x6620;&#x5C04;&#x7684;vlaue&#xFF0C;&#x9700;&#x8981;&#x8C03;&#x7528;get()&#x65B9;&#x6CD5;&#x5341;&#x4E07;&#x6B21;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x6548;&#x7387;&#x4E0D;&#x9AD8;&#x7684;&#x3002;&#x5EFA;&#x8BAE;&#x5728;&#x6570;&#x636E;&#x91CF;&#x8F83;&#x5927;&#x65F6;&#x4E0D;&#x7528;&#x6B64;&#x65B9;&#x5F0F;&#x904D;&#x5386;hashMap&#x3002;<br>&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x83B7;&#x53D6;&#x96C6;&#x5408;&#x4E2D;&#x7684;values&#xFF0C;&#x904D;&#x5386;value&#x3002;&#x4F46;&#x662F;&#x5728;&#x904D;&#x5386;value&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x83B7;&#x53D6;&#x4E0D;&#x5230;key&#x3002;&#x5EFA;&#x8BAE;&#x5728;&#x53EA;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x96C6;&#x5408;&#x4E2D;&#x7684;value&#x65F6;&#x4F7F;&#x7528;&#x6B64;&#x65B9;&#x5F0F;&#x3002;<br>&#x7B2C;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x83B7;&#x53D6;Entry<k,v>&#x7C7B;&#x578B;&#x7684;Set&#x96C6;&#x5408;&#xFF0C;&#x904D;&#x5386;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x83B7;&#x53D6;&#x6BCF;&#x4E00;&#x4E2A;Entry<k,v>&#xFF0C;&#x901A;&#x8FC7;getKey()&#x548C;getValue&#x6765;&#x83B7;&#x53D6;key&#x548C;value&#x3002;Entry<k,v>&#x662F;HashMap&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x904D;&#x5386;&#x4E86;&#x4E00;&#x904D;HashMap&#x4E2D;&#x7684;&#x952E;&#x503C;&#x5BF9; &#x3002;<br>&#x7701;&#x53BB;&#x4E86;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x4E2D;get()&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5EFA;&#x8BAE;&#x591A;&#x7528;&#x6B64;&#x65B9;&#x5F0F;&#x6765;&#x904D;&#x5386;hashMap&#x7ED3;&#x5408;&#x3002;<br>public Set<k> keySet() &#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x503C;&#x662F;Map&#x4E2D;key&#x503C;&#x7684;&#x96C6;&#x5408;&#xFF1B;public Set<map.entry<k,v>&gt;  entrySet()&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x503C;&#x4E5F;&#x662F;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;Set&#x96C6;&#x5408;&#xFF0C;&#x6B64;&#x96C6;&#x5408;&#x7684;&#x7C7B;&#x578B;&#x4E3A;Map.Entry&#x3002;<br>Map.Entry&#x662F;Map&#x58F0;&#x660E;&#x7684;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x63A5;&#x53E3;&#xFF0C;&#x6B64;&#x63A5;&#x53E3;&#x4E3A;&#x6CDB;&#x578B;&#xFF0C;&#x5B9A;&#x4E49;&#x4E3A;Entry<k,v>&#x3002;&#x5B83;&#x8868;&#x793A;Map&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#xFF08;&#x4E00;&#x4E2A;key-value&#x5BF9;&#xFF09;&#x3002;&#x63A5;&#x53E3;&#x4E2D;&#x6709;getKey(),getValue&#x65B9;&#x6CD5;&#x3002;<br>HashMap&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6362;&#x6210;TreeMap&#x9053;&#x7406;&#x4E5F;&#x4E00;&#x6837;&#x3002;<br>&#x5728;&#x6765;&#x8BF4;&#x4E00;&#x4E0B;Map.Entry&#x63A5;&#x53E3;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x5408;&#xFF1A;<br>&#x56E0;&#x4E3A;Map&#x8FD9;&#x4E2A;&#x7C7B;&#x6CA1;&#x6709;&#x7EE7;&#x627F;Iterable&#x63A5;&#x53E3;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x901A;&#x8FC7;map.iterator&#x6765;&#x904D;&#x5386;(list&#xFF0C;set&#x5C31;&#x662F;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FD9;&#x6837;&#x904D;&#x5386;),&#x6240;&#x4EE5;&#x5C31;&#x53EA;&#x80FD;&#x5148;&#x8F6C;&#x5316;&#x4E3A;set&#x7C7B;&#x578B;&#xFF0C;&#x7528;entrySet()&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x4E2D;set&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x503C;&#x5C31;&#x662F;map&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x952E;&#x503C;&#x5BF9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;Map.Entry<k,v>&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x904D;&#x5386;&#x4E86;&#x3002;<br>&#x57FA;&#x672C;&#x4E0A; &#x5C31;&#x662F;&#x904D;&#x5386;map&#x7684;&#x65F6;&#x5019;&#x624D;&#x7528;&#x5F97;&#x7740;&#x5B83;&#x5427;&#x3002;</k,v></k,v></map.entry<k,v></k></k,v></k,v></k,v></p>
<p>###11.HashMap,LinkedHashMap,TreeMap&#x7684;&#x533A;&#x522B;<br>HashMap<br>&#x3000;&#x3000;HashMap &#x662F;&#x4E00;&#x4E2A;&#x6700;&#x5E38;&#x7528;&#x7684;Map&#xFF0C;&#x5B83;&#x6839;&#x636E;&#x952E;&#x7684;HashCode &#x503C;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x6839;&#x636E;&#x952E;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x83B7;&#x53D6;&#x5B83;&#x7684;&#x503C;&#xFF0C;&#x5177;&#x6709;&#x5F88;&#x5FEB;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x3002;&#x904D;&#x5386;&#x65F6;&#xFF0C;&#x53D6;&#x5F97;&#x6570;&#x636E;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x5B8C;&#x5168;&#x968F;&#x673A;&#x7684;&#x3002;<br>&#x3000;&#x3000;HashMap&#x6700;&#x591A;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x7684;&#x952E;&#x4E3A;Null&#xFF1B;&#x5141;&#x8BB8;&#x591A;&#x6761;&#x8BB0;&#x5F55;&#x7684;&#x503C;&#x4E3A; Null&#x3002;<br>&#x3000;&#x3000;HashMap&#x4E0D;&#x652F;&#x6301;&#x7EBF;&#x7A0B;&#x7684;&#x540C;&#x6B65;&#xFF08;&#x5373;&#x4EFB;&#x4E00;&#x65F6;&#x523B;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x5199;HashMap&#xFF09;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x540C;&#x6B65;&#xFF0C;&#x53EF;&#x4EE5;&#x7528; Collections&#x7684;synchronizedMap&#x65B9;&#x6CD5;&#x4F7F;HashMap&#x5177;&#x6709;&#x540C;&#x6B65;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;ConcurrentHashMap&#x3002;<br>&#x3000;&#x3000;Hashtable&#x4E0E; HashMap&#x7C7B;&#x4F3C;&#xFF0C;&#x5B83;&#x7EE7;&#x627F;&#x81EA;Dictionary&#x7C7B;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF1A;&#x5B83;&#x4E0D;&#x5141;&#x8BB8;&#x8BB0;&#x5F55;&#x7684;&#x952E;&#x6216;&#x8005;&#x503C;&#x4E3A;&#x7A7A;&#xFF1B;&#x5B83;&#x652F;&#x6301;&#x7EBF;&#x7A0B;&#x7684;&#x540C;&#x6B65;&#xFF08;&#x5373;&#x4EFB;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x80FD;&#x5199;Hashtable&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x5BFC;&#x81F4;&#x4E86; Hashtable&#x5728;&#x5199;&#x5165;&#x65F6;&#x4F1A;&#x6BD4;&#x8F83;&#x6162;&#x3002;</p>
<p>LinkedHashMap<br>&#x3000;&#x3000;LinkedHashMap&#x4FDD;&#x5B58;&#x4E86;&#x8BB0;&#x5F55;&#x7684;&#x63D2;&#x5165;&#x987A;&#x5E8F;&#xFF0C;&#x5728;&#x7528;Iterator&#x904D;&#x5386;LinkedHashMap&#x65F6;&#xFF0C;&#x5148;&#x5F97;&#x5230;&#x7684;&#x8BB0;&#x5F55;&#x80AF;&#x5B9A;&#x662F;&#x5148;&#x63D2;&#x5165;&#x7684;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x6784;&#x9020;&#x65F6;&#x5E26;&#x53C2;&#x6570;&#xFF0C;&#x6309;&#x7167;&#x5E94;&#x7528;&#x6B21;&#x6570;&#x6392;&#x5E8F;&#x3002;<br>&#x5728;&#x904D;&#x5386;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x6BD4;HashMap&#x6162;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x79CD;&#x60C5;&#x51B5;&#x4F8B;&#x5916;&#xFF1A;&#x5F53;HashMap&#x5BB9;&#x91CF;&#x5F88;&#x5927;&#xFF0C;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x8F83;&#x5C11;&#x65F6;&#xFF0C;&#x904D;&#x5386;&#x8D77;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x6BD4;LinkedHashMap&#x6162;&#x3002;&#x56E0;&#x4E3A;LinkedHashMap&#x7684;&#x904D;&#x5386;&#x901F;&#x5EA6;&#x53EA;&#x548C;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x6709;&#x5173;&#xFF0C;&#x548C;&#x5BB9;&#x91CF;&#x65E0;&#x5173;&#xFF0C;&#x800C;HashMap&#x7684;&#x904D;&#x5386;&#x901F;&#x5EA6;&#x548C;&#x4ED6;&#x7684;&#x5BB9;&#x91CF;&#x6709;&#x5173;&#x3002;</p>
<p>TreeMap<br>&#x3000;&#x3000;TreeMap&#x5B9E;&#x73B0;SortMap&#x63A5;&#x53E3;&#xFF0C;&#x80FD;&#x591F;&#x628A;&#x5B83;&#x4FDD;&#x5B58;&#x7684;&#x8BB0;&#x5F55;&#x6839;&#x636E;&#x952E;&#x6392;&#x5E8F;&#x3002;<br>&#x3000;&#x3000;&#x9ED8;&#x8BA4;&#x662F;&#x6309;&#x952E;&#x503C;&#x7684;&#x5347;&#x5E8F;&#x6392;&#x5E8F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x6392;&#x5E8F;&#x7684;&#x6BD4;&#x8F83;&#x5668;&#xFF0C;&#x5F53;&#x7528;Iterator &#x904D;&#x5386;TreeMap&#x65F6;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x8BB0;&#x5F55;&#x662F;&#x6392;&#x8FC7;&#x5E8F;&#x7684;&#x3002;</p>
<p>&#x4E09;&#x79CD;&#x7C7B;&#x578B;&#x5206;&#x522B;&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4F7F;&#x7528;<br>&#x3000;&#x3000;1&#x3001;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x6700;&#x591A;&#x7684;&#x662F;HashMap&#x3002;HashMap&#x91CC;&#x9762;&#x5B58;&#x5165;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x5728;&#x53D6;&#x51FA;&#x7684;&#x65F6;&#x5019;&#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x5B83;&#x6839;&#x636E;&#x952E;&#x7684;HashCode&#x503C;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x6839;&#x636E;&#x952E;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x83B7;&#x53D6;&#x5B83;&#x7684;&#x503C;&#xFF0C;&#x5177;&#x6709;&#x5F88;&#x5FEB;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x3002;&#x5728;Map &#x4E2D;&#x63D2;&#x5165;&#x3001;&#x5220;&#x9664;&#x548C;&#x5B9A;&#x4F4D;&#x5143;&#x7D20;&#xFF0C;HashMap &#x662F;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;<br>&#x3000;&#x3000;2&#x3001;TreeMap&#x53D6;&#x51FA;&#x6765;&#x7684;&#x662F;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x3002;&#x4F46;&#x5982;&#x679C;&#x60A8;&#x8981;&#x6309;&#x81EA;&#x7136;&#x987A;&#x5E8F;&#x6216;&#x81EA;&#x5B9A;&#x4E49;&#x987A;&#x5E8F;&#x904D;&#x5386;&#x952E;&#xFF0C;&#x90A3;&#x4E48;TreeMap&#x4F1A;&#x66F4;&#x597D;&#x3002;<br>&#x3000;&#x3000;3&#x3001;LinkedHashMap &#x662F;HashMap&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x8F93;&#x51FA;&#x7684;&#x987A;&#x5E8F;&#x548C;&#x8F93;&#x5165;&#x7684;&#x76F8;&#x540C;,&#x90A3;&#x4E48;&#x7528;LinkedHashMap&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;,&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x6309;&#x8BFB;&#x53D6;&#x987A;&#x5E8F;&#x6765;&#x6392;&#x5217;&#xFF0C;&#x50CF;&#x8FDE;&#x63A5;&#x6C60;&#x4E2D;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x5176;&#x4ED6;</p>
<ol class="ui list">
<li>HashSet&#x662F;&#x901A;&#x8FC7;HashMap&#x5B9E;&#x73B0;&#x7684;,TreeSet&#x662F;&#x901A;&#x8FC7;TreeMap&#x5B9E;&#x73B0;&#x7684;,&#x53EA;&#x4E0D;&#x8FC7;Set&#x7528;&#x7684;&#x53EA;&#x662F;Map&#x7684;key</li>
<li>Map&#x7684;key&#x548C;Set&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x7279;&#x6027;&#x5C31;&#x662F;&#x96C6;&#x5408;&#x7684;&#x552F;&#x4E00;&#x6027;.TreeMap&#x66F4;&#x662F;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x6392;&#x5E8F;&#x7684;&#x529F;&#x80FD;.</li>
<li>hashCode&#x548C;equal()&#x662F;HashMap&#x7528;&#x7684;, &#x56E0;&#x4E3A;&#x65E0;&#x9700;&#x6392;&#x5E8F;&#x6240;&#x4EE5;&#x53EA;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x5B9A;&#x4F4D;&#x548C;&#x552F;&#x4E00;&#x6027;&#x5373;&#x53EF;.<br>&#x3000;&#x3000;a. hashCode&#x662F;&#x7528;&#x6765;&#x8BA1;&#x7B97;hash&#x503C;&#x7684;,hash&#x503C;&#x662F;&#x7528;&#x6765;&#x786E;&#x5B9A;hash&#x8868;&#x7D22;&#x5F15;&#x7684;.<br>&#x3000;&#x3000;b. hash&#x8868;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x5904;&#x5B58;&#x653E;&#x7684;&#x662F;&#x4E00;&#x5F20;&#x94FE;&#x8868;, &#x6240;&#x4EE5;&#x8FD8;&#x8981;&#x901A;&#x8FC7;equal&#x65B9;&#x6CD5;&#x5FAA;&#x73AF;&#x6BD4;&#x8F83;&#x94FE;&#x4E0A;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x624D;&#x53EF;&#x4EE5;&#x771F;&#x6B63;&#x5B9A;&#x4F4D;&#x5230;&#x952E;&#x503C;&#x5BF9;&#x5E94;&#x7684;Entry.<br>&#x3000;&#x3000;c. put&#x65F6;,&#x5982;&#x679C;hash&#x8868;&#x4E2D;&#x6CA1;&#x5B9A;&#x4F4D;&#x5230;,&#x5C31;&#x5728;&#x94FE;&#x8868;&#x524D;&#x52A0;&#x4E00;&#x4E2A;Entry,&#x5982;&#x679C;&#x5B9A;&#x4F4D;&#x5230;&#x4E86;,&#x5219;&#x66F4;&#x6362;Entry&#x4E2D;&#x7684;value,&#x5E76;&#x8FD4;&#x56DE;&#x65E7;value</li>
<li>&#x7531;&#x4E8E;TreeMap&#x9700;&#x8981;&#x6392;&#x5E8F;,&#x6240;&#x4EE5;&#x9700;&#x8981;&#x4E00;&#x4E2A;Comparator&#x4E3A;&#x952E;&#x503C;&#x8FDB;&#x884C;&#x5927;&#x5C0F;&#x6BD4;&#x8F83;.&#x5F53;&#x7136;&#x4E5F;&#x662F;&#x7528;Comparator&#x5B9A;&#x4F4D;&#x7684;.<br>&#x3000;&#x3000;a. Comparator&#x53EF;&#x4EE5;&#x5728;&#x521B;&#x5EFA;TreeMap&#x65F6;&#x6307;&#x5B9A;<br>&#x3000;&#x3000;b. &#x5982;&#x679C;&#x521B;&#x5EFA;&#x65F6;&#x6CA1;&#x6709;&#x786E;&#x5B9A;,&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x4F7F;&#x7528;key.compareTo()&#x65B9;&#x6CD5;,&#x8FD9;&#x5C31;&#x8981;&#x6C42;key&#x5FC5;&#x987B;&#x5B9E;&#x73B0;Comparable&#x63A5;&#x53E3;.<br>&#x3000;&#x3000;c. TreeMap&#x662F;&#x4F7F;&#x7528;Tree&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5B9E;&#x73B0;&#x7684;,&#x6240;&#x4EE5;&#x4F7F;&#x7528;compare&#x63A5;&#x53E3;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5B9A;&#x4F4D;&#x4E86;.</li>
</ol>
<p>###12.HashSet&#x548C;TreeSet&#x6709;&#x548C;&#x5F02;&#x540C;<br>&#x76F8;&#x540C;&#x70B9;&#xFF1A;</p>
<p>&#x5355;&#x5217;&#x96C6;&#x5408;&#xFF0C;&#x5143;&#x7D20;&#x4E0D;&#x53EF;&#x91CD;&#x590D;</p>
<p>&#x4E0D;&#x540C;&#x70B9;</p>
<ol class="ui list">
<li><p>&#x5E95;&#x5C42;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0D;&#x540C;</p>
<p> HashSet&#x5E95;&#x5C42;&#x7528;&#x7684;&#x662F;HashMap&#x54C8;&#x5E0C;&#x8868;&#x7ED3;&#x6784;&#x5B58;&#x50A8;&#xFF0C;&#x800C;TreeSet&#x5E95;&#x5C42;&#x7528;&#x7684;&#x662F;TreeMap&#x6811;&#x7ED3;&#x6784;&#x5B58;&#x50A8;</p>
</li>
</ol>
<p>2.&#x5B58;&#x50A8;&#x65F6;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x552F;&#x4E00;&#x6027;&#x4F9D;&#x636E;&#x4E0D;&#x540C;</p>
<p>   HashSet&#x662F;&#x901A;&#x8FC7;&#x590D;&#x5199;hashCode()&#x65B9;&#x6CD5;&#x548C;equals()&#x65B9;&#x6CD5;&#x6765;&#x4FDD;&#x8BC1;&#x7684;&#xFF0C;&#x800C;HashSet&#x901A;&#x8FC7;Compareable&#x63A5;&#x53E3;&#x7684;compareTo()&#x65B9;&#x6CD5;&#x6765;&#x4FDD;&#x8BC1;&#x7684;</p>
<p>3.&#x6709;&#x5E8F;&#x6027;&#x4E0D;&#x4E00;&#x6837;</p>
<p> HashSet&#x65E0;&#x5E8F;&#xFF0C;TreeSet&#x6709;&#x5E8F;</p>
<p> &#x5B58;&#x50A8;&#x539F;&#x7406;&#xFF1A;</p>
<p>   HashSet:&#x5E95;&#x5C42;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x5BF9;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x5B58;&#x50A8;&#xFF0C;&#x901A;&#x8FC7;&#x5224;&#x65AD;&#x5143;&#x7D20;&#x7684;hashCode&#x65B9;&#x6CD5;&#x548C;equals&#x65B9;&#x6CD5;&#x6765;&#x4FDD;&#x8BC1;&#x5143;&#x7D20;&#x7684;&#x552F;&#x4E00;&#x6027;&#xFF0C;&#x5F53;hashCode&#x503C;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x5B58;&#x50A8;&#x4E86;&#xFF0C;&#x4E0D;&#x7528;&#x5728;&#x5224;&#x65AD;equals&#x4E86;&#xFF0C;&#x5F53;hashCode&#x503C;&#x76F8;&#x540C;&#x65F6;&#xFF0C;&#x4F1A;&#x5728;&#x5224;&#x65AD;&#x4E00;&#x6B21;euqals&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x5426;&#x4E3A;true&#xFF0C;&#x5982;&#x679C;&#x4E3A;true&#x5219;&#x89C6;&#x4E3A;&#x7528;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x4E0D;&#x7528;&#x5B58;&#x50A8;&#xFF0C;&#x5982;&#x679C;&#x4E3A;false&#xFF0C;&#x8FD9;&#x4E9B;&#x76F8;&#x540C;&#x54C8;&#x5E0C;&#x503C;&#x4E0D;&#x540C;&#x5185;&#x5BB9;&#x7684;&#x5143;&#x7D20;&#x90FD;&#x5B58;&#x653E;&#x4E00;&#x4E2A;&#x6876;&#x91CC;&#xFF08;&#x5F53;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6876;&#x7ED3;&#x6784;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6876;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#xFF09;<br>  TreeSet:&#x5E95;&#x5C42;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;Set&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x6392;&#x5E8F;,&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6392;&#x5E8F;&#x6027;&#x80FD;, &#x6839;&#x636E;&#x6BD4;&#x8F83;&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x786E;&#x5B9A;&#x7684;,&#x53EA;&#x8981;&#x8FD4;&#x56DE;&#x7684;&#x662F;0.&#x5C31;&#x4EE3;&#x8868;&#x5143;&#x7D20;&#x91CD;&#x590D;</p>
<p>###13.&#x6D45;&#x8C08;WeakHashMap<br>WeakHashMap &#x91CC;&#x7684;entry&#x53EF;&#x80FD;&#x4F1A;&#x88AB;GC&#x81EA;&#x52A8;&#x5220;&#x9664;&#xFF0C;&#x5373;&#x4F7F;&#x7A0B;&#x5E8F;&#x5458;&#x6CA1;&#x6709;&#x8C03;&#x7528;remove()&#x6216;&#x8005;clear()&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x4F7F;&#x7528; WeakHashMap &#x65F6;&#xFF0C;&#x5373;&#x4F7F;&#x6CA1;&#x6709;&#x663E;&#x793A;&#x7684;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5982;&#x4E0B;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>&#x8C03;&#x7528;&#x4E24;&#x6B21;size()&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4E0D;&#x540C;&#x7684;&#x503C;&#xFF1B;<br>&#x4E24;&#x6B21;&#x8C03;&#x7528;isEmpty()&#x65B9;&#x6CD5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8FD4;&#x56DE;false&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8FD4;&#x56DE;true&#xFF1B;<br>&#x4E24;&#x6B21;&#x8C03;&#x7528;containsKey()&#x65B9;&#x6CD5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8FD4;&#x56DE;true&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8FD4;&#x56DE;false&#xFF0C;&#x5C3D;&#x7BA1;&#x4E24;&#x6B21;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;key&#xFF1B;<br>&#x4E24;&#x6B21;&#x8C03;&#x7528;get()&#x65B9;&#x6CD5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;value&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8FD4;&#x56DE;null&#xFF0C;&#x5C3D;&#x7BA1;&#x4E24;&#x6B21;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</p>
<p>WeekHashMap &#x7684;&#x8FD9;&#x4E2A;&#x7279;&#x70B9;&#x7279;&#x522B;&#x9002;&#x7528;&#x4E8E;&#x9700;&#x8981;&#x7F13;&#x5B58;&#x7684;&#x573A;&#x666F;&#x3002;&#x5728;&#x7F13;&#x5B58;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x5185;&#x5B58;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x7F13;&#x5B58;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#xFF1B;&#x5BF9;&#x8C61;&#x7F13;&#x5B58;&#x547D;&#x4E2D;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x6548;&#x7387;&#xFF0C;&#x4F46;&#x7F13;&#x5B58;MISS&#x4E5F;&#x4E0D;&#x4F1A;&#x9020;&#x6210;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x91CD;&#x65B0;&#x5F97;&#x5230;&#x3002;</p>
<p>WeakHashMap &#x5185;&#x90E8;&#x662F;&#x901A;&#x8FC7;&#x5F31;&#x5F15;&#x7528;&#x6765;&#x7BA1;&#x7406;entry&#x7684;&#xFF0C;&#x5F31;&#x5F15;&#x7528;&#x7684;&#x7279;&#x6027;&#x5BF9;&#x5E94;&#x5230; WeakHashMap &#x4E0A;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5C06;&#x4E00;&#x5BF9;key, value&#x653E;&#x5165;&#x5230; WeakHashMap &#x91CC;&#x5E76;&#x4E0D;&#x80FD;&#x907F;&#x514D;&#x8BE5;key&#x503C;&#x88AB;GC&#x56DE;&#x6536;&#xFF0C;&#x9664;&#x975E;&#x5728; WeakHashMap &#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x5BF9;&#x8BE5;key&#x7684;&#x5F3A;&#x5F15;&#x7528;&#x3002;</p>
<p>###14.TreeMap&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;<br>TreeMap&#x7684;&#x7ED3;&#x6784;&#x662F;&#x7EA2;&#x9ED1;&#x6811;&#x53C8;&#x79F0;&#x7EA2;-&#x9ED1;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x662F;&#x4E00;&#x9897;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x5B83;&#x5177;&#x4F53;&#x4E8C;&#x53C9;&#x6811;&#x6240;&#x6709;&#x7684;&#x7279;&#x6027;&#x3002;&#x540C;&#x65F6;&#x7EA2;&#x9ED1;&#x6811;&#x66F4;&#x662F;&#x4E00;&#x9897;&#x81EA;&#x5E73;&#x8861;&#x7684;&#x6392;&#x5E8F;&#x4E8C;&#x53C9;&#x6811;&#x3002;</p>
<p>###15.hashCode&#x65B9;&#x6CD5;&#x7684;&#x4F5C;&#x7528;<br>hashCode&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x662F;&#x4E3A;&#x4E86;&#x914D;&#x5408;&#x57FA;&#x4E8E;&#x6563;&#x5217;&#x7684;&#x96C6;&#x5408;&#x4E00;&#x8D77;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6563;&#x5217;&#x96C6;&#x5408;&#x5305;&#x62EC;HashSet&#x3001;HashMap&#x4EE5;&#x53CA;HashTable&#x3002;</p>
<p>###16.GC</p>
<p>####16.1GC &#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6709;GC&#xFF1F;<br>GC&#x662F;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x5185;&#x5B58;&#x5904;&#x7406;&#x662F;&#x7F16;&#x7A0B;&#x4EBA;&#x5458;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5FD8;&#x8BB0;&#x6216;&#x8005;&#x9519;&#x8BEF;&#x7684;&#x5185;&#x5B58;&#x56DE;&#x6536;&#x4F1A;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x6216;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x7A33;&#x5B9A;&#x751A;&#x81F3;&#x5D29;&#x6E83;&#xFF0C;Java&#x63D0;&#x4F9B;&#x7684;GC&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x76D1;&#x6D4B;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x8D85;&#x8FC7;&#x4F5C;&#x7528;&#x57DF;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x81EA;&#x52A8;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x7684;&#x76EE;&#x7684;&#xFF0C;Java&#x8BED;&#x8A00;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x91CA;&#x653E;&#x5DF2;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x663E;&#x793A;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#x3002;Java&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF0C;&#x56E0;&#x4E3A;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;</p>
<p>####16.2&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x5462;<br>1&#x3001;    &#x6392;&#x67E5;&#x5185;&#x5B58;&#x6EA2;&#x51FA;</p>
<p>2&#x3001;    &#x6392;&#x67E5;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;</p>
<p>3&#x3001;    &#x6027;&#x80FD;&#x8C03;&#x4F18;&#xFF0C;&#x6392;&#x67E5;&#x5E76;&#x53D1;&#x74F6;&#x9888;</p>
<p>####16.3 Jvm&#x600E;&#x4E48;&#x5224;&#x65AD;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#x4E86;&#xFF1F;<br>GC&#x4E3B;&#x8981;&#x5904;&#x7406;&#x7684;&#x662F;&#x5BF9;&#x8C61;&#x7684;&#x56DE;&#x6536;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4F1A;&#x89E6;&#x53D1;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x56DE;&#x6536;&#x7684;&#x5462;&#xFF1F;</p>
<p>1&#x3001;    &#x5BF9;&#x8C61;&#x6CA1;&#x6709;&#x5F15;&#x7528;</p>
<p>2&#x3001;    &#x4F5C;&#x7528;&#x57DF;&#x53D1;&#x751F;&#x672A;&#x6355;&#x83B7;&#x5F02;&#x5E38;</p>
<p>3&#x3001;    &#x7A0B;&#x5E8F;&#x5728;&#x4F5C;&#x7528;&#x57DF;&#x6B63;&#x5E38;&#x6267;&#x884C;&#x5B8C;&#x6BD5;</p>
<p>4&#x3001;    &#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x4E86;System.exit()</p>
<p>5&#x3001;    &#x7A0B;&#x5E8F;&#x53D1;&#x751F;&#x610F;&#x5916;&#x7EC8;&#x6B62;&#xFF08;&#x88AB;&#x6740;&#x8FDB;&#x7A0B;&#x7B49;&#xFF09;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x662F;&#x5F53;&#x5BF9;&#x8C61;&#x6CA1;&#x6709;&#x5F15;&#x7528;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5C06;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x6807;&#x8BB0;&#x4E3A;&#x53EF;&#x56DE;&#x6536;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB;&#x8D4B;&#x503C;&#x4E3A;null&#x4EE5;&#x540E;&#x5C31;&#x4E00;&#x5B9A;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x53EF;&#x56DE;&#x6536;&#x5BF9;&#x8C61;&#x4E86;&#x5462;&#xFF1F;</p>
<p>&#x5E76;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB;&#x8D4B;&#x503C;&#x4E3A;null&#x4E4B;&#x540E;&#x5C31;&#x4E00;&#x5B9A;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x53EF;&#x56DE;&#x6536;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x9003;&#x9038;&#xFF01;</p>
<p>####16.4GC&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;<br>GC&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x5982;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<p>1&#x3001;&#x6807;&#x8BB0;(Mark)</p>
<p>2&#x3001;&#x8BA1;&#x5212;(Plan)</p>
<p>3&#x3001;&#x6E05;&#x7406;(Sweep)</p>
<p>4&#x3001;&#x5F15;&#x7528;&#x66F4;&#x65B0;(Relocate)</p>
<p>5&#x3001;&#x538B;&#x7F29;(Compact)</p>
<p>&#xFF08;&#x4E00;&#xFF09;&#x3001;&#x6807;&#x8BB0;<br>&#x76EE;&#x6807;&#xFF1A;&#x627E;&#x51FA;&#x6240;&#x6709;&#x5F15;&#x7528;&#x4E0D;&#x4E3A;0(live)&#x7684;&#x5B9E;&#x4F8B;</p>
<p>&#x65B9;&#x6CD5;&#xFF1A;&#x627E;&#x5230;&#x6240;&#x6709;&#x7684;GC&#x7684;&#x6839;&#x7ED3;&#x70B9;(GC Root), &#x5C06;&#x4ED6;&#x4EEC;&#x653E;&#x5230;&#x961F;&#x5217;&#x91CC;&#xFF0C;&#x7136;&#x540E;&#x4F9D;&#x6B21;&#x9012;&#x5F52;&#x5730;&#x904D;&#x5386;&#x6240;&#x6709;&#x7684;&#x6839;&#x7ED3;&#x70B9;&#x4EE5;&#x53CA;&#x5F15;&#x7528;&#x7684;&#x6240;&#x6709;&#x5B50;&#x8282;&#x70B9;&#x548C;&#x5B50;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x88AB;&#x904D;&#x5386;&#x5230;&#x7684;&#x7ED3;&#x70B9;&#x6807;&#x8BB0;&#x6210;live&#x3002;&#x5F31;&#x5F15;&#x7528;&#x4E0D;&#x4F1A;&#x88AB;&#x8003;&#x8651;&#x5728;&#x5185;</p>
<p>&#xFF08;&#x4E8C;&#xFF09;&#x3001;&#x8BA1;&#x5212;&#x548C;&#x6E05;&#x7406;<br>1&#x3001;&#x8BA1;&#x5212;</p>
<p>&#x76EE;&#x6807;&#xFF1A;&#x5224;&#x65AD;&#x662F;&#x5426;&#x9700;&#x8981;&#x538B;&#x7F29;</p>
<p>&#x65B9;&#x6CD5;&#xFF1A;&#x904D;&#x5386;&#x5F53;&#x524D;&#x6240;&#x6709;&#x7684;generation&#x4E0A;&#x6240;&#x6709;&#x7684;&#x6807;&#x8BB0;(Live),&#x6839;&#x636E;&#x7279;&#x5B9A;&#x7B97;&#x6CD5;&#x4F5C;&#x51FA;&#x51B3;&#x7B56;</p>
<p>2&#x3001;&#x6E05;&#x7406;</p>
<p>&#x76EE;&#x6807;&#xFF1A;&#x56DE;&#x6536;&#x6240;&#x6709;&#x7684;free&#x7A7A;&#x95F4;</p>
<p>&#x65B9;&#x6CD5;&#xFF1A;&#x904D;&#x5386;&#x5F53;&#x524D;&#x6240;&#x6709;&#x7684;generation&#x4E0A;&#x6240;&#x6709;&#x7684;&#x6807;&#x8BB0;(Live or Dead),&#x628A;&#x6240;&#x6709;&#x5904;&#x5728;Live&#x5B9E;&#x4F8B;&#x4E2D;&#x95F4;&#x7684;&#x5185;&#x5B58;&#x5757;&#x52A0;&#x5165;&#x5230;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x94FE;&#x8868;&#x4E2D;&#x53BB;</p>
<p>&#xFF08;&#x4E09;&#xFF09;&#x3001;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x548C;&#x538B;&#x7F29;<br>1&#x3001;&#x5F15;&#x7528;&#x66F4;&#x65B0;</p>
<p>&#x76EE;&#x6807;&#xFF1A; &#x5C06;&#x6240;&#x6709;&#x5F15;&#x7528;&#x7684;&#x5730;&#x5740;&#x8FDB;&#x884C;&#x66F4;&#x65B0;</p>
<p>&#x65B9;&#x6CD5;&#xFF1A;&#x8BA1;&#x7B97;&#x51FA;&#x538B;&#x7F29;&#x540E;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x5BF9;&#x5E94;&#x7684;&#x65B0;&#x5730;&#x5740;&#xFF0C;&#x627E;&#x5230;&#x6240;&#x6709;&#x7684;GC&#x7684;&#x6839;&#x7ED3;&#x70B9;(GC Root), &#x5C06;&#x4ED6;&#x4EEC;&#x653E;&#x5230;&#x961F;&#x5217;&#x91CC;&#xFF0C;&#x7136;&#x540E;&#x4F9D;&#x6B21;&#x9012;&#x5F52;&#x5730;&#x904D;&#x5386;&#x6240;&#x6709;&#x7684;&#x6839;&#x7ED3;&#x70B9;&#x4EE5;&#x53CA;&#x5F15;&#x7528;&#x7684;&#x6240;&#x6709;&#x5B50;&#x8282;&#x70B9;&#x548C;&#x5B50;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x88AB;&#x904D;&#x5386;&#x5230;&#x7684;&#x7ED3;&#x70B9;&#x4E2D;&#x5F15;&#x7528;&#x7684;&#x5730;&#x5740;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#xFF0C;&#x5305;&#x62EC;&#x5F31;&#x5F15;&#x7528;&#x3002;</p>
<p>2&#x3001;&#x538B;&#x7F29;</p>
<p>&#x76EE;&#x6807;&#xFF1A;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x788E;&#x7247;</p>
<p>&#x65B9;&#x6CD5;&#xFF1A;&#x6839;&#x636E;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x65B0;&#x5730;&#x5740;&#xFF0C;&#x628A;&#x5B9E;&#x4F8B;&#x79FB;&#x52A8;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>####16.5 JVM&#x4E2D;&#x7684;&#x5806;&#xFF0C;&#x4E00;&#x822C;&#x5206;&#x4E3A;&#x4E09;&#x5927;&#x90E8;&#x5206;&#xFF1A;&#x65B0;&#x751F;&#x4EE3;&#x3001;&#x8001;&#x5E74;&#x4EE3;&#x3001;&#x6C38;&#x4E45;&#x4EE3;<br>&#x4E00;&#xFF1A;&#x65B0;&#x751F;&#x4EE3;&#xFF1A;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6765;&#x5B58;&#x653E;&#x65B0;&#x751F;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4E00;&#x822C;&#x5360;&#x636E;&#x5806;&#x7684;1/3&#x7A7A;&#x95F4;&#x3002;&#x7531;&#x4E8E;&#x9891;&#x7E41;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x65B0;&#x751F;&#x4EE3;&#x4F1A;&#x9891;&#x7E41;&#x89E6;&#x53D1;MinorGC&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;</p>
<pre><code>&#x65B0;&#x751F;&#x4EE3;&#x53C8;&#x5206;&#x4E3A; Eden&#x533A;&#x3001;ServivorFrom&#x3001;ServivorTo&#x4E09;&#x4E2A;&#x533A;&#x3002;

Eden&#x533A;&#xFF1A;Java&#x65B0;&#x5BF9;&#x8C61;&#x7684;&#x51FA;&#x751F;&#x5730;&#xFF08;&#x5982;&#x679C;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x5185;&#x5B58;&#x5F88;&#x5927;&#xFF0C;&#x5219;&#x76F4;&#x63A5;&#x5206;&#x914D;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#xFF09;&#x3002;&#x5F53;Eden&#x533A;&#x5185;&#x5B58;&#x4E0D;&#x591F;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x89E6;&#x53D1;MinorGC&#xFF0C;&#x5BF9;&#x65B0;&#x751F;&#x4EE3;&#x533A;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;

ServivorTo&#xFF1A;&#x4FDD;&#x7559;&#x4E86;&#x4E00;&#x6B21;MinorGC&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x5E78;&#x5B58;&#x8005;&#x3002;

ServivorFrom&#xFF1A;&#x4E0A;&#x4E00;&#x6B21;GC&#x7684;&#x5E78;&#x5B58;&#x8005;&#xFF0C;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E00;&#x6B21;GC&#x7684;&#x88AB;&#x626B;&#x63CF;&#x8005;&#x3002;

MinorGC&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;MinorGC&#x91C7;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x628A;Eden&#x548C;ServivorFrom&#x533A;&#x57DF;&#x4E2D;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;ServicorTo&#x533A;&#x57DF;&#xFF08;&#x5982;&#x679C;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x5E74;&#x9F84;&#x4EE5;&#x53CA;&#x8FBE;&#x5230;&#x4E86;&#x8001;&#x5E74;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x5219;&#x8D4B;&#x503C;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x533A;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x628A;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x5E74;&#x9F84;+1&#xFF08;&#x5982;&#x679C;ServicorTo&#x4E0D;&#x591F;&#x4F4D;&#x7F6E;&#x4E86;&#x5C31;&#x653E;&#x5230;&#x8001;&#x5E74;&#x533A;&#xFF09;&#xFF1B;&#x7136;&#x540E;&#xFF0C;&#x6E05;&#x7A7A;Eden&#x548C;ServicorFrom&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;&#x6700;&#x540E;&#xFF0C;ServicorTo&#x548C;ServicorFrom&#x4E92;&#x6362;&#xFF0C;&#x539F;ServicorTo&#x6210;&#x4E3A;&#x4E0B;&#x4E00;&#x6B21;GC&#x65F6;&#x7684;ServicorFrom&#x533A;&#x3002;
</code></pre><p>  &#x4E8C;&#xFF1A;&#x8001;&#x5E74;&#x4EE3;&#xFF1A;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x751F;&#x547D;&#x5468;&#x671F;&#x957F;&#x7684;&#x5185;&#x5B58;&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code>&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;MajorGC&#x4E0D;&#x4F1A;&#x9891;&#x7E41;&#x6267;&#x884C;&#x3002;&#x5728;&#x8FDB;&#x884C;MajorGC&#x524D;&#x4E00;&#x822C;&#x90FD;&#x5148;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;MinorGC&#xFF0C;&#x4F7F;&#x5F97;&#x6709;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x664B;&#x8EAB;&#x5165;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x5BFC;&#x81F4;&#x7A7A;&#x95F4;&#x4E0D;&#x591F;&#x7528;&#x65F6;&#x624D;&#x89E6;&#x53D1;&#x3002;&#x5F53;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x8FDE;&#x7EED;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#x7ED9;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F83;&#x5927;&#x5BF9;&#x8C61;&#x65F6;&#x4E5F;&#x4F1A;&#x63D0;&#x524D;&#x89E6;&#x53D1;&#x4E00;&#x6B21;MajorGC&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x817E;&#x51FA;&#x7A7A;&#x95F4;&#x3002;

MajorGC&#x91C7;&#x7528;&#x6807;&#x8BB0;&#x2014;&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#xFF1A;&#x9996;&#x5148;&#x626B;&#x63CF;&#x4E00;&#x6B21;&#x6240;&#x6709;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x6807;&#x8BB0;&#x51FA;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x56DE;&#x6536;&#x6CA1;&#x6709;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x3002;MajorGC&#x7684;&#x8017;&#x65F6;&#x6BD4;&#x8F83;&#x957F;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x626B;&#x63CF;&#x518D;&#x56DE;&#x6536;&#x3002;MajorGC&#x4F1A;&#x4EA7;&#x751F;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x635F;&#x8017;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x6216;&#x8005;&#x6807;&#x8BB0;&#x51FA;&#x6765;&#x65B9;&#x4FBF;&#x4E0B;&#x6B21;&#x76F4;&#x63A5;&#x5206;&#x914D;&#x3002;

 &#x5F53;&#x8001;&#x5E74;&#x4EE3;&#x4E5F;&#x6EE1;&#x4E86;&#x88C5;&#x4E0D;&#x4E0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4F1A;&#x629B;&#x51FA;OOM&#xFF08;Out of Memory&#xFF09;&#x5F02;&#x5E38;&#x3002;
</code></pre><p>&#x4E09;&#xFF1A;&#x6C38;&#x4E45;&#x4EE3;</p>
<pre><code>&#x6307;&#x5185;&#x5B58;&#x7684;&#x6C38;&#x4E45;&#x4FDD;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x4E3B;&#x8981;&#x5B58;&#x653E;Class&#x548C;Meta&#xFF08;&#x5143;&#x6570;&#x636E;&#xFF09;&#x7684;&#x4FE1;&#x606F;,Class&#x5728;&#x88AB;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x653E;&#x5165;&#x6C38;&#x4E45;&#x533A;&#x57DF;. &#x5B83;&#x548C;&#x548C;&#x5B58;&#x653E;&#x5B9E;&#x4F8B;&#x7684;&#x533A;&#x57DF;&#x4E0D;&#x540C;,GC&#x4E0D;&#x4F1A;&#x5728;&#x4E3B;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x671F;&#x5BF9;&#x6C38;&#x4E45;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x6E05;&#x7406;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E5F;&#x5BFC;&#x81F4;&#x4E86;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x533A;&#x57DF;&#x4F1A;&#x968F;&#x7740;&#x52A0;&#x8F7D;&#x7684;Class&#x7684;&#x589E;&#x591A;&#x800C;&#x80C0;&#x6EE1;&#xFF0C;&#x6700;&#x7EC8;&#x629B;&#x51FA;OOM&#x5F02;&#x5E38;&#x3002;

&#x5728;Java8&#x4E2D;&#xFF0C;&#x6C38;&#x4E45;&#x4EE3;&#x5DF2;&#x7ECF;&#x88AB;&#x79FB;&#x9664;&#xFF0C;&#x88AB;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x201C;&#x5143;&#x6570;&#x636E;&#x533A;&#x201D;&#xFF08;&#x5143;&#x7A7A;&#x95F4;&#xFF09;&#x7684;&#x533A;&#x57DF;&#x6240;&#x53D6;&#x4EE3;&#x3002;

&#x5143;&#x7A7A;&#x95F4;&#x7684;&#x672C;&#x8D28;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7C7B;&#x4F3C;&#xFF0C;&#x90FD;&#x662F;&#x5BF9;JVM&#x89C4;&#x8303;&#x4E2D;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x4E0D;&#x8FC7;&#x5143;&#x7A7A;&#x95F4;&#x4E0E;&#x6C38;&#x4E45;&#x4EE3;&#x4E4B;&#x95F4;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF1A;&#x5143;&#x7A7A;&#x95F4;&#x5E76;&#x4E0D;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x5185;&#x5B58;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5143;&#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#x4EC5;&#x53D7;&#x672C;&#x5730;&#x5185;&#x5B58;&#x9650;&#x5236;&#x3002;&#x7C7B;&#x7684;&#x5143;&#x6570;&#x636E;&#x653E;&#x5165; native memory, &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x548C;&#x7C7B;&#x7684;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x653E;&#x5165;java&#x5806;&#x4E2D;. &#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x52A0;&#x8F7D;&#x591A;&#x5C11;&#x7C7B;&#x7684;&#x5143;&#x6570;&#x636E;&#x5C31;&#x4E0D;&#x518D;&#x7531;MaxPermSize&#x63A7;&#x5236;, &#x800C;&#x7531;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x9645;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x6765;&#x63A7;&#x5236;.
&#x91C7;&#x7528;&#x5143;&#x7A7A;&#x95F4;&#x800C;&#x4E0D;&#x7528;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x51E0;&#x70B9;&#x539F;&#x56E0;&#xFF1A;&#xFF08;&#x53C2;&#x8003;&#xFF1A;http://www.cnblogs.com/paddix/p/5309550.html&#xFF09;
1&#x3001;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x6C38;&#x4E45;&#x4EE3;&#x7684;OOM&#x95EE;&#x9898;&#xFF0C;&#x5143;&#x6570;&#x636E;&#x548C;class&#x5BF9;&#x8C61;&#x5B58;&#x5728;&#x6C38;&#x4E45;&#x4EE3;&#x4E2D;&#xFF0C;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x548C;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x3002;
2&#x3001;&#x7C7B;&#x53CA;&#x65B9;&#x6CD5;&#x7684;&#x4FE1;&#x606F;&#x7B49;&#x6BD4;&#x8F83;&#x96BE;&#x786E;&#x5B9A;&#x5176;&#x5927;&#x5C0F;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#x6307;&#x5B9A;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#xFF0C;&#x592A;&#x5C0F;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x6C38;&#x4E45;&#x4EE3;&#x6EA2;&#x51FA;&#xFF0C;&#x592A;&#x5927;&#x5219;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x8001;&#x5E74;&#x4EE3;&#x6EA2;&#x51FA;&#xFF08;&#x56E0;&#x4E3A;&#x5806;&#x7A7A;&#x95F4;&#x6709;&#x9650;&#xFF0C;&#x6B64;&#x6D88;&#x5F7C;&#x957F;&#xFF09;&#x3002;
3&#x3001;&#x6C38;&#x4E45;&#x4EE3;&#x4F1A;&#x4E3A; GC &#x5E26;&#x6765;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5E76;&#x4E14;&#x56DE;&#x6536;&#x6548;&#x7387;&#x504F;&#x4F4E;&#x3002;
4&#x3001;Oracle &#x53EF;&#x80FD;&#x4F1A;&#x5C06;HotSpot &#x4E0E; JRockit &#x5408;&#x4E8C;&#x4E3A;&#x4E00;&#x3002;
</code></pre><p>####16.6GC &#x6709;&#x51E0;&#x79CD;&#x65B9;&#x5F0F;&#xFF1F;</p>
<blockquote>
<ul class="ui list">
<li><p>&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x65B9;&#x5F0F;<br>&#x6807;&#x8BB0;&#x6E05;&#x9664;&#xFF08;Mark and Sweep&#xFF09;&#x662F;&#x6700;&#x65E9;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#x7684;GC&#x7B97;&#x6CD5;&#xFF08;1960&#x5E74;&#xFF09;&#x3002;&#x5B83;&#x7684;&#x539F;&#x7406;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF1A;<br>&#x9996;&#x5148;&#x4ECE;&#x6839;&#x5F00;&#x59CB;&#x5C06;&#x53EF;&#x80FD;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x7528;&#x9012;&#x5F52;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6807;&#x8BB0;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6CA1;&#x6709;&#x6807;&#x8BB0;&#x5230;&#x7684;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x5783;&#x573E;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x3002;</p>
</li>
<li><p>&#x590D;&#x5236;&#x6536;&#x96C6;&#x65B9;&#x5F0F;<br>&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x5206;&#x914D;&#x4E86;&#x5927;&#x91CF;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x5B58;&#x6D3B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6240;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x5927;&#x5927;&#x8D85;&#x8FC7;&#x5FC5;&#x8981;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x662F;&#x5E94;&#x4E3A;&#x5728;&#x6E05;&#x9664;&#x9636;&#x6BB5;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x5927;&#x91CF;&#x6B7B;&#x4EA1;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x626B;&#x63CF;&#x3002;<br>&#x590D;&#x5236;&#x6536;&#x96C6;&#xFF08;Copy and Collection&#xFF09;&#x5219;&#x8BD5;&#x56FE;&#x514B;&#x670D;&#x8FD9;&#x4E00;&#x7F3A;&#x70B9;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x4F1A;&#x5C06;&#x4ECE;&#x6839;&#x5F00;&#x59CB;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;&#x53E6;&#x5916;&#x7684;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x518D;&#x5C06;&#x590D;&#x5236;&#x7684;&#x5BF9;&#x8C61;&#x6240;&#x80FD;&#x591F;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x7528;&#x9012;&#x5F52;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x65AD;&#x590D;&#x5236;&#x4E0B;&#x53BB;&#x3002;</p>
</li>
<li><p>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x65B9;&#x5F0F;<br>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x65B9;&#x5F0F;&#x662F;GC&#x7B97;&#x6CD5;&#x4E2D;&#x6700;&#x7B80;&#x5355;&#x4E5F;&#x6700;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x5B83;&#x548C;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x65B9;&#x5F0F;&#x5DEE;&#x4E0D;&#x591A;&#x662F;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x88AB;&#x53D1;&#x660E;&#x51FA;&#x6765;&#x7684;&#x3002;<br>&#x5B83;&#x7684;&#x539F;&#x7406;&#x662F;&#xFF1A;&#x5728;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x4FDD;&#x5B58;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF0C;&#x5F53;&#x5F15;&#x7528;&#x53D1;&#x751F;&#x589E;&#x51CF;&#x65F6;&#x5BF9;&#x8BA1;&#x6570;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x3002;<br>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7684;&#x589E;&#x51CF;&#xFF0C;&#x4E00;&#x822C;&#x53D1;&#x751F;&#x5728;&#x53D8;&#x91CF;&#x590D;&#x5236;&#xFF0C;&#x5BF9;&#x8C61;&#x5185;&#x5BB9;&#x66F4;&#x65B0;&#xFF0C;&#x51FD;&#x6570;&#x7ED3;&#x675F;&#xFF08;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E0D;&#x5728;&#x88AB;&#x5F15;&#x7528;&#xFF09;&#xFF0C;&#x7B49;&#x65F6;&#x95F4;&#x70B9;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4E3A;0&#x65F6;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x5B83;&#x5C06;&#x6765;&#x4E0D;&#x4F1A;&#x518D;&#x88AB;&#x5F15;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x91CA;&#x653E;&#x76F8;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;<br><strong>&#x4F18;&#x70B9;</strong><br>&#x76F8;&#x6BD4;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x548C;&#x590D;&#x5236;&#x6536;&#x96C6;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x66F4;&#x5BB9;&#x6613;&#x3002;<br>&#x5F53;&#x5BF9;&#x8C61;&#x4E0D;&#x518D;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x77AC;&#x95F4;&#x5C31;&#x4F1A;&#x88AB;&#x91CA;&#x653E;&#x3002;<br>&#x5176;&#x4ED6;GC&#x673A;&#x5236;&#x4E2D;&#xFF0C;&#x8981;&#x9884;&#x6D4B;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4F55;&#x65F6;&#x4F1A;&#x88AB;&#x91CA;&#x653E;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x800C;&#x5728;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x65B9;&#x5F0F;&#x4E2D;&#x5219;&#x662F;&#x7ACB;&#x5373;&#x88AB;&#x91CA;&#x653E;&#x3002;<br>&#x7531;&#x4E8E;&#x91CA;&#x653E;&#x64CD;&#x4F5C;&#x662F;&#x9488;&#x5BF9;&#x4E2A;&#x522B;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x548C;&#x5176;&#x4ED6;&#x7B97;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;&#x7531;GC&#x800C;&#x4EA7;&#x751F;&#x7684;&#x4E2D;&#x65AD;&#x65F6;&#x95F4;&#x5C31;&#x6BD4;&#x8F83;&#x77ED;&#x3002;<br><strong>&#x7F3A;&#x70B9;</strong><br>&#x65E0;&#x6CD5;&#x91CA;&#x653E;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x4E0A;&#x56FE;A&#xFF0C;B&#xFF0C;C&#x4E09;&#x4E2A;&#x5BF9;&#x8C61;&#x6CA1;&#x6709;&#x88AB;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#xFF0C;&#x800C;&#x662F;&#x4E92;&#x76F8;&#x4E4B;&#x95F4;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x7684;&#x8BA1;&#x6570;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x4E3A;0&#xFF0C;&#x7ED3;&#x679C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5C31;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x91CA;&#x653E;&#x3002;<br>&#x5FC5;&#x987B;&#x5728;&#x5F15;&#x7528;&#x53D1;&#x751F;&#x589E;&#x51CF;&#x65F6;&#x5BF9;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x505A;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x589E;&#x51CF;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x6F0F;&#x6389;&#x6216;&#x8005;&#x66F4;&#x6539;&#x4E86;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5C31;&#x4F1A;&#x5F15;&#x53D1;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x7684;&#x5185;&#x5B58;&#x9519;&#x8BEF;&#x3002;<br>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4E0D;&#x9002;&#x5408;&#x5E76;&#x884C;&#x5904;&#x7406;&#x3002;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x5BF9;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x8FDB;&#x884C;&#x589E;&#x51CF;&#x7684;&#x8BDD;&#xFF0C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7684;&#x503C;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x95EE;&#x9898;&#xFF08;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#xFF0C;&#x5BF9;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7684;&#x64CD;&#x4F5C;&#x5FC5;&#x987B;&#x91C7;&#x7528;&#x72EC;&#x5360;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x3002;&#x5982;&#x679C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x64CD;&#x4F5C;&#x9891;&#x7E41;&#x53D1;&#x751F;&#xFF0C;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x90FD;&#x8981;&#x4F7F;&#x7528;&#x52A0;&#x9501;&#x7B49;&#x5E76;&#x53D1;&#x64CD;&#x4F5C;&#x5176;&#x5F00;&#x9500;&#x4E5F;&#x4E0D;&#x53EF;&#x5C0F;&#x89D1;&#x3002;</p>
</li>
</ul>
</blockquote>
<p>####16.7Minor GC&#x3001;Major GC&#x548C;Full GC&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;<br>Minor GC<br>&#x4ECE;&#x5E74;&#x8F7B;&#x4EE3;&#x7A7A;&#x95F4;&#xFF08;&#x5305;&#x62EC; Eden &#x548C; Survivor &#x533A;&#x57DF;&#xFF09;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x88AB;&#x79F0;&#x4E3A; Minor GC&#x3002;&#x6BCF;&#x6B21; Minor GC &#x4F1A;&#x6E05;&#x7406;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5185;&#x5B58;&#x3002;<br>Major GC &#x662F;&#x6E05;&#x7406;&#x8001;&#x5E74;&#x4EE3;&#x3002;<br>Full GC &#x662F;&#x6E05;&#x7406;&#x6574;&#x4E2A;&#x5806;&#x7A7A;&#x95F4;&#x2014;&#x5305;&#x62EC;&#x5E74;&#x8F7B;&#x4EE3;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x3002;</p>
<p>####16.8&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;<br>1.Mark-Sweep&#xFF08;&#x6807;&#x8BB0;-&#x6E05;&#x9664;&#xFF09;&#x7B97;&#x6CD5;</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x662F;&#x6700;&#x57FA;&#x7840;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x5B83;&#x662F;&#x6700;&#x57FA;&#x7840;&#x7684;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x6700;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF0C;&#x601D;&#x60F3;&#x4E5F;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x3002;&#x6807;&#x8BB0;-&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x548C;&#x6E05;&#x9664;&#x9636;&#x6BB5;&#x3002;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x6807;&#x8BB0;&#x51FA;&#x6240;&#x6709;&#x9700;&#x8981;&#x88AB;&#x56DE;&#x6536;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6E05;&#x9664;&#x9636;&#x6BB5;&#x5C31;&#x662F;&#x56DE;&#x6536;&#x88AB;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x3002;<br>  &#x6807;&#x8BB0;-&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x788E;&#x7247;&#x592A;&#x591A;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x540E;&#x7EED;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x4E3A;&#x5927;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x65F6;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x800C;&#x63D0;&#x524D;&#x89E6;&#x53D1;&#x65B0;&#x7684;&#x4E00;&#x6B21;&#x5783;&#x573E;&#x6536;&#x96C6;&#x52A8;&#x4F5C;&#x3002;</p>
<p>2.Copying&#xFF08;&#x590D;&#x5236;&#xFF09;&#x7B97;&#x6CD5;</p>
<p>&#x3000;&#x3000;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;Mark-Sweep&#x7B97;&#x6CD5;&#x7684;&#x7F3A;&#x9677;&#xFF0C;Copying&#x7B97;&#x6CD5;&#x5C31;&#x88AB;&#x63D0;&#x4E86;&#x51FA;&#x6765;&#x3002;&#x5B83;&#x5C06;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x6309;&#x5BB9;&#x91CF;&#x5212;&#x5206;&#x4E3A;&#x5927;&#x5C0F;&#x76F8;&#x7B49;&#x7684;&#x4E24;&#x5757;&#xFF0C;&#x6BCF;&#x6B21;&#x53EA;&#x4F7F;&#x7528;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5757;&#x3002;&#x5F53;&#x8FD9;&#x4E00;&#x5757;&#x7684;&#x5185;&#x5B58;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x5C31;&#x5C06;&#x8FD8;&#x5B58;&#x6D3B;&#x7740;&#x7684;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x5757;&#x4E0A;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x628A;&#x5DF2;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x4E00;&#x6B21;&#x6E05;&#x7406;&#x6389;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x5C31;&#x4E0D;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x5185;&#x5B58;&#x788E;&#x7247;&#x7684;&#x95EE;&#x9898;&#x3002;<br>  &#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x867D;&#x7136;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#xFF0C;&#x8FD0;&#x884C;&#x9AD8;&#x6548;&#x4E14;&#x4E0D;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x5BF9;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x7684;&#x4F7F;&#x7528;&#x505A;&#x51FA;&#x4E86;&#x9AD8;&#x6602;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x56E0;&#x4E3A;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7F29;&#x51CF;&#x5230;&#x539F;&#x6765;&#x7684;&#x4E00;&#x534A;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5F88;&#x663E;&#x7136;&#xFF0C;Copying&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x8DDF;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x76EE;&#x591A;&#x5C11;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5F88;&#x591A;&#xFF0C;&#x90A3;&#x4E48;Copying&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x5C06;&#x4F1A;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x3002;</p>
<p>3.Mark-Compact&#xFF08;&#x6807;&#x8BB0;-&#x6574;&#x7406;&#xFF09;&#x7B97;&#x6CD5;</p>
<p>&#x3000;&#x3000;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;Copying&#x7B97;&#x6CD5;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x5145;&#x5206;&#x5229;&#x7528;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;Mark-Compact&#x7B97;&#x6CD5;&#x3002;&#x8BE5;&#x7B97;&#x6CD5;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x548C;Mark-Sweep&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5B8C;&#x6210;&#x6807;&#x8BB0;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x6E05;&#x7406;&#x53EF;&#x56DE;&#x6536;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x90FD;&#x5411;&#x4E00;&#x7AEF;&#x79FB;&#x52A8;&#xFF0C;&#x7136;&#x540E;&#x6E05;&#x7406;&#x6389;&#x7AEF;&#x8FB9;&#x754C;&#x4EE5;&#x5916;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<p>4.Generational Collection&#xFF08;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#xFF09;&#x7B97;&#x6CD5;</p>
<p>&#x3000;&#x3000;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x662F;&#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206;JVM&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x91C7;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x6839;&#x636E;&#x5BF9;&#x8C61;&#x5B58;&#x6D3B;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x5C06;&#x5185;&#x5B58;&#x5212;&#x5206;&#x4E3A;&#x82E5;&#x5E72;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x57DF;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x5C06;&#x5806;&#x533A;&#x5212;&#x5206;&#x4E3A;&#x8001;&#x5E74;&#x4EE3;&#xFF08;Tenured Generation&#xFF09;&#x548C;&#x65B0;&#x751F;&#x4EE3;&#xFF08;Young Generation&#xFF09;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x7279;&#x70B9;&#x662F;&#x6BCF;&#x6B21;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65F6;&#x53EA;&#x6709;&#x5C11;&#x91CF;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x800C;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x7279;&#x70B9;&#x662F;&#x6BCF;&#x6B21;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x90FD;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x4EE3;&#x7684;&#x7279;&#x70B9;&#x91C7;&#x53D6;&#x6700;&#x9002;&#x5408;&#x7684;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x3002;<br>  &#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5BF9;&#x4E8E;&#x65B0;&#x751F;&#x4EE3;&#x90FD;&#x91C7;&#x53D6;Copying&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x751F;&#x4EE3;&#x4E2D;&#x6BCF;&#x6B21;&#x5783;&#x573E;&#x56DE;&#x6536;&#x90FD;&#x8981;&#x56DE;&#x6536;&#x5927;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x9700;&#x8981;&#x590D;&#x5236;&#x7684;&#x64CD;&#x4F5C;&#x6B21;&#x6570;&#x8F83;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E2D;&#x5E76;&#x4E0D;&#x662F;&#x6309;&#x7167;1&#xFF1A;1&#x7684;&#x6BD4;&#x4F8B;&#x6765;&#x5212;&#x5206;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x7A7A;&#x95F4;&#x7684;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x662F;&#x5C06;&#x65B0;&#x751F;&#x4EE3;&#x5212;&#x5206;&#x4E3A;&#x4E00;&#x5757;&#x8F83;&#x5927;&#x7684;Eden&#x7A7A;&#x95F4;&#x548C;&#x4E24;&#x5757;&#x8F83;&#x5C0F;&#x7684;Survivor&#x7A7A;&#x95F4;&#xFF0C;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;Eden&#x7A7A;&#x95F4;&#x548C;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5757;Survivor&#x7A7A;&#x95F4;&#xFF0C;&#x5F53;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x65F6;&#xFF0C;&#x5C06;Eden&#x548C;Survivor&#x4E2D;&#x8FD8;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x5757;Survivor&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x6E05;&#x7406;&#x6389;Eden&#x548C;&#x521A;&#x624D;&#x4F7F;&#x7528;&#x8FC7;&#x7684;Survivor&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x3000;&#x3000;&#x800C;&#x7531;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x7279;&#x70B9;&#x662F;&#x6BCF;&#x6B21;&#x56DE;&#x6536;&#x90FD;&#x53EA;&#x56DE;&#x6536;&#x5C11;&#x91CF;&#x5BF9;&#x8C61;&#xFF0C;&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x7684;&#x662F;Mark-Compact&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x5806;&#x533A;&#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4EE3;&#x5C31;&#x662F;&#x6C38;&#x4E45;&#x4EE3;&#xFF08;Permanet Generation&#xFF09;&#xFF0C;&#x5B83;&#x7528;&#x6765;&#x5B58;&#x50A8;class&#x7C7B;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x65B9;&#x6CD5;&#x63CF;&#x8FF0;&#x7B49;&#x3002;&#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x56DE;&#x6536;&#x4E3B;&#x8981;&#x56DE;&#x6536;&#x4E24;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF1A;&#x5E9F;&#x5F03;&#x5E38;&#x91CF;&#x548C;&#x65E0;&#x7528;&#x7684;&#x7C7B;&#x3002;</p>
<p>####16.9.&#x5178;&#x578B;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;<br>1.Serial/Serial Old</p>
<p>&#x3000;&#x3000;Serial/Serial Old&#x6536;&#x96C6;&#x5668;&#x662F;&#x6700;&#x57FA;&#x672C;&#x6700;&#x53E4;&#x8001;&#x7684;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x7EBF;&#x7A0B;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5B83;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x6682;&#x505C;&#x6240;&#x6709;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x3002;Serial&#x6536;&#x96C6;&#x5668;&#x662F;&#x9488;&#x5BF9;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x662F;Copying&#x7B97;&#x6CD5;&#xFF0C;Serial Old&#x6536;&#x96C6;&#x5668;&#x662F;&#x9488;&#x5BF9;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x662F;Mark-Compact&#x7B97;&#x6CD5;&#x3002;&#x5B83;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x9AD8;&#x6548;&#xFF0C;&#x4F46;&#x662F;&#x7F3A;&#x70B9;&#x662F;&#x4F1A;&#x7ED9;&#x7528;&#x6237;&#x5E26;&#x6765;&#x505C;&#x987F;&#x3002;</p>
<p>&#x3000;&#x3000;2.ParNew</p>
<p>&#x3000;&#x3000;ParNew&#x6536;&#x96C6;&#x5668;&#x662F;Serial&#x6536;&#x96C6;&#x5668;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x7248;&#x672C;&#xFF0C;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x3002;</p>
<p>&#x3000;&#x3000;3.Parallel Scavenge</p>
<p>&#x3000;&#x3000;Parallel Scavenge&#x6536;&#x96C6;&#x5668;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x6536;&#x96C6;&#x5668;&#xFF08;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#xFF09;&#xFF0C;&#x5B83;&#x5728;&#x56DE;&#x6536;&#x671F;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x6682;&#x505C;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#xFF0C;&#x5176;&#x91C7;&#x7528;&#x7684;&#x662F;Copying&#x7B97;&#x6CD5;&#xFF0C;&#x8BE5;&#x6536;&#x96C6;&#x5668;&#x4E0E;&#x524D;&#x4E24;&#x4E2A;&#x6536;&#x96C6;&#x5668;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x53EF;&#x63A7;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>&#x3000;&#x3000;4.Parallel Old</p>
<p>&#x3000;&#x3000;Parallel Old&#x662F;Parallel Scavenge&#x6536;&#x96C6;&#x5668;&#x7684;&#x8001;&#x5E74;&#x4EE3;&#x7248;&#x672C;&#xFF08;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#xFF09;&#xFF0C;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x548C;Mark-Compact&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x3000;&#x3000;5.CMS</p>
<p>&#x3000;&#x3000;CMS&#xFF08;Current Mark Sweep&#xFF09;&#x6536;&#x96C6;&#x5668;&#x662F;&#x4E00;&#x79CD;&#x4EE5;&#x83B7;&#x53D6;&#x6700;&#x77ED;&#x56DE;&#x6536;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x4E3A;&#x76EE;&#x6807;&#x7684;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x5E76;&#x53D1;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x662F;Mark-Sweep&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x3000;&#x3000;6.G1</p>
<p>&#x3000;&#x3000;G1&#x6536;&#x96C6;&#x5668;&#x662F;&#x5F53;&#x4ECA;&#x6536;&#x96C6;&#x5668;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x6700;&#x524D;&#x6CBF;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x6B3E;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7AEF;&#x5E94;&#x7528;&#x7684;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5B83;&#x80FD;&#x5145;&#x5206;&#x5229;&#x7528;&#x591A;CPU&#x3001;&#x591A;&#x6838;&#x73AF;&#x5883;&#x3002;&#x56E0;&#x6B64;&#x5B83;&#x662F;&#x4E00;&#x6B3E;&#x5E76;&#x884C;&#x4E0E;&#x5E76;&#x53D1;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x80FD;&#x5EFA;&#x7ACB;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x6A21;&#x578B;&#x3002;</p>
<p>####16.10&#x4E32;&#x884C;(serial)&#x6536;&#x96C6;&#x5668;&#x548C;&#x541E;&#x5410;&#x91CF;(throughput)&#x6536;&#x96C6;&#x5668;&#x7684;&#x533A;&#x522B;&#x662F;&#x4EC0;&#x4E48;</p>
<p>&#x4E32;&#x884C;GC&#xFF1A;&#x6574;&#x4E2A;&#x626B;&#x63CF;&#x548C;&#x590D;&#x5236;&#x8FC7;&#x7A0B;&#x5747;&#x91C7;&#x7528;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x541E;&#x5410;&#x91CF;GC&#x6765;&#x8BF4;&#x7B80;&#x5355;&#xFF1B;&#x9002;&#x5408;&#x4E8E;&#x5355;CPU&#x3001;&#x5BA2;&#x6237;&#x7AEF;&#x7EA7;&#x522B;&#x3002;<br>&#x541E;&#x5410;&#x91CF;GC&#xFF1A;&#x91C7;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B8C;&#x6210;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF1B;&#x9002;&#x5408;&#x4E8E;&#x541E;&#x5410;&#x91CF;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x4E2D;&#x7B49;&#x548C;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;&#x5728;GC&#x65F6;&#x4F1A;&#x505C;&#x6B62;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#xFF08;stop-the-world&#xFF09;&#xFF0C;CPU&#x5229;&#x7528;&#x7387;&#x662F;&#x6700;&#x9AD8;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9002;&#x7528;&#x4E8E;&#x8981;&#x6C42;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#xFF08;throughput&#xFF09;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x505C;&#x987F;&#x65F6;&#x95F4;&#xFF08;pause time&#xFF09;&#x4F1A;&#x6BD4;&#x8F83;&#x957F;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;web&#x5E94;&#x7528;&#x6765;&#x8BF4;&#x5C31;&#x4E0D;&#x9002;&#x5408;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7528;&#x6237;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#x4F1A;&#x52A0;&#x957F;&#x3002;&#x800C;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x4E32;&#x884C;&#x6536;&#x96C6;&#xFF0C;&#x5728;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x57FA;&#x7840;&#x4E0A;&#x91C7;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;GC&#xFF0C;&#x5F88;&#x597D;&#x7684;&#x5F25;&#x8865;&#x4E86;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x53EF;&#x4EE5;&#x5927;&#x5E45;&#x7F29;&#x77ED;&#x505C;&#x987F;&#x65F6;&#x95F4;&#xFF08;&#x5982;&#x4E0B;&#x56FE;&#x8868;&#x793A;&#x7684;&#x505C;&#x987F;&#x65F6;&#x957F;&#x9AD8;&#x5EA6;&#xFF0C;&#x5E76;&#x53D1;&#x6BD4;&#x5E76;&#x884C;&#x8981;&#x77ED;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x7A7A;&#x95F4;&#x4E0D;&#x5927;&#x7684;&#x533A;&#x57DF;&#xFF08;&#x5982;young generation&#xFF09;&#xFF0C;&#x91C7;&#x7528;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x5F88;&#x77ED;&#xFF0C;&#x56DE;&#x6536;&#x6548;&#x7387;&#x9AD8;&#xFF0C;&#x9002;&#x5408;&#x9AD8;&#x9891;&#x7387;&#x6267;&#x884C;&#x3002;</p>
<p>####16.11&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6808;(stack)&#x3001;&#x5806;(heap)&#x548C;&#x65B9;&#x6CD5;&#x533A;(method area)&#x7684;&#x7528;&#x6CD5;<br>&#xFF08;1&#xFF09;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x73B0;&#x573A;&#x4FDD;&#x5B58;&#x90FD;&#x4F7F;&#x7528;JVM&#x4E2D;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#xFF1B;</p>
<p>&#xFF08;2&#xFF09;&#x901A;&#x8FC7;new&#x5173;&#x952E;&#x5B57;&#x548C;&#x6784;&#x9020;&#x5668;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x5219;&#x653E;&#x5728;&#x5806;&#x7A7A;&#x95F4;&#xFF0C;&#x5806;&#x662F;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7BA1;&#x7406;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x57DF;&#xFF0C;&#x7531;&#x4E8E;&#x73B0;&#x5728;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x90FD;&#x91C7;&#x7528;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5806;&#x7A7A;&#x95F4;&#x8FD8;&#x53EF;&#x4EE5;&#x7EC6;&#x5206;&#x4E3A;&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x8001;&#x751F;&#x4EE3;&#xFF0C;&#x518D;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;Eden&#x3001;Survivor&#xFF08;&#x53C8;&#x53EF;&#x5206;&#x4E3A;From Survivor&#x548C;To Survivor&#xFF09;&#x3001;Tenured&#xFF1B;</p>
<p>&#xFF08;3&#xFF09;&#x65B9;&#x6CD5;&#x533A;&#x548C;&#x5806;&#x90FD;&#x662F;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5DF2;&#x7ECF;&#x88AB;JVM&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x4FE1;&#x606F;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x3001;JIT&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x7B49;&#x6570;&#x636E;&#xFF1B;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5B57;&#x9762;&#x91CF;&#xFF08;literal&#xFF09;&#x5982;&#x76F4;&#x63A5;&#x4E66;&#x5199;&#x7684;100&#x3001;&#x201D;hello&#x201D;&#x548C;&#x5E38;&#x91CF;&#x90FD;&#x662F;&#x653E;&#x5728;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#xFF0C;&#x5E38;&#x91CF;&#x6C60;&#x662F;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x6808;&#x7A7A;&#x95F4;&#x64CD;&#x4F5C;&#x8D77;&#x6765;&#x6700;&#x5FEB;&#x4F46;&#x662F;&#x6808;&#x5F88;&#x5C0F;&#xFF0C;&#x901A;&#x5E38;&#x5927;&#x91CF;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x653E;&#x5728;&#x5806;&#x7A7A;&#x95F4;&#xFF0C;&#x6808;&#x548C;&#x5806;&#x7684;&#x5927;&#x5C0F;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;JVM&#x7684;&#x542F;&#x52A8;&#x53C2;&#x6570;&#x6765;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x6808;&#x7A7A;&#x95F4;&#x7528;&#x5149;&#x4E86;&#x4F1A;&#x5F15;&#x53D1;StackOverflowError&#xFF0C;&#x800C;&#x5806;&#x548C;&#x5E38;&#x91CF;&#x6C60;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#x5219;&#x4F1A;&#x5F15;&#x53D1;OutOfMemoryError&#x3002;</p>
<p>####16.12JVM&#x4E2D;&#x54EA;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;&#x7EBF;&#x7A0B;&#x7684;&#x6808;&#x5806;&#x6808;&#x5C0F;<br>-Xss &#x662F;&#x7EBF;&#x7A0B;&#x6808;&#x7684;&#x5927;&#x5C0F;&#xFF0C; &#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x9700;&#x8981;&#x4E25;&#x683C;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C; &#x4E00;&#x822C;&#x5C0F;&#x7684;&#x5E94;&#x7528;&#xFF0C; &#x5982;&#x679C;&#x6808;&#x4E0D;&#x662F;&#x5F88;&#x6DF1;&#xFF0C; &#x5E94;&#x8BE5;&#x662F;128k&#x591F;&#x7528;&#x7684;&#xFF0C; &#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x8C03;&#x7528;&#x6DF1;&#x5EA6;&#x6BD4;&#x8F83;&#x5927;&#xFF0C; &#x8FD8;&#x9700;&#x8981;&#x505A;&#x8BE6;&#x7EC6;&#x7684;&#x6D4B;&#x8BD5;&#x3002; &#x8FD9;&#x4E2A;&#x9009;&#x9879;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#x6BD4;&#x8F83;&#x5927;&#x3002; &#x5EFA;&#x8BAE;&#x4F7F;&#x7528;256K&#x7684;&#x5927;&#x5C0F;.</p>
<p>####16.13Java&#x8BED;&#x8A00;&#x4E2D;&#x662F;&#x5426;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x7684;&#x95EE;&#x9898;<br>&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x662F;&#x5426;&#x7B26;&#x5408;&#x5783;&#x573E;&#x56DE;&#x7684;&#x6807;&#x51C6;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;</p>
<p>&#x7B2C;&#x4E00;&#xFF1A;&#x7ED9;&#x5BF9;&#x8C61;&#x8D4B;&#x4E88;&#x4E86;&#x7A7A;&#x503C;null&#xFF0C;&#x4EE5;&#x540E;&#x518D;&#x6CA1;&#x6709;&#x88AB;&#x4F7F;&#x7528;&#x8FC7;&#xFF1B;</p>
<p>&#x7B2C;&#x4E8C;&#xFF1A;&#x7ED9;&#x5BF9;&#x8C61;&#x8D4B;&#x4E88;&#x4E86;&#x65B0;&#x503C;&#xFF0C;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x4E86;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BB2;&#xFF0C;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>&#x4E00;&#x662F;&#x5728;&#x5806;&#x4E2D;&#x7533;&#x8BF7;&#x4E86;&#x7A7A;&#x95F4;&#x6CA1;&#x6709;&#x88AB;&#x91CA;&#x653E;&#xFF1B;</p>
<p>&#x4E8C;&#x662F;&#x5BF9;&#x8C61;&#x5DF2;&#x4E0D;&#x518D;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x8FD8;&#x4ECD;&#x7136;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x7559;&#x7740;&#x3002;</p>
<p>&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x7684;&#x5F15;&#x5165;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x89E3;&#x51B3;&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF1B;&#x800C;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x5219;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x88AB;&#x91CA;&#x653E;&#x3002;&#x56E0;&#x6B64;Java&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x4E3B;&#x8981;&#x6307;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p>Java&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5BB9;&#x6613;&#x5F15;&#x8D77;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x7684;&#x539F;&#x56E0;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x9759;&#x6001;&#x96C6;&#x5408;&#x7C7B;&#xFF0C;&#x4F8B;&#x5982;HashMap&#x548C;Vector&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5BB9;&#x5668;&#x4E3A;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x58F0;&#x660E;&#x5468;&#x671F;&#x4E0E;&#x7A0B;&#x5E8F;&#x4E00;&#x81F4;&#xFF0C;&#x90A3;&#x4E48;&#x5BB9;&#x5668;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x5728;&#x7A0B;&#x5E8F;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#x5C06;&#x4E0D;&#x80FD;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x4ECE;&#x800C;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x5404;&#x79CD;&#x8FDE;&#x63A5;&#xFF0C;&#x4F8B;&#x5982;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8FDE;&#x63A5;&#x3001;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4EE5;&#x53CA;IO&#x8FDE;&#x63A5;&#x7B49;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x76D1;&#x542C;&#x5668;&#x3002;&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x76D1;&#x542C;&#x5668;&#x3002;&#x901A;&#x5E38;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#x4F1A;&#x7528;&#x5230;&#x591A;&#x4E2A;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x4F46;&#x5728;&#x91CA;&#x653E;&#x5BF9;&#x8C61;&#x7684;&#x540C;&#x65F6;&#x5F80;&#x5F80;&#x6CA1;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x5220;&#x9664;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x53D8;&#x91CF;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5927;&#x4E8E;&#x5176;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x53CA;&#x65F6;&#x5730;&#x628A;&#x5BF9;&#x8C61;&#x8BBE;&#x7F6E;&#x4E3A;Null&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x7684;&#x653E;&#x751F;&#xFF0C;<br>&#xFF08;5&#xFF09;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;</p>
<p>####16.14java &#x5185;&#x5B58;&#x6EA2;&#x51FA; &#x6808;&#x6EA2;&#x51FA;&#x7684;&#x539F;&#x56E0;&#x4E0E;&#x6392;&#x67E5;&#x65B9;&#x6CD5;<br>1&#x3001; &#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;<br>       &#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x662F;&#x7531;&#x4E8E;&#x6CA1;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x5783;&#x573E;&#xFF09;&#x8FC7;&#x591A;&#x9020;&#x6210;JVM&#x6CA1;&#x6709;&#x53CA;&#x65F6;&#x56DE;&#x6536;&#xFF0C;&#x9020;&#x6210;&#x7684;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x3002;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x53EF;&#x884C;&#x4EE3;&#x7801;&#x6392;&#x67E5;&#xFF1A;</p>
<p>&#x4E00;&#xFF09;&#x662F;&#x5426;App&#x4E2D;&#x7684;&#x7C7B;&#x4E2D;&#x548C;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x8FC7;&#x591A;&#x4F7F;&#x7528;&#x4E86;Static&#x4FEE;&#x9970; &#x5982;public staitc Student s&#xFF1B;&#x5728;&#x7C7B;&#x4E2D;&#x7684;&#x5C5E;&#x6027;&#x4E2D;&#x4F7F;&#x7528; static&#x4FEE;&#x9970;&#x7684;&#x6700;&#x597D;&#x53EA;&#x7528;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5982;public static int i = 0; //public static String str;</p>
<p>&#x4E8C;&#xFF09;&#x662F;&#x5426;App&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x9012;&#x5F52;&#x6216;&#x65E0;&#x9650;&#x9012;&#x5F52;&#xFF08;&#x9012;&#x5F52;&#x4E2D;&#x7528;&#x5230;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x5EFA;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#xFF09;</p>
<p>&#x4E09;&#xFF09;&#x662F;&#x5426;App&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x5927;&#x91CF;&#x5FAA;&#x73AF;&#x6216;&#x6B7B;&#x5FAA;&#x73AF;&#xFF08;&#x5FAA;&#x73AF;&#x4E2D;&#x7528;&#x5230;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x65B0;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#xFF09;</p>
<p>&#x56DB;&#xFF09;&#x68C0;&#x67E5;App&#x4E2D;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x4E86;&#x5411;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5373;&#x4E00;&#x6B21;&#x6027;&#x5168;&#x90E8;&#x67E5;&#x8BE2;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x91CF;&#x8D85;&#x8FC7;10&#x4E07;&#x591A;&#x6761;&#x4E86;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x67E5;&#x8BE2;&#x65F6;&#x5E94;&#x91C7;&#x7528;&#x201C;&#x5206;&#x9875;&#x67E5;&#x8BE2;&#x201D;&#x3002;</p>
<p>&#x4E94;&#xFF09;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6709;&#x6570;&#x7EC4;&#xFF0C;List&#xFF0C;Map&#x4E2D;&#x5B58;&#x653E;&#x7684;&#x662F;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x800C;&#x4E0D;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5F15;&#x7528;&#x4F1A;&#x8BA9;&#x5BF9;&#x5E94;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x80FD;&#x88AB;&#x91CA;&#x653E;&#x3002;&#x4F1A;&#x5927;&#x91CF;&#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<p>&#x516D;&#xFF09;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x4E86;&#x201C;&#x975E;&#x5B57;&#x9762;&#x91CF;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;+&#x201D;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x56E0;&#x4E3A;String&#x7C7B;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x201D;+&#x201D;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x8FC7;&#x591A;&#x4F1A;&#x9020;&#x6210;&#x65B0;String&#x5BF9;&#x8C61;&#x8FC7;&#x591A;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;JVM&#x6CA1;&#x6709;&#x53CA;&#x65F6;&#x56DE;&#x6536;&#x800C;&#x51FA;&#x73B0;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x3002;</p>
<p>2&#x3001;&#x6808;&#x6EA2;&#x51FA;&#x7684;&#x539F;&#x56E0;</p>
<p>&#x4E00;&#xFF09;&#x3001;&#x662F;&#x5426;&#x6709;&#x9012;&#x5F52;&#x8C03;&#x7528;</p>
<p>&#x4E8C;&#xFF09;&#x3001;&#x662F;&#x5426;&#x6709;&#x5927;&#x91CF;&#x5FAA;&#x73AF;&#x6216;&#x6B7B;&#x5FAA;&#x73AF;</p>
<p>&#x4E09;&#xFF09;&#x3001;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x662F;&#x5426;&#x8FC7;&#x591A;</p>
<p>&#x56DB;&#xFF09;&#x3001; &#x6570;&#x7EC4;&#x3001;List&#x3001;map&#x6570;&#x636E;&#x662F;&#x5426;&#x8FC7;&#x5927;</p>
<p>&#x4E94;&#xFF09;&#x4F7F;&#x7528;DDMS&#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#x5927;&#x6982;&#x51FA;&#x73B0;&#x6808;&#x6EA2;&#x51FA;&#x7684;&#x4F4D;&#x7F6E;</p>
<p>###17.&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#xFF1F;<br>&#x7EBF;&#x7A0B;&#x662F;&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#xFF0C;&#x662F;CPU&#x8C03;&#x5EA6;&#x548C;&#x5206;&#x6D3E;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x5B83;&#x662F;&#x6BD4;&#x8FDB;&#x7A0B;&#x66F4;&#x5C0F;&#x7684;&#x80FD;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x3002;&#x7EBF;&#x7A0B;&#x81EA;&#x5DF1;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x62E5;&#x6709;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF0C;&#x53EA;&#x62E5;&#x6709;&#x4E00;&#x70B9;&#x5728;&#x8FD0;&#x884C;&#x4E2D;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x8D44;&#x6E90;(&#x5982;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x4E00;&#x7EC4;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x6808;)&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x4E0E;&#x540C;&#x5C5E;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5176;&#x4ED6;&#x7684;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x8FDB;&#x7A0B;&#x6240;&#x62E5;&#x6709;&#x7684;&#x5168;&#x90E8;&#x8D44;&#x6E90;&#x3002;</p>
<p>####18.&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x4F18;&#x70B9;<br>&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x66F4;&#x597D;<br>&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x66F4;&#x7B80;&#x5355;<br>&#x7A0B;&#x5E8F;&#x54CD;&#x5E94;&#x66F4;&#x5FEB;</p>
<p>###19.JAVA&#x591A;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x7684;&#x56DB;&#x79CD;&#x65B9;&#x5F0F;<br>1&#x3001;&#x7EE7;&#x627F;Thread&#x7C7B;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;<br>Thread&#x7C7B;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5B9E;&#x73B0;&#x4E86;Runnable&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x901A;&#x8FC7;Thread&#x7C7B;&#x7684;start()&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;&#x3002;start()&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;native&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x5C06;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x6267;&#x884C;run()&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x591A;&#x7EBF;&#x7A0B;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x901A;&#x8FC7;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x76F4;&#x63A5;extend Thread&#xFF0C;&#x5E76;&#x590D;&#x5199;run()&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x65B0;&#x7EBF;&#x7A0B;&#x5E76;&#x6267;&#x884C;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;run()&#x65B9;&#x6CD5;&#x3002;<br>2&#x3001;&#x5B9E;&#x73B0;Runnable&#x63A5;&#x53E3;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;<br>&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x5DF2;&#x7ECF;extends&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;extends Thread&#xFF0C;&#x6B64;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;Runnable&#x63A5;&#x53E3;<br>3&#x3001;&#x5B9E;&#x73B0;Callable&#x63A5;&#x53E3;&#x901A;&#x8FC7;FutureTask&#x5305;&#x88C5;&#x5668;&#x6765;&#x521B;&#x5EFA;Thread&#x7EBF;&#x7A0B;<br>4&#x3001;&#x4F7F;&#x7528;ExecutorService&#x3001;Callable&#x3001;Future&#x5B9E;&#x73B0;&#x6709;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x7684;&#x7EBF;&#x7A0B;<br>ExecutorService&#x3001;Callable&#x3001;Future&#x4E09;&#x4E2A;&#x63A5;&#x53E3;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x662F;&#x5C5E;&#x4E8E;Executor&#x6846;&#x67B6;&#x3002;<br>&#x53EF;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x4EFB;&#x52A1;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;Callable&#x63A5;&#x53E3;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x65E0;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x4EFB;&#x52A1;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;Runnable&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x6267;&#x884C;Callable&#x4EFB;&#x52A1;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;Future&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;&#x8BE5;&#x5BF9;&#x8C61;&#x4E0A;&#x8C03;&#x7528;get&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;Callable&#x4EFB;&#x52A1;&#x8FD4;&#x56DE;&#x7684;Object&#x4E86;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;get&#x65B9;&#x6CD5;&#x662F;&#x963B;&#x585E;&#x7684;&#xFF0C;&#x5373;&#xFF1A;&#x7EBF;&#x7A0B;&#x65E0;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;get&#x65B9;&#x6CD5;&#x4F1A;&#x4E00;&#x76F4;&#x7B49;&#x5F85;&#x3002;</p>
<p>&#x518D;&#x7ED3;&#x5408;&#x7EBF;&#x7A0B;&#x6C60;&#x63A5;&#x53E3;ExecutorService&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4F20;&#x8BF4;&#x4E2D;&#x6709;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x4E86;&#x3002;</p>
<p>Executors&#x7C7B;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;ExecutorService&#x63A5;&#x53E3;&#x3002;<br>public static ExecutorService newFixedThreadPool(int nThreads)<br>&#x521B;&#x5EFA;&#x56FA;&#x5B9A;&#x6570;&#x76EE;&#x7EBF;&#x7A0B;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#x3002;<br>public static ExecutorService newCachedThreadPool()<br>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EF;&#x7F13;&#x5B58;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x8C03;&#x7528;execute &#x5C06;&#x91CD;&#x7528;&#x4EE5;&#x524D;&#x6784;&#x9020;&#x7684;&#x7EBF;&#x7A0B;&#xFF08;&#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x53EF;&#x7528;&#xFF09;&#x3002;&#x5982;&#x679C;&#x73B0;&#x6709;&#x7EBF;&#x7A0B;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7684;&#xFF0C;&#x5219;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7EBF;&#x7A0B;&#x5E76;&#x6DFB;&#x52A0;&#x5230;&#x6C60;&#x4E2D;&#x3002;&#x7EC8;&#x6B62;&#x5E76;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x79FB;&#x9664;&#x90A3;&#x4E9B;&#x5DF2;&#x6709; 60 &#x79D2;&#x949F;&#x672A;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x7EBF;&#x7A0B;&#x3002;<br>public static ExecutorService newSingleThreadExecutor()<br>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5355;&#x7EBF;&#x7A0B;&#x5316;&#x7684;Executor&#x3002;<br>public static ScheduledExecutorService newScheduledThreadPool(int corePoolSize)<br>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x652F;&#x6301;&#x5B9A;&#x65F6;&#x53CA;&#x5468;&#x671F;&#x6027;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x7528;&#x6765;&#x66FF;&#x4EE3;Timer&#x7C7B;&#x3002;</p>
<p>ExecutoreService&#x63D0;&#x4F9B;&#x4E86;submit()&#x65B9;&#x6CD5;&#xFF0C;&#x4F20;&#x9012;&#x4E00;&#x4E2A;Callable&#xFF0C;&#x6216;Runnable&#xFF0C;&#x8FD4;&#x56DE;Future&#x3002;&#x5982;&#x679C;Executor&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x6C60;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x6210;Callable&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x8C03;&#x7528;&#x8FD4;&#x56DE;Future&#x5BF9;&#x8C61;&#x7684;get()&#x65B9;&#x6CD5;&#xFF0C;&#x4F1A;&#x963B;&#x585E;&#x76F4;&#x5230;&#x8BA1;&#x7B97;&#x5B8C;&#x6210;&#x3002;</p>
<p>###20.&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#x7684;&#x5FD9;&#x5FAA;&#x73AF;&#x662F;&#x4EC0;&#x4E48;?<br>&#x5FD9;&#x5FAA;&#x73AF;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x7528;&#x5FAA;&#x73AF;&#x8BA9;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#xFF0C;&#x4E0D;&#x50CF;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;wait(), sleep() &#x6216; yield() &#x5B83;&#x4EEC;&#x90FD;&#x653E;&#x5F03;&#x4E86;CPU&#x63A7;&#x5236;&#xFF0C;&#x800C;&#x5FD9;&#x5FAA;&#x73AF;&#x4E0D;&#x4F1A;&#x653E;&#x5F03;CPU&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x7A7A;&#x5FAA;&#x73AF;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x4FDD;&#x7559;CPU&#x7F13;&#x5B58;&#xFF0C;&#x5728;&#x591A;&#x6838;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x7B49;&#x5F85;&#x7EBF;&#x7A0B;&#x9192;&#x6765;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x91CD;&#x5EFA;&#x7F13;&#x5B58;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x91CD;&#x5EFA;&#x7F13;&#x5B58;&#x548C;&#x51CF;&#x5C11;&#x7B49;&#x5F85;&#x91CD;&#x5EFA;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4E86;&#x3002;</p>
<p>###21.Java&#x4E2D;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;start&#x548C;run&#x65B9;&#x6CD5;<br>&#x4E00;&#x3001;&#x533A;&#x522B;<br>Java&#x4E2D;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x7EE7;&#x627F;Thread&#x7C7B;&#x548C;&#x5B9E;&#x73B0;Runnable&#x63A5;&#x53E3;&#xFF0C;&#x7531;&#x4E8E;Java&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x901A;&#x8FC7;&#x5B9E;&#x73B0;Runnable&#x63A5;&#x53E3;&#x6765;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x3002;&#x4F46;&#x662F;&#x65E0;&#x8BBA;&#x54EA;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;start()&#x548C;run()&#x65B9;&#x6CD5;&#x6765;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x6765;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x4ED6;&#x4EEC;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p>start&#x65B9;&#x6CD5;&#xFF1A;<br>&#x901A;&#x8FC7;&#x8BE5;&#x65B9;&#x6CD5;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x771F;&#x6B63;&#x5B9E;&#x73B0;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x3002;&#x65E0;&#x9700;&#x7B49;&#x5F85;run()&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x63A5;&#x7740;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6B64;&#x65F6;start()&#x7684;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x5904;&#x4E8E;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF0C;&#x5F53;&#x5F97;&#x5230;CPU&#x7684;&#x65F6;&#x95F4;&#x7247;&#x540E;&#x5C31;&#x4F1A;&#x6267;&#x884C;&#x5176;&#x4E2D;&#x7684;run()&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;run()&#x65B9;&#x6CD5;&#x5305;&#x542B;&#x4E86;&#x8981;&#x6267;&#x884C;&#x7684;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5185;&#x5BB9;&#xFF0C;run()&#x65B9;&#x6CD5;&#x8FD0;&#x884C;&#x7ED3;&#x675F;&#xFF0C;&#x6B64;&#x7EBF;&#x7A0B;&#x4E5F;&#x5C31;&#x7EC8;&#x6B62;&#x4E86;&#x3002;</p>
<p>run&#x65B9;&#x6CD5;&#xFF1A;<br>&#x901A;&#x8FC7;run&#x65B9;&#x6CD5;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5F53;&#x4F5C;&#x666E;&#x901A;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x65B9;&#x5F0F;&#x8C03;&#x7528;&#x3002;&#x5E76;&#x6CA1;&#x6709;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F9D;&#x65E7;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x5FC5;&#x987B;&#x7B49;&#x5230;run()&#x65B9;&#x6CD5;&#x91CC;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x624D;&#x4F1A;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x5199;&#x7EBF;&#x7A0B;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>###22.&#x7EBF;&#x7A0B;&#x7684;sleep()&#x65B9;&#x6CD5;&#x548C;yield()&#x65B9;&#x6CD5;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;<br>&#x2460; sleep()&#x65B9;&#x6CD5;&#x7ED9;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x673A;&#x4F1A;&#x65F6;&#x4E0D;&#x8003;&#x8651;&#x7EBF;&#x7A0B;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x7ED9;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x7EBF;&#x7A0B;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#x673A;&#x4F1A;&#xFF1B;yield()&#x65B9;&#x6CD5;&#x53EA;&#x4F1A;&#x7ED9;&#x76F8;&#x540C;&#x4F18;&#x5148;&#x7EA7;&#x6216;&#x66F4;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x7EBF;&#x7A0B;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#x673A;&#x4F1A;;</p>
<p>&#x2461; &#x7EBF;&#x7A0B;&#x6267;&#x884C;sleep()&#x65B9;&#x6CD5;&#x540E;&#x8F6C;&#x5165;&#x963B;&#x585E;&#xFF08;blocked&#xFF09;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x6267;&#x884C;yield()&#x65B9;&#x6CD5;&#x540E;&#x8F6C;&#x5165;&#x5C31;&#x7EEA;&#xFF08;ready&#xFF09;&#x72B6;&#x6001;;</p>
<p>&#x2462; sleep()&#x65B9;&#x6CD5;&#x58F0;&#x660E;&#x629B;&#x51FA;InterruptedException&#xFF0C;&#x800C;yield()&#x65B9;&#x6CD5;&#x6CA1;&#x6709;&#x58F0;&#x660E;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;; </p>
<p>&#x2463; sleep()&#x65B9;&#x6CD5;&#x6BD4;yield()&#x65B9;&#x6CD5;&#xFF08;&#x8DDF;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;CPU&#x8C03;&#x5EA6;&#x76F8;&#x5173;&#xFF09;&#x5177;&#x6709;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;.</p>
<p>###23.Java&#x505C;&#x6B62;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;<br>1&#x3001;Java&#x4E2D;API&#x81EA;&#x5E26;&#x7684;stop()&#x65B9;&#x6CD5;&#xFF0C;&#x6765;&#x7EC8;&#x6B62;&#x7EBF;&#x7A0B;</p>
<pre><code>&#x67E5;&#x9605;JDK&#xFF0C;&#x4E0D;&#x96BE;&#x53D1;&#x73B0;Thread&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;stop()&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;stop()&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x88AB;&#x5E9F;&#x5F03;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;stop()&#x65B9;&#x6CD5;&#x88AB;&#x5E9F;&#x5F03;&#x800C;&#x4E0D;&#x88AB;&#x4F7F;&#x7528;&#x5462;&#xFF1F;&#x539F;&#x56E0;&#x662F;stop()&#x65B9;&#x6CD5;&#x592A;&#x8FC7;&#x4E8E;&#x66B4;&#x529B;&#xFF0C;&#x4F1A;&#x5F3A;&#x884C;&#x628A;&#x6267;&#x884C;&#x4E00;&#x534A;&#x7684;&#x7EBF;&#x7A0B;&#x7EC8;&#x6B62;&#x3002;&#x8FD9;&#x6837;&#x4F1A;&#x5C31;&#x4E0D;&#x4F1A;&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B;&#x7684;&#x8D44;&#x6E90;&#x6B63;&#x786E;&#x91CA;&#x653E;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x6CA1;&#x6709;&#x7ED9;&#x4E0E;&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#x8D44;&#x6E90;&#x91CA;&#x653E;&#x5DE5;&#x4F5C;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5DE5;&#x4F5C;&#x5728;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#x4E0B;&#x3002;
</code></pre><p>2&#x3001;&#x4F7F;&#x7528;boolean&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6765;&#x7EC8;&#x6B62;&#x7EBF;&#x7A0B;</p>
<pre><code>&#x90A3;&#x4E48;&#x5982;&#x679C;&#x9700;&#x8981;&#x505C;&#x6B62;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5176;&#x5B9E;&#x65B9;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x662F;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x6267;&#x884C;&#x786E;&#x5B9A;&#x7EBF;&#x7A0B;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9000;&#x51FA;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;
</code></pre><p>3&#x3001;java&#x7EBF;&#x7A0B;&#x7684;&#x4E2D;&#x65AD;</p>
<pre><code>&#x4E2D;&#x65AD;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x7EBF;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x6807;&#x8BC6;&#x4F4D;&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x662F;&#x5426;&#x88AB;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x4E86;&#x4E2D;&#x65AD;&#x64CD;&#x4F5C;&#x3002;&#x4E2D;&#x65AD;&#x597D;&#x6BD4;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5BF9;&#x8BE5;&#x7EBF;&#x7A0B;&#x6253;&#x4E86;&#x4E2A;&#x62DB;&#x547C;&#xFF0C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x8BE5;&#x7EBF;&#x7A0B;&#x7684;interrupt()&#x65B9;&#x6CD5;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4E2D;&#x65AD;&#x64CD;&#x4F5C;&#x3002;

&#x7EBF;&#x7A0B;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x81EA;&#x8EAB;&#x662F;&#x5426;&#x88AB;&#x4E2D;&#x65AD;&#x6765;&#x8FDB;&#x884C;&#x54CD;&#x5E94;&#xFF0C;&#x7EBF;&#x7A0B;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;isInterrupted()&#x6765;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x662F;&#x5426;&#x88AB;&#x4E2D;&#x65AD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x9759;&#x6001;&#x65B9;&#x6CD5;Thread.interrupted()&#x5BF9;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;&#x4E2D;&#x65AD;&#x6807;&#x8BC6;&#x4F4D;&#x8FDB;&#x884C;&#x590D;&#x4F4D;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x5904;&#x4E8E;&#x7EC8;&#x7ED3;&#x72B6;&#x6001;&#xFF0C;&#x5373;&#x4F7F;&#x8BE5;&#x7EBF;&#x7A0B;&#x88AB;&#x4E2D;&#x65AD;&#x8FC7;&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x8BE5;&#x7EBF;&#x7A0B;&#x5BF9;&#x8C61;&#x7684;isInterrupted()&#x65F6;&#x4F9D;&#x65E7;&#x4F1A;&#x8FD4;&#x56DE;false&#x3002;

&#x4ECE;Java&#x7684;API&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8BB8;&#x591A;&#x58F0;&#x660E;&#x629B;&#x51FA;InterruptedException&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x4F8B;&#x5982;Thread.sleep(longmillis)&#x65B9;&#x6CD5;&#xFF0C;&#x5F53;&#x7EBF;&#x7A0B;&#x5728;sleep()&#x4F11;&#x7720;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x88AB;&#x4E2D;&#x65AD;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5728;&#x629B;&#x51FA;InterruptedException&#x4E4B;&#x524D;&#xFF0C;Java&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x5148;&#x5C06;&#x8BE5;&#x7EBF;&#x7A0B;&#x7684;&#x4E2D;&#x65AD;&#x6807;&#x8BC6;&#x4F4D;&#x6E05;&#x9664;&#xFF0C;&#x7136;&#x540E;&#x629B;&#x51FA;InterruptedException&#xFF0C;&#x6B64;&#x65F6;&#x8C03;&#x7528;isInterrupted()&#x65B9;&#x6CD5;&#x5C06;&#x4F1A;&#x8FD4;&#x56DE;false&#x3002;
</code></pre><p>4&#x3001;&#x4F7F;&#x7528;&#x4E2D;&#x65AD;&#x6765;&#x7EC8;&#x6B62;&#x7EBF;&#x7A0B;</p>
<p>###24.&#x591A;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;<br>1&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x76F8;&#x540C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x4E2A;Runnable&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;Runnable&#x5BF9;&#x8C61;&#x4E2D;&#x6709;&#x90A3;&#x4E2A;&#x5171;&#x4EAB;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5356;&#x7968;&#x7CFB;&#x7EDF;&#x5C31;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>
<p>2&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x9700;&#x8981;&#x7528;&#x4E0D;&#x540C;&#x7684;Runnable&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x8BBE;&#x8BA1;4&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;&#x5176;&#x4E2D;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x6BCF;&#x6B21;&#x5BF9;j&#x589E;&#x52A0;1&#xFF0C;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5BF9;j&#x6BCF;&#x6B21;&#x51CF;1&#xFF0C;&#x94F6;&#x884C;&#x5B58;&#x53D6;&#x6B3E;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x6B64;&#x7C7B;&#x95EE;&#x9898;</p>
<p>&#x5C06;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x5C01;&#x88C5;&#x6210;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x9010;&#x4E00;&#x4F20;&#x9012;&#x7ED9;&#x5404;&#x4E2A;Runnable&#x5BF9;&#x8C61;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5BF9;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#x4E5F;&#x5206;&#x914D;&#x5230;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#x8EAB;&#x4E0A;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x6837;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x9488;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5404;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x4E92;&#x65A5;&#x548C;&#x901A;&#x4FE1;</p>
<p>&#x5C06;Runnable&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x7C7B;&#xFF0C;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5BF9;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#x4E5F;&#x5C01;&#x88C5;&#x5728;&#x5916;&#x90E8;&#x7C7B;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B9E;&#x73B0;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x5404;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x540C;&#x6B65;&#x548C;&#x4E92;&#x65A5;&#xFF0C;&#x4F5C;&#x4E3A;&#x5185;&#x90E8;&#x7C7B;&#x7684;&#x5404;&#x4E2A;Runnable&#x5BF9;&#x8C61;&#x8C03;&#x7528;&#x5916;&#x90E8;&#x7C7B;&#x7684;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x3002;</p>
<p>###25.&#x7EBF;&#x7A0B;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;<br>&#x7EBF;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x4ECE;&#x4EA7;&#x751F;&#x5230;&#x6B7B;&#x4EA1;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>(1)&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x4E94;&#x79CD;&#x72B6;&#x6001;</p>
<p>   &#x65B0;&#x5EFA;&#xFF08;new Thread&#xFF09;<br>&#x5F53;&#x521B;&#x5EFA;Thread&#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF08;&#x5BF9;&#x8C61;&#xFF09;&#x65F6;&#xFF0C;&#x6B64;&#x7EBF;&#x7A0B;&#x8FDB;&#x5165;&#x65B0;&#x5EFA;&#x72B6;&#x6001;&#xFF08;&#x672A;&#x88AB;&#x542F;&#x52A8;&#xFF09;&#x3002;<br>&#x4F8B;&#x5982;&#xFF1A;Thread  t1=new Thread();</p>
<p>&#x5C31;&#x7EEA;&#xFF08;runnable&#xFF09;<br>&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x88AB;&#x542F;&#x52A8;&#xFF0C;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x88AB;&#x5206;&#x914D;&#x7ED9;CPU&#x65F6;&#x95F4;&#x7247;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6B64;&#x65F6;&#x7EBF;&#x7A0B;&#x6B63;&#x5728;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x4E2D;&#x6392;&#x961F;&#x7B49;&#x5019;&#x5F97;&#x5230;CPU&#x8D44;&#x6E90;&#x3002;&#x4F8B;&#x5982;&#xFF1A;t1.start();</p>
<p>&#x8FD0;&#x884C;&#xFF08;running&#xFF09;<br>&#x7EBF;&#x7A0B;&#x83B7;&#x5F97;CPU&#x8D44;&#x6E90;&#x6B63;&#x5728;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF08;run()&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x6B64;&#x65F6;&#x9664;&#x975E;&#x6B64;&#x7EBF;&#x7A0B;&#x81EA;&#x52A8;&#x653E;&#x5F03;CPU&#x8D44;&#x6E90;&#x6216;&#x8005;&#x6709;&#x4F18;&#x5148;&#x7EA7;&#x66F4;&#x9AD8;&#x7684;&#x7EBF;&#x7A0B;&#x8FDB;&#x5165;&#xFF0C;&#x7EBF;&#x7A0B;&#x5C06;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x5230;&#x7ED3;&#x675F;&#x3002;</p>
<p>&#x6B7B;&#x4EA1;&#xFF08;dead&#xFF09;<br>&#x5F53;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x6216;&#x88AB;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x6740;&#x6B7B;&#xFF0C;&#x7EBF;&#x7A0B;&#x5C31;&#x8FDB;&#x5165;&#x6B7B;&#x4EA1;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x65F6;&#x7EBF;&#x7A0B;&#x4E0D;&#x53EF;&#x80FD;&#x518D;&#x8FDB;&#x5165;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x7B49;&#x5F85;&#x6267;&#x884C;&#x3002;</p>
<p>&#x81EA;&#x7136;&#x7EC8;&#x6B62;&#xFF1A;&#x6B63;&#x5E38;&#x8FD0;&#x884C;run()&#x65B9;&#x6CD5;&#x540E;&#x7EC8;&#x6B62;</p>
<p>&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#xFF1A;&#x8C03;&#x7528;stop()&#x65B9;&#x6CD5;&#x8BA9;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7EC8;&#x6B62;&#x8FD0;&#x884C;</p>
<p>&#x5835;&#x585E;&#xFF08;blocked&#xFF09;<br>&#x7531;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x5BFC;&#x81F4;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7EBF;&#x7A0B;&#x8BA9;&#x51FA;CPU&#x5E76;&#x6682;&#x505C;&#x81EA;&#x5DF1;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5373;&#x8FDB;&#x5165;&#x5835;&#x585E;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6B63;&#x5728;&#x7761;&#x7720;&#xFF1A;&#x7528;sleep(long t) &#x65B9;&#x6CD5;&#x53EF;&#x4F7F;&#x7EBF;&#x7A0B;&#x8FDB;&#x5165;&#x7761;&#x7720;&#x65B9;&#x5F0F;&#x3002;&#x4E00;&#x4E2A;&#x7761;&#x7720;&#x7740;&#x7684;&#x7EBF;&#x7A0B;&#x5728;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x8FC7;&#x53BB;&#x53EF;&#x8FDB;&#x5165;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6B63;&#x5728;&#x7B49;&#x5F85;&#xFF1A;&#x8C03;&#x7528;wait()&#x65B9;&#x6CD5;&#x3002;&#xFF08;&#x8C03;&#x7528;motify()&#x65B9;&#x6CD5;&#x56DE;&#x5230;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF09;</p>
<p>&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6240;&#x963B;&#x585E;&#xFF1A;&#x8C03;&#x7528;suspend()&#x65B9;&#x6CD5;&#x3002;&#xFF08;&#x8C03;&#x7528;resume()&#x65B9;&#x6CD5;&#x6062;&#x590D;&#xFF09;</p>
<p>###26.&#x6DF1;&#x5165;&#x5256;&#x6790;ThreadLocal&#x5B9E;&#x73B0;&#x539F;&#x7406;<br>&#x7EBF;&#x7A0B;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x7684;&#x529F;&#x7528;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x503C;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x6539;&#x53D8;&#x81EA;&#x5DF1;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x548C;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x7684;&#x526F;&#x672C;&#x51B2;&#x7A81;&#x3002;&#x4ECE;&#x7EBF;&#x7A0B;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x6BCF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x5B8C;&#x5168;&#x62E5;&#x6709;&#x8BE5;&#x53D8;&#x91CF;&#x3002;</p>
<p>ThreadLocal&#x7684;&#x539F;&#x7406;<br>ThreadLocal&#x662F;&#x5982;&#x4F55;&#x505A;&#x5230;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7EF4;&#x62A4;&#x53D8;&#x91CF;&#x7684;&#x526F;&#x672C;&#x7684;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x5B9E;&#x73B0;&#x7684;&#x601D;&#x8DEF;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5728;ThreadLocal&#x7C7B;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;Map&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x6BCF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x526F;&#x672C;&#x3002;</p>
<p>###27.&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x6C60;&#xFF1F;<br>&#x7EBF;&#x7A0B;&#x6C60;&#x662F;&#x6307;&#x5728;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x591A;&#x7EBF;&#x7A0B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FC7;&#x7A0B;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x96C6;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9700;&#x8981;&#x6267;&#x884C;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#x65F6;&#x91CD;&#x7528;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x800C;&#x4E0D;&#x662F;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;&#x7EBF;&#x7A0B;&#x6C60;&#x4E2D;&#x7EBF;&#x7A0B;&#x7684;&#x6570;&#x91CF;&#x901A;&#x5E38;&#x5B8C;&#x5168;&#x53D6;&#x51B3;&#x4E8E;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9700;&#x6C42;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x589E;&#x52A0;&#x53EF;&#x7528;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x7EBF;&#x7A0B;&#x6C60;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x6709;&#x88AB;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x4E00;&#x65E6;&#x4EFB;&#x52A1;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x7EBF;&#x7A0B;&#x56DE;&#x5230;&#x6C60;&#x5B50;&#x4E2D;&#x5E76;&#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x6B21;&#x5206;&#x914D;&#x4EFB;&#x52A1;&#x3002;</p>
<p>###28.&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x7EBF;&#x7A0B;&#x6C60;&#xFF1F;<br>&#x57FA;&#x4E8E;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF1A;</p>
<ol class="ui list">
<li><p>&#x7EBF;&#x7A0B;&#x6C60;&#x6539;&#x8FDB;&#x4E86;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3002;&#x7531;&#x4E8E;&#x7EBF;&#x7A0B;&#x6C60;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x4E14;&#x7B49;&#x5F85;&#x88AB;&#x5206;&#x914D;&#x4EFB;&#x52A1;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x62FF;&#x6765;&#x4F7F;&#x7528;&#x800C;&#x4E0D;&#x7528;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x6C60;&#x8282;&#x7701;&#x4E86;CLR &#x4E3A;&#x6BCF;&#x4E2A;&#x77ED;&#x751F;&#x5B58;&#x5468;&#x671F;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x5F00;&#x9500;&#x5E76;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x540E;&#x56DE;&#x6536;&#x8D44;&#x6E90;&#x3002;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x6C60;&#x6839;&#x636E;&#x5F53;&#x524D;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x6765;&#x4F18;&#x5316;&#x7EBF;&#x7A0B;&#x65F6;&#x95F4;&#x7247;&#x3002;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x6C60;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5F00;&#x542F;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x800C;&#x4E0D;&#x7528;&#x4E3A;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBE;&#x7F6E;&#x5C5E;&#x6027;&#x3002;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x6C60;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x4E3A;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x7684;&#x7A0B;&#x5E8F;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x3002;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x6C60;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x8BF7;&#x6C42;&#x6700;&#x5927;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x9650;&#x5236;&#x95EE;&#x9898;&#x3002;</p>
</li>
</ol>
<p>###29.Java &#x7EBF;&#x7A0B;&#x6C60; &#x56DB;&#x79CD;&#x521B;&#x5EFA;&#x65B9;&#x5F0F;<br>Java&#x901A;&#x8FC7;Executors&#x63D0;&#x4F9B;&#x56DB;&#x79CD;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x5206;&#x522B;&#x4E3A;&#xFF1A;<br>newCachedThreadPool&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EF;&#x7F13;&#x5B58;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x6C60;&#x957F;&#x5EA6;&#x8D85;&#x8FC7;&#x5904;&#x7406;&#x9700;&#x8981;&#xFF0C;&#x53EF;&#x7075;&#x6D3B;&#x56DE;&#x6536;&#x7A7A;&#x95F2;&#x7EBF;&#x7A0B;&#xFF0C;&#x82E5;&#x65E0;&#x53EF;&#x56DE;&#x6536;&#xFF0C;&#x5219;&#x65B0;&#x5EFA;&#x7EBF;&#x7A0B;&#x3002;<br>newFixedThreadPool &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B9A;&#x957F;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x53EF;&#x63A7;&#x5236;&#x7EBF;&#x7A0B;&#x6700;&#x5927;&#x5E76;&#x53D1;&#x6570;&#xFF0C;&#x8D85;&#x51FA;&#x7684;&#x7EBF;&#x7A0B;&#x4F1A;&#x5728;&#x961F;&#x5217;&#x4E2D;&#x7B49;&#x5F85;&#x3002;<br>newScheduledThreadPool &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B9A;&#x957F;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x652F;&#x6301;&#x5B9A;&#x65F6;&#x53CA;&#x5468;&#x671F;&#x6027;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x3002;<br>newSingleThreadExecutor &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5355;&#x7EBF;&#x7A0B;&#x5316;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x5B83;&#x53EA;&#x4F1A;&#x7528;&#x552F;&#x4E00;&#x7684;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x6309;&#x7167;&#x6307;&#x5B9A;&#x987A;&#x5E8F;(FIFO, LIFO, &#x4F18;&#x5148;&#x7EA7;)&#x6267;&#x884C;&#x3002;</p>
<p>###30.&#x5BF9;&#x7EBF;&#x7A0B;&#x6C60; ExecutorService &#x7684;&#x5173;&#x95ED;&#x7684;&#x7814;&#x7A76;<br>Java&#x63D0;&#x4F9B;&#x7684;&#x5BF9;ExecutorService&#x7684;&#x5173;&#x95ED;&#x65B9;&#x5F0F;&#x6709;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x8C03;&#x7528;&#x5176;shutdown()&#x65B9;&#x6CD5;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x8C03;&#x7528;shutdownNow()&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E24;&#x8005;&#x662F;&#x6709;&#x533A;&#x522B;&#x7684;&#x3002;<br>shutdown:</p>
<p>&#x8C03;&#x7528;&#x4E4B;&#x540E;&#x4E0D;&#x5141;&#x8BB8;&#x7EE7;&#x7EED;&#x5F80;&#x7EBF;&#x7A0B;&#x6C60;&#x5185;&#x7EE7;&#x7EED;&#x6DFB;&#x52A0;&#x7EBF;&#x7A0B;;<br>&#x7EBF;&#x7A0B;&#x6C60;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x4E3A;SHUTDOWN&#x72B6;&#x6001;;<br>&#x6240;&#x6709;&#x5728;&#x8C03;&#x7528;shutdown()&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#x63D0;&#x4EA4;&#x5230;ExecutorSrvice&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x4F1A;&#x6267;&#x884C;;<br>&#x4E00;&#x65E6;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x6267;&#x884C;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#xFF0C;ExecutorService&#x624D;&#x4F1A;&#x771F;&#x6B63;&#x5173;&#x95ED;&#x3002;<br>shutdownNow():</p>
<p>&#x8BE5;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x5C1A;&#x672A;&#x6267;&#x884C;&#x7684; task &#x7684; List;<br>&#x7EBF;&#x7A0B;&#x6C60;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x4E3A;STOP&#x72B6;&#x6001;;<br>&#x963B;&#x6B62;&#x6240;&#x6709;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x542F;&#x52A8;&#x7684;&#x4EFB;&#x52A1;, &#x5E76;&#x4E14;&#x505C;&#x6B62;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;;<br>&#x7B80;&#x5355;&#x70B9;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;:<br>shutdown()&#x8C03;&#x7528;&#x540E;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x518D; submit &#x65B0;&#x7684; task&#xFF0C;&#x5DF2;&#x7ECF; submit &#x7684;&#x5C06;&#x7EE7;&#x7EED;&#x6267;&#x884C;<br>shutdownNow()&#x8C03;&#x7528;&#x540E;&#xFF0C;&#x8BD5;&#x56FE;&#x505C;&#x6B62;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684; task&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x5C1A;&#x672A;&#x6267;&#x884C;&#x7684; task &#x7684; list</p>
<p>###31. &#x7EBF;&#x7A0B;&#x6C60;&#x7684;submit&#x548C;execute&#x65B9;&#x6CD5;&#x533A;&#x522B;<br>1&#x3001;&#x63A5;&#x6536;&#x7684;&#x53C2;&#x6570;&#x4E0D;&#x4E00;&#x6837;<br>2&#x3001;submit&#x6709;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x800C;execute&#x6CA1;&#x6709;<br>3&#x3001;submit&#x65B9;&#x4FBF;Exception&#x5904;&#x7406;</p>
<p>###32.&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x5206;&#x6790;<br><a href="http://" target="_blank" rel="external">https://blog.csdn.net/sscsgss/article/details/574510</a></p>
<p>###33.JAVA&#x4E2D;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x65B9;&#x6CD5;&#xFF08;7&#x79CD;&#xFF09;&#x6C47;&#x603B;<br>&#x4E00;&#x3001;&#x540C;&#x6B65;&#x65B9;&#x6CD5;<br>&#x3000;&#x3000;&#x5373;&#x6709;synchronized&#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x7531;&#x4E8E;java&#x7684;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x9501;&#xFF0C;&#x5F53;&#x7528;&#x6B64;&#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C; &#x5185;&#x7F6E;&#x9501;&#x4F1A;&#x4FDD;&#x62A4;&#x6574;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x83B7;&#x5F97;&#x5185;&#x7F6E;&#x9501;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x5904;&#x4E8E;&#x963B;&#x585E;&#x72B6;&#x6001;&#x3002;<br>&#x6CE8;&#xFF1A; synchronized&#x5173;&#x952E;&#x5B57;&#x4E5F;&#x53EF;&#x4EE5;&#x4FEE;&#x9970;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#xFF0C;&#x6B64;&#x65F6;&#x5982;&#x679C;&#x8C03;&#x7528;&#x8BE5;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;&#x4F1A;&#x9501;&#x4F4F;&#x6574;&#x4E2A;&#x7C7B;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;<br>&#x3000;&#x3000;&#x5373;&#x6709;synchronized&#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x7684;&#x8BED;&#x53E5;&#x5757;&#x3002; &#x88AB;&#x8BE5;&#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x7684;&#x8BED;&#x53E5;&#x5757;&#x4F1A;&#x81EA;&#x52A8;&#x88AB;&#x52A0;&#x4E0A;&#x5185;&#x7F6E;&#x9501;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x540C;&#x6B65;<br>&#x4E09;&#x3001;wait&#x4E0E;notify<br>wait():&#x4F7F;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5904;&#x4E8E;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x4E14;&#x91CA;&#x653E;&#x6240;&#x6301;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x7684;lock&#x3002;<br>sleep():&#x4F7F;&#x4E00;&#x4E2A;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7EBF;&#x7A0B;&#x5904;&#x4E8E;&#x7761;&#x7720;&#x72B6;&#x6001;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#xFF0C;&#x8C03;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x8981;&#x6355;&#x6349;InterruptedException&#x5F02;&#x5E38;&#x3002;<br>notify():&#x5524;&#x9192;&#x4E00;&#x4E2A;&#x5904;&#x4E8E;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x5728;&#x8C03;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x786E;&#x5207;&#x7684;&#x5524;&#x9192;&#x67D0;&#x4E00;&#x4E2A;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x662F;&#x7531;JVM&#x786E;&#x5B9A;&#x5524;&#x9192;&#x54EA;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x662F;&#x6309;&#x4F18;&#x5148;&#x7EA7;&#x3002;<br>Allnotity():&#x5524;&#x9192;&#x6240;&#x6709;&#x5904;&#x5165;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x6CE8;&#x610F;&#x5E76;&#x4E0D;&#x662F;&#x7ED9;&#x6240;&#x6709;&#x5524;&#x9192;&#x7EBF;&#x7A0B;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x9501;&#xFF0C;&#x800C;&#x662F;&#x8BA9;&#x5B83;&#x4EEC;&#x7ADE;&#x4E89;&#x3002;</p>
<p>&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x57DF;&#x53D8;&#x91CF;(volatile)&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;<br>    a.volatile&#x5173;&#x952E;&#x5B57;&#x4E3A;&#x57DF;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x514D;&#x9501;&#x673A;&#x5236;<br>    b.&#x4F7F;&#x7528;volatile&#x4FEE;&#x9970;&#x57DF;&#x76F8;&#x5F53;&#x4E8E;&#x544A;&#x8BC9;&#x865A;&#x62DF;&#x673A;&#x8BE5;&#x57DF;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x66F4;&#x65B0;<br>    c.&#x56E0;&#x6B64;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x8BE5;&#x57DF;&#x5C31;&#x8981;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x503C;<br>    d.volatile&#x4E0D;&#x4F1A;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#x6765;&#x4FEE;&#x9970;final&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF; </p>
<p>&#x4E94;&#x3001;&#x4F7F;&#x7528;&#x91CD;&#x5165;&#x9501;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;<br> ReentrantLock&#x7C7B;&#x662F;&#x53EF;&#x91CD;&#x5165;&#x3001;&#x4E92;&#x65A5;&#x3001;&#x5B9E;&#x73B0;&#x4E86;Lock&#x63A5;&#x53E3;&#x7684;&#x9501;&#xFF0C;&#x5B83;&#x4E0E;&#x4F7F;&#x7528;synchronized&#x65B9;&#x6CD5;&#x548C;&#x5FEB;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x57FA;&#x672C;&#x884C;&#x4E3A;&#x548C;&#x8BED;&#x4E49;&#xFF0C;&#x5E76;&#x4E14;&#x6269;&#x5C55;&#x4E86;&#x5176;&#x80FD;&#x529B;&#x3002;<br> ReentrantLock()&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x516C;&#x5E73;&#x9501;&#x7684;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x80FD;&#x5927;&#x5E45;&#x5EA6;&#x964D;&#x4F4E;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;<br> &#x5173;&#x4E8E;Lock&#x5BF9;&#x8C61;&#x548C;synchronized&#x5173;&#x952E;&#x5B57;&#x7684;&#x9009;&#x62E9;&#xFF1A;<br>        a.&#x6700;&#x597D;&#x4E24;&#x4E2A;&#x90FD;&#x4E0D;&#x7528;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x79CD;java.util.concurrent&#x5305;&#x63D0;&#x4F9B;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x5904;&#x7406;&#x6240;&#x6709;&#x4E0E;&#x9501;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x3002;<br>        b.&#x5982;&#x679C;synchronized&#x5173;&#x952E;&#x5B57;&#x80FD;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5C31;&#x7528;synchronized&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x80FD;&#x7B80;&#x5316;&#x4EE3;&#x7801;<br>        c.&#x5982;&#x679C;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5C31;&#x7528;ReentrantLock&#x7C7B;&#xFF0C;&#x6B64;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#x53CA;&#x65F6;&#x91CA;&#x653E;&#x9501;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x51FA;&#x73B0;&#x6B7B;&#x9501;&#xFF0C;&#x901A;&#x5E38;&#x5728;finally&#x4EE3;&#x7801;&#x91CA;&#x653E;&#x9501; </p>
<p>&#x516D;&#x3001;&#x4F7F;&#x7528;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;<br>    &#x5982;&#x679C;&#x4F7F;&#x7528;ThreadLocal&#x7BA1;&#x7406;&#x53D8;&#x91CF;&#xFF0C;&#x5219;&#x6BCF;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x83B7;&#x5F97;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x526F;&#x672C;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x8FD9;&#x6837;&#x6BCF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x4FEE;&#x6539;&#x81EA;&#x5DF1;&#x7684;&#x53D8;&#x91CF;&#x526F;&#x672C;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5BF9;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x4E03;&#x3001;&#x4F7F;&#x7528;&#x963B;&#x585E;&#x961F;&#x5217;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;</p>
<p>###34.Synchronized&#x4E0E;ReentrantLock&#x7684;&#x533A;&#x522B;<br>&#x76F8;&#x4F3C;&#x70B9;&#xFF1A;</p>
<pre><code>&#x8FD9;&#x4E24;&#x79CD;&#x540C;&#x6B65;&#x65B9;&#x5F0F;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x52A0;&#x9501;&#x65B9;&#x5F0F;&#x540C;&#x6B65;&#xFF0C;&#x800C;&#x4E14;&#x90FD;&#x662F;&#x963B;&#x585E;&#x5F0F;&#x7684;&#x540C;&#x6B65;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5F53;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x83B7;&#x5F97;&#x4E86;&#x5BF9;&#x8C61;&#x9501;&#xFF0C;&#x8FDB;&#x5165;&#x4E86;&#x540C;&#x6B65;&#x5757;&#xFF0C;&#x5176;&#x4ED6;&#x8BBF;&#x95EE;&#x8BE5;&#x540C;&#x6B65;&#x5757;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x5FC5;&#x987B;&#x963B;&#x585E;&#x5728;&#x540C;&#x6B65;&#x5757;&#x5916;&#x9762;&#x7B49;&#x5F85;&#xFF0C;&#x800C;&#x8FDB;&#x884C;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x548C;&#x5524;&#x9192;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#xFF08;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x5728;&#x7528;&#x6237;&#x6001;&#x4E0E;&#x5185;&#x6838;&#x6001;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x5207;&#x6362;&#xFF0C;&#x4EE3;&#x4EF7;&#x5F88;&#x9AD8;&#xFF0C;&#x4E0D;&#x8FC7;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5BF9;&#x9501;&#x4F18;&#x5316;&#x8FDB;&#x884C;&#x6539;&#x5584;&#xFF09;&#x3002;
</code></pre><p>&#x533A;&#x522B;&#xFF1A;</p>
<pre><code>&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x6700;&#x5927;&#x533A;&#x522B;&#x5C31;&#x662F;&#x5BF9;&#x4E8E;Synchronized&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;java&#x8BED;&#x8A00;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x662F;&#x539F;&#x751F;&#x8BED;&#x6CD5;&#x5C42;&#x9762;&#x7684;&#x4E92;&#x65A5;&#xFF0C;&#x9700;&#x8981;jvm&#x5B9E;&#x73B0;&#x3002;&#x800C;ReentrantLock&#x5B83;&#x662F;JDK 1.5&#x4E4B;&#x540E;&#x63D0;&#x4F9B;&#x7684;API&#x5C42;&#x9762;&#x7684;&#x4E92;&#x65A5;&#x9501;&#xFF0C;&#x9700;&#x8981;lock()&#x548C;unlock()&#x65B9;&#x6CD5;&#x914D;&#x5408;try/finally&#x8BED;&#x53E5;&#x5757;&#x6765;&#x5B8C;&#x6210;&#x3002;
</code></pre><p>###35.&#x4E50;&#x89C2;&#x9501;(Optimistic Locking)&#x4E0E;&#x60B2;&#x89C2;&#x9501;(Pessimistic Locking)<br>   &#x60B2;&#x89C2;&#x9501;&#xFF0C;&#x6B63;&#x5982;&#x5176;&#x540D;&#xFF0C;&#x5B83;&#x6307;&#x7684;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x88AB;&#x5916;&#x754C;&#xFF08;&#x5305;&#x62EC;&#x672C;&#x7CFB;&#x7EDF;&#x5F53;&#x524D;&#x7684;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x6765;&#x81EA; &#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#xFF09;&#x4FEE;&#x6539;&#x6301;&#x4FDD;&#x5B88;&#x6001;&#x5EA6;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;<br>&#x5728;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5904;&#x4E8E;&#x9501;&#x5B9A;&#x72B6;&#x6001;&#x3002;<br>&#x60B2;&#x89C2;&#x9501;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5F80;&#x5F80;&#x4F9D;&#x9760;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x7684;&#x9501;&#x673A;&#x5236;&#xFF08;&#x4E5F;&#x53EA;&#x6709;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x63D0;&#x4F9B;&#x7684;&#x9501;&#x673A;&#x5236;&#x624D;&#x80FD; &#x771F;&#x6B63;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x7684;&#x6392;&#x4ED6;&#x6027;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x672C;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x52A0;&#x9501;&#x673A;&#x5236;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5916;&#x90E8;&#x7CFB; &#x7EDF;&#x4E0D;&#x4F1A;&#x4FEE;&#x6539;&#x6570;&#x636E;&#xFF09;&#x3002; </p>
<p>&#x4E50;&#x89C2;&#x9501;(Optimistic Locking):<br>         &#x76F8;&#x5BF9;&#x60B2;&#x89C2;&#x9501;&#x800C;&#x8A00;&#xFF0C;&#x4E50;&#x89C2;&#x9501;&#x673A;&#x5236;&#x91C7;&#x53D6;&#x4E86;&#x66F4;&#x52A0;&#x5BBD;&#x677E;&#x7684;&#x52A0;&#x9501;&#x673A;&#x5236;&#x3002;&#x60B2;&#x89C2;&#x9501;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x4F9D; &#x9760;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9501;&#x673A;&#x5236;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x64CD;&#x4F5C;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x7684;&#x72EC;&#x5360;&#x6027;&#x3002;&#x4F46;&#x968F;&#x4E4B;</p>
<p>&#x800C;&#x6765;&#x7684;&#x5C31;&#x662F;&#x6570;&#x636E;&#x5E93; &#x6027;&#x80FD;&#x7684;&#x5927;&#x91CF;&#x5F00;&#x9500;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x957F;&#x4E8B;&#x52A1;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5F00;&#x9500;&#x5F80;&#x5F80;&#x65E0;&#x6CD5;&#x627F;&#x53D7;&#x3002; &#x5982;&#x4E00;&#x4E2A;&#x91D1;&#x878D;&#x7CFB;&#x7EDF;&#xFF0C;&#x5F53;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#x5458;&#x8BFB;&#x53D6;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5728;&#x8BFB;&#x51FA;&#x7684;&#x7528;&#x6237;&#x6570;</p>
<p>&#x636E;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB; &#x884C;&#x4FEE;&#x6539;&#x65F6;&#xFF08;&#x5982;&#x66F4;&#x6539;&#x7528;&#x6237;&#x5E10;&#x6237;&#x4F59;&#x989D;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x91C7;&#x7528;&#x60B2;&#x89C2;&#x9501;&#x673A;&#x5236;&#xFF0C;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6574;&#x4E2A;&#x64CD;&#x4F5C;&#x8FC7; &#x7A0B;&#x4E2D;&#xFF08;&#x4ECE;&#x64CD;&#x4F5C;&#x5458;&#x8BFB;&#x51FA;&#x6570;&#x636E;&#x3001;&#x5F00;&#x59CB;&#x4FEE;&#x6539;&#x76F4;&#x81F3;&#x63D0;&#x4EA4;&#x4FEE;&#x6539;&#x7ED3;&#x679C;&#x7684;&#x5168;</p>
<p>&#x8FC7;&#x7A0B;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x5305;&#x62EC;&#x64CD;&#x4F5C; &#x5458;&#x4E2D;&#x9014;&#x53BB;&#x716E;&#x5496;&#x5561;&#x7684;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x8BB0;&#x5F55;&#x59CB;&#x7EC8;&#x5904;&#x4E8E;&#x52A0;&#x9501;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x4EE5;&#x60F3;&#x89C1;&#xFF0C;&#x5982;&#x679C;&#x9762;&#x5BF9;&#x51E0; &#x767E;&#x4E0A;&#x5343;&#x4E2A;&#x5E76;&#x53D1;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x5C06;&#x5BFC;&#x81F4;&#x600E;&#x6837;&#x7684;&#x540E;&#x679C;&#x3002; &#x4E50;</p>
<p>&#x89C2;&#x9501;&#x673A;&#x5236;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2018-03-26T10:28:58.000Z" itemprop="datePublished">2018-03-26</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/2018/03/27/interview3/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    interview3
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2018/03/24/interview/" class="ui tiny button">
                    
                    interview
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2018 <a href="/">LEO CHEN</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a
                href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
